{
  "Artificial Intelligence": [
    {
      "title": "Exclusive: China conditionally approves DeepSeek to buy Nvidia's H200 chips - sources - Reuters",
      "pubDate": "Fri, 30 Jan 2026 06:51:00 GMT"
    },
    {
      "title": "Trump’s AI push exposes a divide in the MAGA movement - CNN",
      "pubDate": "Mon, 02 Feb 2026 10:00:46 GMT"
    },
    {
      "title": "Elon Musk Merges SpaceX With His A.I. Start-Up xAI - The New York Times",
      "pubDate": "Mon, 02 Feb 2026 21:52:06 GMT"
    },
    {
      "title": "Opinion | Where Is A.I. Taking Us? Eight Leading Thinkers Share Their Visions. - The New York Times",
      "pubDate": "Tue, 03 Feb 2026 11:33:01 GMT"
    },
    {
      "title": "More companies are pointing to AI as they lay off employees - CBS News",
      "pubDate": "Tue, 03 Feb 2026 22:44:00 GMT"
    },
    {
      "title": "Global software stocks hit by Anthropic wake-up call on AI disruption - Reuters",
      "pubDate": "Wed, 04 Feb 2026 09:56:02 GMT"
    },
    {
      "title": "Google parent beats on revenue, projects significant AI spending increase - CNBC",
      "pubDate": "Wed, 04 Feb 2026 17:00:01 GMT"
    },
    {
      "title": "Labor unions urge Gov. Gavin Newsom, California lawmakers to rein in artificial intelligence - Yahoo",
      "pubDate": "Thu, 05 Feb 2026 02:21:00 GMT"
    },
    {
      "title": "China warns of security risks linked to OpenClaw open-source AI agent - Reuters",
      "pubDate": "Thu, 05 Feb 2026 09:43:07 GMT"
    },
    {
      "title": "Artificial Intelligence Task Force to guide responsible use of emerging technology - Marquette Today",
      "pubDate": "Thu, 05 Feb 2026 20:21:40 GMT"
    },
    {
      "title": "Kaiser workers launch war against AI, protesting potential job losses and patient harm - latimes.com",
      "pubDate": "Fri, 06 Feb 2026 11:00:00 GMT"
    },
    {
      "title": "Big Tech's $600 billion spending plans exacerbate investors' AI headache - Reuters",
      "pubDate": "Fri, 06 Feb 2026 10:49:48 GMT"
    },
    {
      "title": "The AI boom is so huge it’s causing shortages everywhere else - The Washington Post",
      "pubDate": "Sat, 07 Feb 2026 18:00:00 GMT"
    },
    {
      "title": "US companies accused of ‘AI washing’ in citing artificial intelligence for job losses - The Guardian",
      "pubDate": "Sun, 08 Feb 2026 16:03:00 GMT"
    },
    {
      "title": "As AI enters the operating room, reports arise of botched surgeries and misidentified body parts - Reuters",
      "pubDate": "Mon, 09 Feb 2026 11:30:00 GMT"
    },
    {
      "title": "Trump set off a surge of AI in the federal government. See what happened. - The Washington Post",
      "pubDate": "Mon, 09 Feb 2026 17:32:20 GMT"
    },
    {
      "title": "China's Alibaba launches AI model to power robots as tech giants talk up 'physical AI' - CNBC",
      "pubDate": "Tue, 10 Feb 2026 11:05:49 GMT"
    },
    {
      "title": "China enlists AI to sniff out corruption in public bidding - Reuters",
      "pubDate": "Tue, 10 Feb 2026 15:55:30 GMT"
    },
    {
      "title": "Adam Schiff And John Curtis Introduce Bill To Require Tech To Disclose Copyrighted Works Used In AI Training Models - Deadline",
      "pubDate": "Tue, 10 Feb 2026 14:30:00 GMT"
    },
    {
      "title": "OpenAI opening ChatGPT access to Pentagon - The Hill",
      "pubDate": "Wed, 11 Feb 2026 15:26:00 GMT"
    },
    {
      "title": "Actor takes legal action to stop Albania's government from using her image for 'AI minister' - NBC News",
      "pubDate": "Thu, 12 Feb 2026 14:31:35 GMT"
    },
    {
      "title": "CEO of Google DeepMind: AI-driven cancer drug clinical trials to begin this year, with breakthroughs in robotics expected within the next 18 months. - 富途牛牛",
      "pubDate": "Fri, 13 Feb 2026 05:48:40 GMT"
    },
    {
      "title": "44th Palkhivala Memorial Lecture held on ‘Artificial Intelligence for Aam Aadmi’ - The Hindu",
      "pubDate": "Sat, 14 Feb 2026 19:26:00 GMT"
    },
    {
      "title": "Fed's Barr casts doubt on AI as rate-cutting tool - Yahoo Finance",
      "pubDate": "Tue, 17 Feb 2026 19:08:11 GMT"
    },
    {
      "title": "EU needs to abandon AI ‘doomerism,’ White House official says - politico.eu",
      "pubDate": "Wed, 18 Feb 2026 12:12:00 GMT"
    },
    {
      "title": "US appeals court orders lawyer to pay $2,500 over AI hallucinations in brief - Reuters",
      "pubDate": "Wed, 18 Feb 2026 22:54:27 GMT"
    },
    {
      "title": "Money Talks as India Searches for Its Place in Global A.I. - The New York Times",
      "pubDate": "Thu, 19 Feb 2026 05:01:22 GMT"
    },
    {
      "title": "Reliance to invest $110bn in AI as India's data center sector heats up - Nikkei Asia",
      "pubDate": "Thu, 19 Feb 2026 05:59:00 GMT"
    },
    {
      "title": "AI Boom Faces Power Crisis Without Global Renewable Surge - Crude Oil Prices Today | OilPrice.com",
      "pubDate": "Fri, 20 Feb 2026 12:00:00 GMT"
    },
    {
      "title": "At A.I. Summit, India Tries to Find a Way Between the U.S. and China - The New York Times",
      "pubDate": "Sat, 21 Feb 2026 08:50:35 GMT"
    },
    {
      "title": "Trump unveils ‘Tech Corps’ to promote American AI abroad - CNBC",
      "pubDate": "Mon, 23 Feb 2026 02:43:00 GMT"
    },
    {
      "title": "US AI giant accuses Chinese rivals of mass data theft - The Guardian",
      "pubDate": "Mon, 23 Feb 2026 23:15:00 GMT"
    },
    {
      "title": "Pentagon Gives A.I. Company an Ultimatum - The New York Times",
      "pubDate": "Tue, 24 Feb 2026 23:09:48 GMT"
    },
    {
      "title": "When Chatbots Are Used to Plan Violence, Is There a Duty to Warn? - The New York Times",
      "pubDate": "Thu, 26 Feb 2026 10:33:19 GMT"
    },
    {
      "title": "OpenAI Reaches A.I. Agreement With Defense Dept. After Anthropic Clash - The New York Times",
      "pubDate": "Sat, 28 Feb 2026 03:49:20 GMT"
    },
    {
      "title": "Her husband wanted to use ChatGPT to create sustainable housing. Then it took over his life. - The Guardian",
      "pubDate": "Sat, 28 Feb 2026 10:00:00 GMT"
    }
  ],
  "Israel": [
    {
      "title": "Israel to ban MSF from working in Gaza over refusal to provide staff list - BBC",
      "pubDate": "Sun, 01 Feb 2026 13:20:38 GMT"
    },
    {
      "title": "Israeli settlers kill 19-year-old Palestinian American, officials and witnesses say - NPR",
      "pubDate": "Fri, 20 Feb 2026 08:56:41 GMT"
    },
    {
      "title": "Israeli soldiers shot a Palestinian boy and stood around as he bled to death, video shows - BBC",
      "pubDate": "Thu, 26 Feb 2026 06:01:11 GMT"
    }
  ],
  "Ukraine": [
    {
      "title": "Confusion in Kyiv and Moscow after Trump says Putin agreed to pause attacks for a week - NBC News",
      "pubDate": "Fri, 30 Jan 2026 17:02:05 GMT"
    },
    {
      "title": "Twelve miners killed by Russian strike in Ukraine, officials say - BBC",
      "pubDate": "Mon, 02 Feb 2026 07:00:55 GMT"
    },
    {
      "title": "Kenyan job seekers were lured to Russia, then sent to die in Ukraine - The Washington Post",
      "pubDate": "Mon, 02 Feb 2026 18:00:34 GMT"
    },
    {
      "title": "Thousands without heating on icy night in Ukraine as Russia attacks before talks - The Guardian",
      "pubDate": "Tue, 03 Feb 2026 11:32:00 GMT"
    },
    {
      "title": "Russia-Ukraine Peace Talks Stretch Into a Second Day - The New York Times",
      "pubDate": "Thu, 05 Feb 2026 09:10:22 GMT"
    },
    {
      "title": "At Ukraine’s Request, Starlink Denies Internet Access to Russian Troops - The New York Times",
      "pubDate": "Thu, 05 Feb 2026 21:55:26 GMT"
    },
    {
      "title": "EU Parliament to vote on €90B Ukraine loan Wednesday - politico.eu",
      "pubDate": "Mon, 09 Feb 2026 17:42:00 GMT"
    },
    {
      "title": "Ukraine-Russia war latest: Russian losses mount as Putin’s forces battle in key city - The Independent",
      "pubDate": "Tue, 10 Feb 2026 23:54:11 GMT"
    },
    {
      "title": "Ukraine's nuclear plants still work at limited capacity after Russian strikes - Reuters",
      "pubDate": "Wed, 11 Feb 2026 11:16:19 GMT"
    },
    {
      "title": "Ukraine says its drones hit nearly 1,100 miles into Russia in one of its deepest strikes, security official says - Business Insider",
      "pubDate": "Thu, 12 Feb 2026 15:36:00 GMT"
    },
    {
      "title": "Ukraine wants 20-year US security guarantee to sign peace deal - The Guardian",
      "pubDate": "Sat, 14 Feb 2026 20:34:00 GMT"
    },
    {
      "title": "Deadly explosion rocks Russian military site near St Petersburg - Al Jazeera",
      "pubDate": "Tue, 17 Feb 2026 17:36:46 GMT"
    },
    {
      "title": "Ukraine strikes a key industrial site deep inside Russia - AP News",
      "pubDate": "Sat, 21 Feb 2026 16:50:00 GMT"
    },
    {
      "title": "Russia hits Ukraine energy infrastructure with major missile, drone strikes, Kyiv says - Reuters",
      "pubDate": "Sun, 22 Feb 2026 06:26:50 GMT"
    },
    {
      "title": "Ukraine marks four years since Russia's full invasion as Moscow says its 'goals' not yet achieved - BBC",
      "pubDate": "Tue, 24 Feb 2026 17:14:30 GMT"
    }
  ],
  "Russia": [
    {
      "title": "15 Ukrainian miners killed in Russian drone strike on bus - CNN",
      "pubDate": "Sun, 01 Feb 2026 16:46:35 GMT"
    },
    {
      "title": "Russian hits Ukraine energy sites in 'most powerful blow\" so far this year - BBC",
      "pubDate": "Tue, 03 Feb 2026 13:17:53 GMT"
    },
    {
      "title": "Russia: Crackdown on Dissent Escalates - Human Rights Watch",
      "pubDate": "Wed, 04 Feb 2026 05:01:00 GMT"
    },
    {
      "title": "Sanctions having ‘significant impact’ on Russian economy, says EU special envoy - The Guardian",
      "pubDate": "Thu, 05 Feb 2026 05:00:00 GMT"
    },
    {
      "title": "As West goes after Russia’s oil fleet, Moscow fears for its war funding - The Washington Post",
      "pubDate": "Thu, 05 Feb 2026 11:32:09 GMT"
    },
    {
      "title": "Scoop: U.S. and Russia agree to observe New START nuclear pact after expiration - Axios",
      "pubDate": "Thu, 05 Feb 2026 18:45:00 GMT"
    },
    {
      "title": "US wants Russia and Ukraine to end war by June, says Zelensky - BBC",
      "pubDate": "Sat, 07 Feb 2026 14:05:01 GMT"
    },
    {
      "title": "Russian military scrambles to find Starlink alternative after access blocked - The Guardian",
      "pubDate": "Mon, 09 Feb 2026 16:26:00 GMT"
    },
    {
      "title": "Norway defence chief says Russia could invade to protect nuclear assets - The Guardian",
      "pubDate": "Tue, 10 Feb 2026 17:38:00 GMT"
    },
    {
      "title": "Russia moves to block WhatsApp in messaging app crackdown - BBC",
      "pubDate": "Thu, 12 Feb 2026 03:57:46 GMT"
    },
    {
      "title": "Ukraine-Russia war: Zelensky says Trump only asks Kyiv for concessions not Moscow - The Independent",
      "pubDate": "Sat, 14 Feb 2026 23:18:37 GMT"
    },
    {
      "title": "Russia Preparing Mass Naval Drone Strikes in Black Sea, Ukrainian Intel Warns - UNITED24 Media",
      "pubDate": "Wed, 18 Feb 2026 09:40:20 GMT"
    },
    {
      "title": "Russia Celebrated Him. Now He’s Accused of Having Troops Shoot Themselves. - The New York Times",
      "pubDate": "Thu, 19 Feb 2026 05:01:07 GMT"
    },
    {
      "title": "\"Oriental Ballet\" in Moscow: how Russia preserves Persian dance traditions - TV BRICS",
      "pubDate": "Thu, 19 Feb 2026 11:04:06 GMT"
    },
    {
      "title": "Russian Intelligence Seizes Wagner Mercenary Group's Shadow Empire In Africa - NDTV",
      "pubDate": "Fri, 20 Feb 2026 18:54:42 GMT"
    },
    {
      "title": "How Russia Put Its Future at Risk by Remaking Its Economy for War - The New York Times",
      "pubDate": "Tue, 24 Feb 2026 05:01:17 GMT"
    },
    {
      "title": "Russia accuses Ukraine of seeking to acquire nuclear weapon with help from UK and France - Reuters",
      "pubDate": "Tue, 24 Feb 2026 16:29:36 GMT"
    },
    {
      "title": "Exclusive: Ukraine images indicate Russia used missile at heart of nuclear pact collapse - Reuters",
      "pubDate": "Thu, 26 Feb 2026 07:46:00 GMT"
    }
  ],
  "Donald Trump": [
    {
      "title": "Updates: Trump doubles down on Iran threats as US puts more sanctions - Al Jazeera",
      "pubDate": "Fri, 30 Jan 2026 20:32:18 GMT"
    },
    {
      "title": "Trump taps Fed critic Kevin Warsh to succeed Jerome Powell as chairman - The Washington Post",
      "pubDate": "Sat, 31 Jan 2026 00:51:40 GMT"
    },
    {
      "title": "After Republicans push Clintons to testify on Epstein, Democrats warn they'll haul in Trump - NBC News",
      "pubDate": "Tue, 03 Feb 2026 21:05:00 GMT"
    },
    {
      "title": "Trump says America should move on from Epstein - it may not be that easy - BBC",
      "pubDate": "Thu, 05 Feb 2026 03:27:44 GMT"
    },
    {
      "title": "Revealed: private jet owned by Trump friend used by ICE to deport Palestinians to West Bank - The Guardian",
      "pubDate": "Thu, 05 Feb 2026 17:32:00 GMT"
    },
    {
      "title": "Trump imposes tariffs on countries that import from Iran as nuclear talks resume - The Times of Israel",
      "pubDate": "Fri, 06 Feb 2026 23:13:00 GMT"
    },
    {
      "title": "‘I Didn’t Make a Mistake’: Trump Declines to Apologize for Racist Video of Obamas - The New York Times",
      "pubDate": "Sat, 07 Feb 2026 16:23:00 GMT"
    },
    {
      "title": "Trump to Meet Netanyahu in Washington Amid Tensions With Iran - The New York Times",
      "pubDate": "Wed, 11 Feb 2026 10:46:27 GMT"
    },
    {
      "title": "U.S. Attorney Chosen to Replace Trump Pick Is Quickly Fired by White House - The New York Times",
      "pubDate": "Thu, 12 Feb 2026 13:08:00 GMT"
    },
    {
      "title": "Trump Live Updates: House Backs Resolution to End Canada Tariffs - The New York Times",
      "pubDate": "Thu, 12 Feb 2026 17:15:03 GMT"
    },
    {
      "title": "Trump says he will issue executive order to get voter-ID requirements before midterms - CNBC",
      "pubDate": "Fri, 13 Feb 2026 21:51:48 GMT"
    },
    {
      "title": "Trump says he will be 'indirectly' involved in Iran nuclear talks - BBC",
      "pubDate": "Tue, 17 Feb 2026 05:14:21 GMT"
    },
    {
      "title": "Whirlwind day of diplomacy as US holds talks on Iran and Ukraine in Geneva - CNN",
      "pubDate": "Tue, 17 Feb 2026 16:53:00 GMT"
    },
    {
      "title": "Live Updates: Trump Says U.S. Will Commit $10 Billion to Board of Peace for Gaza Redevelopment - The New York Times",
      "pubDate": "Thu, 19 Feb 2026 17:25:53 GMT"
    },
    {
      "title": "Armed Man Is Fatally Shot at Mar-a-Lago, Secret Service Says - The New York Times",
      "pubDate": "Sun, 22 Feb 2026 14:19:15 GMT"
    },
    {
      "title": "Trump Considers Targeted Strike Against Iran, Followed by Larger Attack - The New York Times",
      "pubDate": "Sun, 22 Feb 2026 21:50:06 GMT"
    },
    {
      "title": "Trump to address economy, tariffs and foreign policy in 2026 State of the Union address - CNN",
      "pubDate": "Tue, 24 Feb 2026 17:16:00 GMT"
    }
  ],
  "China": [
    {
      "title": "Trump’s Embrace of Weaker Dollar Gives China an Opening - Bloomberg.com",
      "pubDate": "Mon, 02 Feb 2026 10:59:02 GMT"
    },
    {
      "title": "Trump to Launch $12 Billion Critical Mineral Stockpile to Blunt Reliance on China - Bloomberg",
      "pubDate": "Mon, 02 Feb 2026 13:16:27 GMT"
    },
    {
      "title": "U.S. accuses China of secret nuclear testing as it calls for broad new arms treaty after New START - NBC News",
      "pubDate": "Fri, 06 Feb 2026 14:21:45 GMT"
    },
    {
      "title": "China critic and former media tycoon Jimmy Lai is sentenced to 20 years in a Hong Kong security case - NPR",
      "pubDate": "Mon, 09 Feb 2026 07:52:28 GMT"
    },
    {
      "title": "China Urges Banks to Curb Exposure to US Treasuries - Bloomberg.com",
      "pubDate": "Mon, 09 Feb 2026 06:14:00 GMT"
    },
    {
      "title": "China showcases new Moon ship and reusable rocket in one extraordinary test - Ars Technica",
      "pubDate": "Wed, 11 Feb 2026 19:35:41 GMT"
    },
    {
      "title": "The Complicated Stakes of the AI Race Between the U.S. and China - Time Magazine",
      "pubDate": "Wed, 18 Feb 2026 17:10:35 GMT"
    },
    {
      "title": "After alleged test, US believes China building new generation of nukes — report - The Times of Israel",
      "pubDate": "Sat, 21 Feb 2026 10:07:21 GMT"
    },
    {
      "title": "Exclusive: China's DeepSeek trained AI model on Nvidia's best chip despite US ban, official says - Reuters",
      "pubDate": "Tue, 24 Feb 2026 00:10:00 GMT"
    },
    {
      "title": "China slams dozens of Japanese companies with export curbs - Financial Times",
      "pubDate": "Tue, 24 Feb 2026 08:35:07 GMT"
    },
    {
      "title": "How China is masking drone flights in potential Taiwan rehearsal - Reuters",
      "pubDate": "Thu, 26 Feb 2026 05:05:00 GMT"
    },
    {
      "title": "Former U.S. Air Force Officer Is Accused of Training Chinese Military Pilots - The New York Times",
      "pubDate": "Sat, 28 Feb 2026 05:06:32 GMT"
    }
  ],
  "AI Safety": [
    {
      "title": "South Korea Enacts Global Milestone Of AI Safety Laws Including Covering Mental Health Impacts - Forbes",
      "pubDate": "Fri, 30 Jan 2026 08:15:00 GMT"
    },
    {
      "title": "NIOSH Issues Guidance on Managing AI Safety Risks in the Workplace - Lab Manager",
      "pubDate": "Fri, 30 Jan 2026 13:01:06 GMT"
    },
    {
      "title": "AI Chatbots Named Top Health Tech Danger for 2026, Safety Group Warns - MyChesCo",
      "pubDate": "Sat, 31 Jan 2026 01:00:00 GMT"
    },
    {
      "title": "U.S. Withholds Support From Global AI Safety Report - AOL.com",
      "pubDate": "Tue, 03 Feb 2026 05:30:19 GMT"
    },
    {
      "title": "AI Safety Tests Are Failing: 210 Benchmarks Reveal Critical Flaws - Quantum Zeitgeist",
      "pubDate": "Thu, 05 Feb 2026 00:40:25 GMT"
    },
    {
      "title": "New York Enacts RAISE Act, Setting Nation-Leading Rules for Frontier AI Safety - CDO Magazine",
      "pubDate": "Fri, 06 Feb 2026 13:28:00 GMT"
    },
    {
      "title": "California ballot proposal looking to create AI Safety Commission cleared for signature gathering - ABC10",
      "pubDate": "Fri, 06 Feb 2026 20:41:00 GMT"
    },
    {
      "title": "New York CEO Dan Herbatschek of Ramsey Theory Capital Delivers New Real-Time Governance for Enterprise AI Systems as AI Safety Laws Accelerate - The Manila Times",
      "pubDate": "Sat, 07 Feb 2026 16:51:05 GMT"
    },
    {
      "title": "The Ouroboros Moment: OpenAI Says Its Newest AI Was Built by AI Itself — And the Industry Is Taking Notice - WebProNews",
      "pubDate": "Sun, 08 Feb 2026 20:59:36 GMT"
    },
    {
      "title": "How Microsoft obliterated safety guardrails on popular AI models - with just one prompt - ZDNET",
      "pubDate": "Mon, 09 Feb 2026 17:00:00 GMT"
    },
    {
      "title": "Anthropic's Head Of AI Safety Quits, Warns Of 'World In Peril' In Cryptic Resignation Letter - NDTV",
      "pubDate": "Tue, 10 Feb 2026 07:05:15 GMT"
    },
    {
      "title": "Anthropic says latest model could be misused for \"heinous crimes\" like chemical weapons - Axios",
      "pubDate": "Wed, 11 Feb 2026 13:58:31 GMT"
    },
    {
      "title": "Anthropic AI safety researcher quits with 'world in peril' warning - BBC",
      "pubDate": "Thu, 12 Feb 2026 12:21:10 GMT"
    },
    {
      "title": "Claude AI safety test sparks outrage after simulated threats to prevent being switched off - The Economic Times",
      "pubDate": "Fri, 13 Feb 2026 12:25:13 GMT"
    },
    {
      "title": "Connecticut AI Legislation to Prioritize Child, Consumer Safety - GovTech",
      "pubDate": "Fri, 13 Feb 2026 18:58:37 GMT"
    },
    {
      "title": "Anthropic Donates $20 Million for AI Regulation While OpenAI Abstains - Букви",
      "pubDate": "Sat, 14 Feb 2026 01:26:54 GMT"
    },
    {
      "title": "AI bot criticises engineer for rejecting its code, sparking concerns over AI bullying and safety - Times of India",
      "pubDate": "Sat, 14 Feb 2026 20:56:00 GMT"
    },
    {
      "title": "AI Safety Alarm: Yoshua Bengio and Global Experts Warn Artificial Intelligence Could Slip Beyond Human Control - kmjournal.net",
      "pubDate": "Sun, 15 Feb 2026 01:25:47 GMT"
    },
    {
      "title": "Trump leans on Utah Republicans to scrap AI safety bill - Financial Times",
      "pubDate": "Sun, 15 Feb 2026 15:14:59 GMT"
    },
    {
      "title": "'The world is in peril' — the signs of a dark AI reckoning are starting to pile up - TechRadar",
      "pubDate": "Mon, 16 Feb 2026 17:00:00 GMT"
    },
    {
      "title": "AI safety shake-up: Top researchers quit OpenAI and Anthropic, warning of risks - Scripps News",
      "pubDate": "Tue, 17 Feb 2026 03:36:06 GMT"
    },
    {
      "title": "AI 'Arms Race' Risks Human Extinction, Warns Top Computing Expert - Barron's",
      "pubDate": "Tue, 17 Feb 2026 13:11:00 GMT"
    },
    {
      "title": "White House moves to kill Utah's AI safety bill with $1M penalty cap - PPC Land",
      "pubDate": "Tue, 17 Feb 2026 21:53:04 GMT"
    },
    {
      "title": "OpenAI has deleted the word ‘safely’ from its mission; will AI serve society or shareholders? - WMNF 88.5 FM",
      "pubDate": "Wed, 18 Feb 2026 10:11:51 GMT"
    },
    {
      "title": "Defense Department and Anthropic Square Off in Dispute Over A.I. Safety - The New York Times - The New York Times",
      "pubDate": "Wed, 18 Feb 2026 23:05:37 GMT"
    },
    {
      "title": "Meta Director of AI Safety Allows AI Agent to Accidentally Delete Her Inbox - 404 Media",
      "pubDate": "Mon, 23 Feb 2026 20:04:13 GMT"
    }
  ],
  "Data Breach": [
    {
      "title": "Massive Chinese data breach allegedly spills 8.7 billion records - here's what we know - TechRadar",
      "pubDate": "Wed, 04 Feb 2026 19:35:00 GMT"
    },
    {
      "title": "SoundCloud data breach exposes 29.8 million user accounts - foxnews.com",
      "pubDate": "Sun, 08 Feb 2026 14:01:15 GMT"
    },
    {
      "title": "PayPal Data Breach Confirmed—Money Was Stolen, Passwords Now Reset - Forbes",
      "pubDate": "Sat, 21 Feb 2026 12:55:00 GMT"
    }
  ],
  "Cybersecurity": [
    {
      "title": "Notepad++ says Chinese government hackers hijacked its software updates for months - TechCrunch",
      "pubDate": "Mon, 02 Feb 2026 18:09:34 GMT"
    },
    {
      "title": "The Social Security data breach is a national-security disaster that could hurt Americans for the rest of their lives: whistleblower - MarketWatch",
      "pubDate": "Wed, 04 Feb 2026 17:42:00 GMT"
    },
    {
      "title": "Cybersecurity experts warn Android users about malicious apps on Google Play - KUTV",
      "pubDate": "Thu, 05 Feb 2026 04:07:18 GMT"
    },
    {
      "title": "Claude Opus 4.6 Finds 500+ High-Severity Flaws Across Major Open-Source Libraries - The Hacker News",
      "pubDate": "Fri, 06 Feb 2026 05:49:00 GMT"
    },
    {
      "title": "Exclusive: Palo Alto chose not to tie China to hacking campaign for fear of retaliation from Beijing, sources say - Reuters",
      "pubDate": "Thu, 12 Feb 2026 18:03:25 GMT"
    },
    {
      "title": "Massive Cyberattack Exposes Thousands of Personal Records in Iceland - Iceland Review",
      "pubDate": "Sun, 15 Feb 2026 00:30:53 GMT"
    },
    {
      "title": "Safe and Inclusive E‑Society: How Lithuania Is Bracing for AI‑Driven Cyber Fraud - The Hacker News",
      "pubDate": "Mon, 16 Feb 2026 11:55:00 GMT"
    },
    {
      "title": "The AI world’s ‘connective tissue’ is woefully insecure, Cisco warns - Cybersecurity Dive",
      "pubDate": "Thu, 19 Feb 2026 16:43:39 GMT"
    },
    {
      "title": "Chinese Hackers Bypassed a U.S. Government VPN, Raising New Cybersecurity Concerns - Yahoo",
      "pubDate": "Fri, 20 Feb 2026 17:09:49 GMT"
    },
    {
      "title": "Patients face canceled surgeries and delayed care amid UMMC cyberattack - Mississippi Today",
      "pubDate": "Fri, 20 Feb 2026 19:56:52 GMT"
    },
    {
      "title": "Symmetric Warfare & Non-Human Identities? Cybersecurity Risks Of Agentic AI - Forbes",
      "pubDate": "Mon, 23 Feb 2026 00:39:29 GMT"
    },
    {
      "title": "Anthropic's new code security tool causes market panic - Axios",
      "pubDate": "Mon, 23 Feb 2026 21:38:52 GMT"
    },
    {
      "title": "Ransomware Surges 49% as AI Makes Cyberattacks Faster and Easier, IBM Says - TipRanks",
      "pubDate": "Thu, 26 Feb 2026 19:52:27 GMT"
    },
    {
      "title": "Data Broker Breaches Fueled Nearly $21 Billion in Identity-Theft Losses - WIRED",
      "pubDate": "Fri, 27 Feb 2026 10:00:00 GMT"
    },
    {
      "title": "Social Security numbers of over 1.2M ‘potentially’ exposed in UH cyberattack - Honolulu Star-Advertiser",
      "pubDate": "Sat, 28 Feb 2026 10:07:14 GMT"
    }
  ],
  "US Economy": [
    {
      "title": "U.S. Economy Shed Nearly 1 Million Job Openings Last Year - The Wall Street Journal",
      "pubDate": "Thu, 05 Feb 2026 15:41:00 GMT"
    },
    {
      "title": "January job growth tops expectations, but economists question sustainability - The Christian Science Monitor",
      "pubDate": "Wed, 11 Feb 2026 21:54:32 GMT"
    },
    {
      "title": "Healthcare Work Propels U.S. to Strongest Job Growth in More Than a Year - The Wall Street Journal",
      "pubDate": "Wed, 11 Feb 2026 22:22:00 GMT"
    },
    {
      "title": "White House Sees Win After 2 Strong Economic Reports - The New York Times",
      "pubDate": "Fri, 13 Feb 2026 21:06:21 GMT"
    },
    {
      "title": "The U.S. economy has grown faster than anyone predicted. Here’s why. - MarketWatch",
      "pubDate": "Thu, 19 Feb 2026 20:37:00 GMT"
    },
    {
      "title": "US economic growth slowed in fourth quarter of 2025 amid government shutdown - The Guardian",
      "pubDate": "Fri, 20 Feb 2026 15:31:00 GMT"
    },
    {
      "title": "Tariffs Are a Wild Card for the Economy Again - The Wall Street Journal",
      "pubDate": "Mon, 23 Feb 2026 02:00:00 GMT"
    },
    {
      "title": "Supreme Court ruling throws Trump administration's tariff strategy into flux. What it means for global trade, U.S. economy - CNBC",
      "pubDate": "Mon, 23 Feb 2026 22:53:54 GMT"
    },
    {
      "title": "IMF sees ‘buoyant’ US economy accelerating this year but warns of risks from tariffs, rising debt - WAVY.com",
      "pubDate": "Wed, 25 Feb 2026 23:59:24 GMT"
    }
  ],
  "Earthquakes": [
    {
      "title": "Scientists Map the Invisible Fault That Could Trigger the Next Major Earthquake - SciTechDaily",
      "pubDate": "Tue, 10 Feb 2026 01:38:49 GMT"
    }
  ],
  "OpenAI": [
    {
      "title": "Nvidia, OpenAI appear stalled on their mega deal. But the AI giants still need each other - CNBC",
      "pubDate": "Tue, 03 Feb 2026 22:22:05 GMT"
    },
    {
      "title": "Microsoft AI CEO Mustafa Suleyman confirms company is 'dumping' OpenAI, says: My personal mission at Micr - Times of India",
      "pubDate": "Sat, 14 Feb 2026 05:38:00 GMT"
    },
    {
      "title": "Exclusive | OpenAI Employees Raised Alarms About Canada Shooting Suspect Months Ago - The Wall Street Journal",
      "pubDate": "Sat, 21 Feb 2026 17:04:00 GMT"
    }
  ],
  "Gaza": [
    {
      "title": "Updates: Israel kills 31, including children, in Gaza ceasefire violation - Al Jazeera",
      "pubDate": "Sat, 31 Jan 2026 20:01:29 GMT"
    },
    {
      "title": "Updates: Gaza struggles for clean water, Hamas says ceasefire ‘meaningless’ - Al Jazeera",
      "pubDate": "Sat, 07 Feb 2026 19:36:35 GMT"
    },
    {
      "title": "Updates: Israel kills 11 Palestinians in Gaza in 24 hours - Al Jazeera",
      "pubDate": "Sun, 15 Feb 2026 15:05:19 GMT"
    },
    {
      "title": "Gaza death toll in early part of war far higher than reported, says Lancet study - The Guardian",
      "pubDate": "Wed, 18 Feb 2026 23:30:00 GMT"
    }
  ],
  "Climate Change": [
    {
      "title": "Climate Litigation Updates (January 30, 2026) - Sabin Center for Climate Change Law",
      "pubDate": "Fri, 30 Jan 2026 03:13:47 GMT"
    },
    {
      "title": "Fossil fuel firms may have to pay for climate damage under proposed UN tax - The Guardian",
      "pubDate": "Sun, 01 Feb 2026 12:02:00 GMT"
    },
    {
      "title": "A Trump ‘Blockade’ Is Stalling Hundreds of Wind and Solar Projects Nationwide - The New York Times",
      "pubDate": "Wed, 04 Feb 2026 17:12:54 GMT"
    },
    {
      "title": "*Climate Change and Wildlife: Advancing Research and On-the-Ground Solutions - The Wildlife Society",
      "pubDate": "Thu, 05 Feb 2026 15:35:25 GMT"
    },
    {
      "title": "Icy weather highlights open questions about climate change effects - USA Today",
      "pubDate": "Sat, 07 Feb 2026 19:29:00 GMT"
    },
    {
      "title": "EPA set to repeal landmark finding that climate change endangers the public - The Hill",
      "pubDate": "Tue, 10 Feb 2026 14:55:00 GMT"
    },
    {
      "title": "Climate Change Is Erased From a Manual for Federal Judges - The New York Times",
      "pubDate": "Tue, 10 Feb 2026 20:02:06 GMT"
    },
    {
      "title": "Scientists thought they understood global warming. Then the past three years happened. - The Washington Post",
      "pubDate": "Wed, 11 Feb 2026 18:00:05 GMT"
    },
    {
      "title": "Burgum calls energy transition a ‘fantasy’ as EPA guts climate regulations - E&E News by POLITICO",
      "pubDate": "Thu, 12 Feb 2026 21:00:00 GMT"
    },
    {
      "title": "EU ill-prepared for worsening climate change, advisers say - Reuters",
      "pubDate": "Mon, 16 Feb 2026 23:04:32 GMT"
    },
    {
      "title": "‘Daunting but doable’: Europe urged to prepare for 3C of global heating - The Guardian",
      "pubDate": "Mon, 16 Feb 2026 23:03:00 GMT"
    },
    {
      "title": "As Trump Obliterates Climate Efforts, States Try to Fill the Gap - The New York Times",
      "pubDate": "Wed, 18 Feb 2026 14:22:13 GMT"
    },
    {
      "title": "E.P.A. Faces First Lawsuit Over Its Killing of Major Climate Rule - The New York Times - The New York Times",
      "pubDate": "Wed, 18 Feb 2026 13:25:04 GMT"
    },
    {
      "title": "AI data centre surge would put UK’s climate change targets at risk - The Times",
      "pubDate": "Sun, 22 Feb 2026 18:30:57 GMT"
    },
    {
      "title": "Supreme Court agrees to hear from oil and gas companies trying to block climate change lawsuits - AP News",
      "pubDate": "Mon, 23 Feb 2026 20:58:00 GMT"
    },
    {
      "title": "Uncertainties of enhanced rock weathering for climate-change mitigation - Nature",
      "pubDate": "Tue, 24 Feb 2026 08:47:41 GMT"
    },
    {
      "title": "Tropical plants flowering months earlier or later because of climate crisis – study - The Guardian",
      "pubDate": "Thu, 26 Feb 2026 02:30:00 GMT"
    },
    {
      "title": "California Becomes First State To Require Climate Change Reporting - Forbes",
      "pubDate": "Fri, 27 Feb 2026 01:44:02 GMT"
    },
    {
      "title": "Study: Grasslands could shrink by half due to climate change - CNN",
      "pubDate": "Fri, 27 Feb 2026 09:18:55 GMT"
    },
    {
      "title": "A Tiny Caribbean Island Sued the Netherlands Over Climate Change, and Won - Inside Climate News",
      "pubDate": "Sat, 28 Feb 2026 09:50:00 GMT"
    }
  ],
  "National Security": [
    {
      "title": "Trump’s UAE Chip Deal Is a National Security Risk - Bloomberg",
      "pubDate": "Mon, 02 Feb 2026 10:00:26 GMT"
    }
  ],
  "North Korea": [
    {
      "title": "U.S. to Allow Aid to North Korea to Resume, While Outreach Stalls - The Wall Street Journal",
      "pubDate": "Fri, 06 Feb 2026 08:25:00 GMT"
    }
  ],
  "Iran": [
    {
      "title": "Updates: Iran announces naval drills near US warships amid tension - Al Jazeera",
      "pubDate": "Sat, 31 Jan 2026 06:36:12 GMT"
    },
    {
      "title": "Exclusive: Iran fears US strike may reignite protests, imperil rule, sources say - Reuters",
      "pubDate": "Mon, 02 Feb 2026 17:33:33 GMT"
    },
    {
      "title": "Iran’s Revolutionary Guards seize 2 foreign-crewed oil tankers in Gulf - The Times of Israel",
      "pubDate": "Thu, 05 Feb 2026 11:21:40 GMT"
    },
    {
      "title": "US-Iran updates: FM Araghchi says latest round of talks ‘a good start’ - Al Jazeera",
      "pubDate": "Fri, 06 Feb 2026 15:07:01 GMT"
    },
    {
      "title": "Iran sentences Nobel laureate Mohammadi to seven more years in prison - Al Jazeera",
      "pubDate": "Sun, 08 Feb 2026 21:22:30 GMT"
    },
    {
      "title": "As Diplomats Talk, Pentagon Prepares for Possible War With Iran - The New York Times",
      "pubDate": "Fri, 13 Feb 2026 17:15:58 GMT"
    },
    {
      "title": "Exclusive: US military preparing for potentially weeks-long Iran operations - Reuters",
      "pubDate": "Fri, 13 Feb 2026 23:05:27 GMT"
    },
    {
      "title": "Iran ready to discuss compromises to reach nuclear deal, minister tells BBC in Tehran - BBC",
      "pubDate": "Sun, 15 Feb 2026 15:07:40 GMT"
    },
    {
      "title": "US build-up of warships and fighter jets tracked near Iran - BBC",
      "pubDate": "Mon, 16 Feb 2026 18:17:18 GMT"
    },
    {
      "title": "US renews threat of military action as Iran, Russia announce naval drills - Al Jazeera",
      "pubDate": "Thu, 19 Feb 2026 03:20:31 GMT"
    },
    {
      "title": "Exclusive | Trump Weighs Initial Limited Strike to Force Iran Into Nuclear Deal - The Wall Street Journal",
      "pubDate": "Thu, 19 Feb 2026 21:20:00 GMT"
    },
    {
      "title": "Iran agreed secret shoulder-fired missile deal with Russia - Financial Times",
      "pubDate": "Sun, 22 Feb 2026 16:00:07 GMT"
    },
    {
      "title": "Trump's top general warns of Iran strike risks - Axios",
      "pubDate": "Mon, 23 Feb 2026 17:53:20 GMT"
    },
    {
      "title": "Exclusive: Iran nears deal to buy supersonic anti-ship missiles from China - Reuters",
      "pubDate": "Tue, 24 Feb 2026 09:44:55 GMT"
    },
    {
      "title": "Trump 'not thrilled' with Iran after latest talks on nuclear programme - BBC",
      "pubDate": "Fri, 27 Feb 2026 22:21:35 GMT"
    },
    {
      "title": "Iran targeted with cyberattacks as Israel and US carry out strikes - The Times of Israel",
      "pubDate": "Sat, 28 Feb 2026 08:04:04 GMT"
    }
  ],
  "Climate": [
    {
      "title": "Flawed economic models mean climate crisis could crash global economy, experts warn - The Guardian",
      "pubDate": "Thu, 05 Feb 2026 00:03:00 GMT"
    },
    {
      "title": "Climate ‘Superfund’ Bills Spread Nationwide, Despite Legal Battles - The New York Times",
      "pubDate": "Fri, 06 Feb 2026 16:03:19 GMT"
    },
    {
      "title": "Trump just blew up a load-bearing pillar of climate regulation in the US. What happens now? - vox.com",
      "pubDate": "Thu, 12 Feb 2026 16:55:00 GMT"
    },
    {
      "title": "Italian PM Meloni offers climate‑shock debt suspension for African states - Reuters",
      "pubDate": "Sat, 14 Feb 2026 08:55:19 GMT"
    },
    {
      "title": "U.S. Tells International Energy Agency to Drop Its Focus on Climate Change - The New York Times",
      "pubDate": "Thu, 19 Feb 2026 19:29:48 GMT"
    }
  ],
  "Cybersecurity and Infrastructure Security Agency": [
    {
      "title": "After major Poland energy grid cyberattack, CISA issues warning to U.S. audience - CyberScoop",
      "pubDate": "Tue, 10 Feb 2026 16:04:46 GMT"
    }
  ],
  "Hacking": [
    {
      "title": "Hackers breach govt systems in 37 countries in vast spying plot - The Economic Times",
      "pubDate": "Mon, 09 Feb 2026 00:30:00 GMT"
    },
    {
      "title": "Karma strikes as AI hacking platform WormGPT gets hacked itself - Cybernews",
      "pubDate": "Tue, 10 Feb 2026 09:45:00 GMT"
    }
  ],
  "Drones": [
    {
      "title": "Poland Inks $4.3 Billion Deal for ‘Drone Wall’ to Deter Russia - Bloomberg.com",
      "pubDate": "Fri, 30 Jan 2026 09:49:13 GMT"
    },
    {
      "title": "US fighter jet shoots down Iranian drone approaching US aircraft carrier - ABC News",
      "pubDate": "Tue, 03 Feb 2026 18:56:15 GMT"
    },
    {
      "title": "UN Human Rights Chief Raises Alarm After Drone Strikes Kill More Than 50 Civilians in Sudan - U.S. News & World Report",
      "pubDate": "Wed, 18 Feb 2026 16:28:00 GMT"
    },
    {
      "title": "Russia Downs 113 Ukrainian Drones in Massive Overnight Attack - kurdistan24.net",
      "pubDate": "Thu, 19 Feb 2026 08:47:39 GMT"
    }
  ],
  "Federal Reserve": [
    {
      "title": "Trump nominates Kevin Warsh as new Federal Reserve chair - BBC",
      "pubDate": "Fri, 30 Jan 2026 15:22:30 GMT"
    },
    {
      "title": "Most want Supreme Court to rule against Trump on tariffs, Federal Reserve removal: Polling - The Hill",
      "pubDate": "Thu, 05 Feb 2026 17:09:00 GMT"
    },
    {
      "title": "Federal Reserve governor warns AI could lead to rise in unemployment rate - The Hill",
      "pubDate": "Tue, 24 Feb 2026 17:15:00 GMT"
    }
  ],
  "Department of Homeland Security": [
    {
      "title": "Trump orders DHS to stay away from protests in Democratic-led cities unless federal help sought - Reuters",
      "pubDate": "Sat, 31 Jan 2026 21:13:47 GMT"
    },
    {
      "title": "Senators Clash Over Immigration Enforcement, Risking a D.H.S. Shutdown - The New York Times",
      "pubDate": "Thu, 05 Feb 2026 22:44:47 GMT"
    },
    {
      "title": "DHS warned its independent watchdog that Noem can kill its investigations, senator says - NBC News",
      "pubDate": "Fri, 06 Feb 2026 23:42:05 GMT"
    },
    {
      "title": "The Department of Homeland Security Is Demanding That Google Turn Over Information About Random Critics - Yahoo",
      "pubDate": "Sun, 08 Feb 2026 20:00:00 GMT"
    },
    {
      "title": "Democrats reject latest White House offer on ICE reforms with Homeland Security funding hanging in the balance - CBS News",
      "pubDate": "Tue, 10 Feb 2026 11:54:35 GMT"
    },
    {
      "title": "Democrats will block new stopgap to fund Homeland Security Department - The Hill",
      "pubDate": "Wed, 11 Feb 2026 15:04:00 GMT"
    },
    {
      "title": "DHS Funding Lapse Could Stall Cyber Progress, CISA and Secret Service Warn - MeriTalk",
      "pubDate": "Thu, 12 Feb 2026 03:19:07 GMT"
    },
    {
      "title": "Partial government shutdown looms as ICE negotiations stall - The Washington Post",
      "pubDate": "Thu, 12 Feb 2026 16:31:40 GMT"
    },
    {
      "title": "What to know about the Homeland Security shutdown starting this weekend - AP News",
      "pubDate": "Fri, 13 Feb 2026 21:56:00 GMT"
    },
    {
      "title": "Live updates: DHS shuts down without funding deal; House and Senate out all week - The Hill",
      "pubDate": "Mon, 16 Feb 2026 13:39:00 GMT"
    },
    {
      "title": "US Homeland Security Department’s funding negotiations stall - Al Jazeera",
      "pubDate": "Mon, 16 Feb 2026 22:32:53 GMT"
    },
    {
      "title": "DHS shutdown has no clear off-ramp: 5 takeaways - The Hill",
      "pubDate": "Tue, 17 Feb 2026 11:00:00 GMT"
    },
    {
      "title": "New DHS order could lead to detention of thousands of legal refugees in the U.S. - PBS",
      "pubDate": "Thu, 19 Feb 2026 23:45:19 GMT"
    },
    {
      "title": "White House plays hardball with Democrats over DHS shutdown - The Hill",
      "pubDate": "Tue, 24 Feb 2026 11:00:00 GMT"
    },
    {
      "title": "DHS funding impasse here to stay as administration ratchets up pressure - Politico",
      "pubDate": "Sat, 28 Feb 2026 00:30:00 GMT"
    }
  ],
  "Terrorism": [
    {
      "title": "Westminster man pleads guilty to federal terrorism charge - The Denver Post",
      "pubDate": "Fri, 06 Feb 2026 20:41:24 GMT"
    },
    {
      "title": "Artificial Intelligence and Terrorism: a Warning from Chinese and American Experts - Le Figaro",
      "pubDate": "Wed, 11 Feb 2026 04:00:00 GMT"
    },
    {
      "title": "FBI and Las Vegas police investigate suspected case of terrorism - The Guardian",
      "pubDate": "Sat, 21 Feb 2026 04:02:00 GMT"
    },
    {
      "title": "Russia Moves Closer to Banning Telegram App, Saying It Foments Terrorism - The New York Times",
      "pubDate": "Tue, 24 Feb 2026 17:22:39 GMT"
    }
  ],
  "Privacy": [
    {
      "title": "Protecting the right to privacy in the age of surveillance - Cape Gazette",
      "pubDate": "Tue, 03 Feb 2026 10:08:25 GMT"
    }
  ],
  "United Nations": [
    {
      "title": "UN risks 'imminent financial collapse', secretary general warns - BBC",
      "pubDate": "Fri, 30 Jan 2026 16:24:18 GMT"
    },
    {
      "title": "UN warns! The world is entering ‘water bankruptcy’ and billions could be in serious danger - The Times of India",
      "pubDate": "Sat, 21 Feb 2026 06:59:00 GMT"
    }
  ],
  "Nuclear Power": [
    {
      "title": "US Government Seeking Volunteers to Store Nuclear Sludge - Futurism",
      "pubDate": "Sun, 08 Feb 2026 14:45:00 GMT"
    },
    {
      "title": "US military airlifts small reactor as Trump pushes to quickly deploy nuclear power - NPR",
      "pubDate": "Sat, 21 Feb 2026 15:23:17 GMT"
    }
  ],
  "Public Health": [
    {
      "title": "In one South Carolina county, measles starts to feel like next pandemic - BBC",
      "pubDate": "Fri, 30 Jan 2026 11:32:26 GMT"
    },
    {
      "title": "The US has surpassed 1,100 measles cases in two months. Expect more deaths next - CNN",
      "pubDate": "Fri, 27 Feb 2026 15:17:18 GMT"
    }
  ],
  "The Pentagon": [
    {
      "title": "Exclusive | Pentagon Prepares Second Aircraft Carrier to Deploy to the Middle East - WSJ - The Wall Street Journal",
      "pubDate": "Thu, 12 Feb 2026 01:32:00 GMT"
    },
    {
      "title": "Pentagon Flags Risks of a Major Operation Against Iran - WSJ",
      "pubDate": "Mon, 23 Feb 2026 21:35:00 GMT"
    }
  ],
  "Democratic Party": [
    {
      "title": "A Pro-Israel Group’s Move Backfires as Gaza Tensions Flare in Midterms - The New York Times",
      "pubDate": "Fri, 06 Feb 2026 17:24:21 GMT"
    },
    {
      "title": "White House Rejects Democrats’ Offer for Deal to Reopen D.H.S. - The New York Times",
      "pubDate": "Tue, 17 Feb 2026 23:07:22 GMT"
    }
  ],
  "Environment": [
    {
      "title": "EU faces €440bn cost from PFAS pollution – report - Ecotextile News",
      "pubDate": "Mon, 09 Feb 2026 09:22:42 GMT"
    },
    {
      "title": "Some scientists think we should stop cleaning up the plastic that is trashing Earth's oceans - Earth.com",
      "pubDate": "Fri, 13 Feb 2026 08:48:17 GMT"
    }
  ],
  "US Politics": [
    {
      "title": "Senate passes $1.2T government funding deal — but a brief shutdown is certain - Politico",
      "pubDate": "Sat, 31 Jan 2026 00:28:38 GMT"
    },
    {
      "title": "Donald Trump signs bill to end partial US government shutdown - Financial Times",
      "pubDate": "Tue, 03 Feb 2026 20:31:34 GMT"
    },
    {
      "title": "House Democrats help Mike Johnson end government shutdown, fund DHS and ICE - Axios",
      "pubDate": "Wed, 04 Feb 2026 05:51:26 GMT"
    },
    {
      "title": "Supreme Court allows California to use new voting map boosting Democrats - BBC",
      "pubDate": "Wed, 04 Feb 2026 20:20:30 GMT"
    },
    {
      "title": "National Governors Association meeting with Trump will not be held after Democrats uninvited - FOX 5 DC",
      "pubDate": "Tue, 10 Feb 2026 23:25:17 GMT"
    }
  ],
  "Nuclear Fusion": [
    {
      "title": "Controllable Nuclear Fusion Secures Another 500 Million Yuan in Financing - 36 Kr",
      "pubDate": "Wed, 04 Feb 2026 03:13:08 GMT"
    }
  ],
  "Quantum Computing": [
    {
      "title": "New Discovery In Laser Technology Could Change Everything For Quantum Computing - bgr.com",
      "pubDate": "Sun, 01 Feb 2026 11:17:00 GMT"
    },
    {
      "title": "Record-breaking quantum simulator could unlock new materials - New Scientist",
      "pubDate": "Wed, 04 Feb 2026 16:01:35 GMT"
    },
    {
      "title": "This Maryland lab’s quantum computer could cure cancer — and steal passwords - The Washington Post",
      "pubDate": "Sun, 08 Feb 2026 18:00:00 GMT"
    },
    {
      "title": "Physicists may have found the missing link for quantum computers - EurekAlert!",
      "pubDate": "Fri, 20 Feb 2026 14:48:26 GMT"
    },
    {
      "title": "Researchers may have observed triplet superconductivity - the holy grail in quantum computing - The Brighter Side of News",
      "pubDate": "Fri, 27 Feb 2026 15:07:00 GMT"
    }
  ],
  "Geopolitics": [
    {
      "title": "China’s Xi and Russia’s Putin hold talks by video - AP News",
      "pubDate": "Wed, 04 Feb 2026 10:02:00 GMT"
    },
    {
      "title": "Geopolitics: Without decisive action, defeatist Europe is heading toward growing dependence on China - Table.Briefings",
      "pubDate": "Sun, 08 Feb 2026 21:23:19 GMT"
    },
    {
      "title": "Japan seizure of Chinese vessel, arrest of captain, could heighten tensions - Al Jazeera",
      "pubDate": "Fri, 13 Feb 2026 04:26:40 GMT"
    },
    {
      "title": "US sends over 50 fighter jets near Iran amid nuclear talks - The Jerusalem Post",
      "pubDate": "Tue, 17 Feb 2026 18:11:52 GMT"
    }
  ],
  "AI Ethics": [
    {
      "title": "Key Discovery Points: Understanding the Ethics of AI for the Rest of Us - JD Supra",
      "pubDate": "Fri, 30 Jan 2026 23:32:20 GMT"
    },
    {
      "title": "Google helped Israeli military contractor with AI, whistleblower alleges - The Washington Post",
      "pubDate": "Sun, 01 Feb 2026 17:31:50 GMT"
    },
    {
      "title": "Inside Project Panama: 2 million books scanned and destroyed by Anthropic AI to train machines - Times of India",
      "pubDate": "Mon, 02 Feb 2026 21:42:00 GMT"
    },
    {
      "title": "When Guardrails Collapse: What the Grok Controversy Reveals About the Future of AI Ethics - Australian Institute of International Affairs",
      "pubDate": "Thu, 05 Feb 2026 02:51:54 GMT"
    },
    {
      "title": "Mexico Unveils National Declaration on Ethical AI to Guide Public Policy and Protect Human Rights - BABL AI",
      "pubDate": "Thu, 05 Feb 2026 13:00:29 GMT"
    },
    {
      "title": "AI safety researchers exit Anthropic, OpenAI; flag ethical concerns - The Economic Times",
      "pubDate": "Thu, 12 Feb 2026 04:32:22 GMT"
    },
    {
      "title": "AI agent creates dating profile for user without consent, sparks ethics debate - storyboard18.com",
      "pubDate": "Fri, 13 Feb 2026 05:55:52 GMT"
    },
    {
      "title": "The economics of AI outweigh ethics for tech CEOs, business leader says - CNN",
      "pubDate": "Mon, 16 Feb 2026 18:21:40 GMT"
    },
    {
      "title": "Pentagon vs. Anthropic: When AI Ethics Meets National Security — The High-Stakes Showdown Shaking Defense Tech - abacusnews.com",
      "pubDate": "Wed, 18 Feb 2026 14:31:20 GMT"
    },
    {
      "title": "Anthropic's AI Challenges Pentagon with Ethics: Claude Opus 4.6 Bolsters Standards from Wall Street to Government - Intelligent Living",
      "pubDate": "Thu, 19 Feb 2026 10:39:54 GMT"
    },
    {
      "title": "Addressing Bias, Privacy, Security, and Patient Autonomy in Artificial Intelligence (AI)-Driven Healthcare: A Review of Current Guidelines - Cureus",
      "pubDate": "Sat, 21 Feb 2026 02:27:53 GMT"
    },
    {
      "title": "After a deadly raid, an AI power struggle erupts at the Pentagon - The Washington Post",
      "pubDate": "Sun, 22 Feb 2026 17:31:53 GMT"
    },
    {
      "title": "Anthropic refuses Pentagon’s new terms, standing firm on lethal autonomous weapons and mass surveillance - The Verge",
      "pubDate": "Thu, 26 Feb 2026 23:22:44 GMT"
    },
    {
      "title": "Trump orders US agencies to stop use of Anthropic technology amid dispute over ethics of AI - The Guardian",
      "pubDate": "Fri, 27 Feb 2026 21:47:00 GMT"
    }
  ],
  "Space Exploration": [
    {
      "title": "NASA delays the first Artemis moonshot with astronauts because of extreme cold at the launch site - ABC News",
      "pubDate": "Sat, 31 Jan 2026 08:46:59 GMT"
    },
    {
      "title": "Artemis II astronaut Christina Koch will see Earth like no human has before - Axios",
      "pubDate": "Tue, 03 Feb 2026 11:02:38 GMT"
    },
    {
      "title": "Artificial Intelligence just drove NASA's robotic rover on Mars for the first time - BBC Sky at Night Magazine",
      "pubDate": "Wed, 04 Feb 2026 09:51:09 GMT"
    },
    {
      "title": "Europe's most powerful rocket launches for 1st time, carrying 32 Amazon internet satellites to orbit (video) - Space",
      "pubDate": "Thu, 12 Feb 2026 17:21:18 GMT"
    },
    {
      "title": "NASA designates botched Boeing Starliner test flight a ‘Type A mishap’ in new report - CNN",
      "pubDate": "Thu, 19 Feb 2026 20:38:16 GMT"
    },
    {
      "title": "NASA will return Artemis moon rocket to hangar for more repairs - Los Angeles Times",
      "pubDate": "Sun, 22 Feb 2026 21:46:03 GMT"
    }
  ],
  "Financial Markets": [
    {
      "title": "Bitcoin-Led Crypto Rout Erases Nearly $500 Billion in a Week - Bloomberg.com",
      "pubDate": "Wed, 04 Feb 2026 15:18:24 GMT"
    },
    {
      "title": "Risks Rise for Bitcoin, Gold, and Silver as Goldman Sachs Warns $80 Billion in Stock Selling - Yahoo Finance",
      "pubDate": "Sun, 08 Feb 2026 21:13:15 GMT"
    }
  ],
  "Investment": [
    {
      "title": "Nvidia CEO Huang denies he is unhappy with OpenAI, says 'huge' investment planned at 'trillion-dollar dinner' - CNBC",
      "pubDate": "Sat, 31 Jan 2026 14:36:51 GMT"
    }
  ],
  "Elon Musk": [
    {
      "title": "Paris prosecutors summon Elon Musk after raid on X's French offices - NBC News",
      "pubDate": "Tue, 03 Feb 2026 20:46:47 GMT"
    },
    {
      "title": "Elon Musk declares victory with Medicaid data release - Axios",
      "pubDate": "Sat, 14 Feb 2026 06:01:21 GMT"
    },
    {
      "title": "Elon Musk's X to launch crypto and stock trading in ‘couple weeks’ - CoinDesk",
      "pubDate": "Sat, 14 Feb 2026 18:37:08 GMT"
    },
    {
      "title": "Elon Musk's Grok faces another EU investigation over nonconsensual AI images - Mashable",
      "pubDate": "Tue, 17 Feb 2026 19:48:25 GMT"
    },
    {
      "title": "News | AI pushes Elon Musk toward new data center frontiers in space - CoStar",
      "pubDate": "Thu, 19 Feb 2026 00:42:33 GMT"
    }
  ],
  "AI Alignment": [
    {
      "title": "Rational but wrong: How AI misinterprets choices and quietly skews decisions - Devdiscourse",
      "pubDate": "Fri, 06 Feb 2026 05:52:33 GMT"
    },
    {
      "title": "Anthropic hires philosopher to teach Claude AI manners and morals - India Today",
      "pubDate": "Wed, 11 Feb 2026 10:25:11 GMT"
    },
    {
      "title": "OpenAI disbands mission alignment team, which focused on 'safe' and 'trustworthy' AI development - TechCrunch",
      "pubDate": "Wed, 11 Feb 2026 21:57:18 GMT"
    },
    {
      "title": "OpenAI Disbands Its Mission Alignment Team After Just 16 Months - WinBuzzer",
      "pubDate": "Thu, 12 Feb 2026 17:45:13 GMT"
    },
    {
      "title": "A Meta AI security researcher said an OpenClaw agent ran amok on her inbox - TechCrunch",
      "pubDate": "Tue, 24 Feb 2026 00:57:14 GMT"
    },
    {
      "title": "Alignment Is Not About Values. It’s About Error Detection - HackerNoon",
      "pubDate": "Wed, 25 Feb 2026 04:50:45 GMT"
    }
  ],
  "NASA": [
    {
      "title": "NASA finds Earth’s magnetic field may be the hidden reason oxygen has lasted for millions of years - Times of India",
      "pubDate": "Tue, 10 Feb 2026 02:30:00 GMT"
    },
    {
      "title": "NASA announces major overhaul to its Artemis moon program - NBC News",
      "pubDate": "Fri, 27 Feb 2026 22:43:47 GMT"
    }
  ],
  "Large Language Models": [
    {
      "title": "LLMs violate boundaries during mental health dialogues, study finds - Tech Xplore",
      "pubDate": "Sun, 15 Feb 2026 15:50:01 GMT"
    },
    {
      "title": "Sarvam rolls out 105-bn parameter AI LLM model - Times of India",
      "pubDate": "Thu, 19 Feb 2026 00:21:00 GMT"
    }
  ],
  "Artificial General Intelligence": [
    {
      "title": "Forget AGI, business leaders are still trying to figure out how to make AI work - Computer Weekly",
      "pubDate": "Thu, 05 Feb 2026 10:24:55 GMT"
    },
    {
      "title": "Claude Opus 4.6 Raises Eyebrows by Suggesting It Might Be Conscious - The Hans India",
      "pubDate": "Fri, 06 Feb 2026 11:18:05 GMT"
    },
    {
      "title": "AI could trigger a global jobs market collapse by 2027 if left unchecked, former Google ethicist warns - Fortune",
      "pubDate": "Tue, 10 Feb 2026 17:31:00 GMT"
    },
    {
      "title": "The existential AI threat is here — and some AI leaders are fleeing - Axios",
      "pubDate": "Thu, 12 Feb 2026 10:28:27 GMT"
    },
    {
      "title": "We are two years away from artificial general intelligence: Vinod Khosla - Forbes India",
      "pubDate": "Tue, 17 Feb 2026 12:57:52 GMT"
    },
    {
      "title": "DeepMind's CEO said there are still 3 areas where AGI systems can't match real intelligence - Business Insider",
      "pubDate": "Wed, 18 Feb 2026 08:28:21 GMT"
    },
    {
      "title": "AGI could arrive within five years: Google DeepMind CEO Demis Hassabis - Exchange4Media",
      "pubDate": "Thu, 19 Feb 2026 07:20:00 GMT"
    },
    {
      "title": "Artificial General Intelligence on the horizon within 5 years: Google DeepMind CEO - The Indian Express",
      "pubDate": "Thu, 19 Feb 2026 16:04:38 GMT"
    }
  ],
  "Central Intelligence Agency": [
    {
      "title": "Senator, who has repeatedly warned about secret US government surveillance, sounds new alarm over ‘CIA activities’ - Yahoo",
      "pubDate": "Fri, 06 Feb 2026 18:02:44 GMT"
    }
  ],
  "Cyberattack": [
    {
      "title": "EU Discloses January Cyberattack That Exposed Some Staff Data - bloomberg.com",
      "pubDate": "Fri, 06 Feb 2026 21:34:08 GMT"
    },
    {
      "title": "Leaked Documents Show China Rehearsing Cyberattacks on Neighbors’ Critical Infrastructure - Homeland Security Today",
      "pubDate": "Wed, 11 Feb 2026 11:41:27 GMT"
    },
    {
      "title": "Google: China's APT31 used Gemini to plan cyberattacks against US orgs - theregister.com",
      "pubDate": "Thu, 12 Feb 2026 07:00:00 GMT"
    },
    {
      "title": "Pro-Iran Hacking Group Claims Cyberattacks Targeting Israeli National Organizations In Support Of Lebanese Hizbullah - MEMRI | Middle East Media Research Institute",
      "pubDate": "Sat, 14 Feb 2026 01:12:31 GMT"
    },
    {
      "title": "SHOT: Russian cyberattack targets Ukraine’s Starlink authorisation service - PHOTO - Caliber.Az",
      "pubDate": "Tue, 17 Feb 2026 05:46:08 GMT"
    },
    {
      "title": "Cyber Attack on Dutch Telecom Giant Odido Exposes Customer Data of 6.2 Million - CPO Magazine",
      "pubDate": "Wed, 18 Feb 2026 11:00:00 GMT"
    }
  ],
  "Social Media": [
    {
      "title": "Elon Musk calls Spanish PM a ‘tyrant’ over plan to ban under-16s from social media and curb hateful content - The Guardian",
      "pubDate": "Wed, 04 Feb 2026 01:13:00 GMT"
    },
    {
      "title": "Landmark trial accusing social media companies of addicting children to their platforms begins - AP News",
      "pubDate": "Tue, 10 Feb 2026 03:01:00 GMT"
    }
  ],
  "Mark Zuckerberg": [
    {
      "title": "Mark Zuckerberg Takes the Stand in Social Media Addiction Trial - The New York Times",
      "pubDate": "Thu, 19 Feb 2026 02:14:22 GMT"
    }
  ],
  "Government Shutdown": [
    {
      "title": "Live updates: Democrats and White House reach deal to avert shutdown and fund Homeland Security for now - AP News",
      "pubDate": "Thu, 29 Jan 2026 23:37:00 GMT"
    },
    {
      "title": "Government Shutdown Update: Here’s When It Could End, According To House Leaders - Forbes",
      "pubDate": "Sun, 01 Feb 2026 15:54:13 GMT"
    },
    {
      "title": "Speaker Johnson is moving to end the shutdown by Tuesday — without Democratic support - Axios",
      "pubDate": "Mon, 02 Feb 2026 04:24:29 GMT"
    },
    {
      "title": "Government shutdown nears possible end as funding fight turns to the House - CBS News",
      "pubDate": "Tue, 03 Feb 2026 04:18:08 GMT"
    },
    {
      "title": "Congress ends shutdown, approves $1.2T in funding — and sets up DHS cliff - Politico",
      "pubDate": "Tue, 03 Feb 2026 19:27:29 GMT"
    },
    {
      "title": "Second Government Shutdown Looms As DHS Funding Fight Takes Center Stage | TRENDING - KGET.com",
      "pubDate": "Mon, 09 Feb 2026 14:57:30 GMT"
    }
  ],
  "Taiwan": [
    {
      "title": "Xi’s Military Purge May Set Back His Taiwan Ambitions - The New York Times",
      "pubDate": "Fri, 30 Jan 2026 08:40:00 GMT"
    },
    {
      "title": "US must be prudent when supplying arms to Taiwan, Xi tells Trump - BBC",
      "pubDate": "Thu, 05 Feb 2026 08:36:16 GMT"
    },
    {
      "title": "Taiwan leader warns countries in region 'next' in case of China attack: AFP interview - France 24",
      "pubDate": "Thu, 12 Feb 2026 01:57:10 GMT"
    },
    {
      "title": "Tokyo involvement in Taiwan would amount to aggression against Beijing: UN envoy - South China Morning Post",
      "pubDate": "Thu, 19 Feb 2026 10:00:09 GMT"
    },
    {
      "title": "Tim Cook Warned by CIA That China Could Move on Taiwan by 2027 - MacRumors",
      "pubDate": "Tue, 24 Feb 2026 12:03:52 GMT"
    }
  ],
  "Automation": [
    {
      "title": "Physical AI becomes central to LG’s robotics and automation ambitions - Digital Watch Observatory",
      "pubDate": "Fri, 30 Jan 2026 08:35:00 GMT"
    }
  ],
  "Department of Justice": [
    {
      "title": "Justice Dept. Opens Civil Rights Investigation Into ICE Killing of Alex Pretti: Minnesota Live Updates - The New York Times",
      "pubDate": "Fri, 30 Jan 2026 17:44:45 GMT"
    },
    {
      "title": "DOJ releases tranche of Epstein files, says it has met its legal obligations - NPR",
      "pubDate": "Fri, 30 Jan 2026 22:32:13 GMT"
    },
    {
      "title": "January 30, 2026 — DOJ releases millions of pages of documents in Epstein investigation - CNN",
      "pubDate": "Sat, 31 Jan 2026 04:15:03 GMT"
    },
    {
      "title": "Epstein victims' lawyers ask court to order DOJ to take down Epstein files website - ABC News",
      "pubDate": "Mon, 02 Feb 2026 02:48:45 GMT"
    },
    {
      "title": "Key participant in 2012 Benghazi attack has been brought to U.S. to face charges, DOJ says - NBC News",
      "pubDate": "Fri, 06 Feb 2026 19:20:51 GMT"
    },
    {
      "title": "Judge orders DOJ to unseal records on Georgia 2020 ballot raid by Tuesday - cbsnews.com",
      "pubDate": "Mon, 09 Feb 2026 00:09:00 GMT"
    },
    {
      "title": "Justice Department Exposed Cooperating Witnesses in Epstein Files - The New York Times - The New York Times",
      "pubDate": "Thu, 26 Feb 2026 19:15:28 GMT"
    }
  ],
  "Trade War": [
    {
      "title": "Bombardier stock dives on Trump threats of 50% tariff on Canadian planes - Al Jazeera",
      "pubDate": "Fri, 30 Jan 2026 17:31:42 GMT"
    }
  ],
  "Space Debris": [
    {
      "title": "Out-of-control Chinese rocket crashes in ocean after UK prepped emergency alert - The Sun",
      "pubDate": "Fri, 30 Jan 2026 12:25:00 GMT"
    }
  ],
  "Epstein Files": [
    {
      "title": "Slovakia PM's national security adviser resigns over Epstein links - BBC",
      "pubDate": "Sun, 01 Feb 2026 08:37:23 GMT"
    },
    {
      "title": "Why are we not talking about Donald Trump in the Epstein files? | Trump100 - Sky News",
      "pubDate": "Tue, 03 Feb 2026 11:14:55 GMT"
    },
    {
      "title": "Melinda French Gates says Bill Gates 'has to answer' for being in the Epstein files - NBC News",
      "pubDate": "Tue, 03 Feb 2026 20:43:40 GMT"
    },
    {
      "title": "Jeffrey Epstein’s Money Mingled With Silicon Valley Start-Ups - The New York Times",
      "pubDate": "Thu, 05 Feb 2026 05:00:11 GMT"
    },
    {
      "title": "Latest Jeffrey Epstein file disclosures rock the rich and powerful: Top takeaways - NBC News",
      "pubDate": "Thu, 05 Feb 2026 17:41:00 GMT"
    },
    {
      "title": "Epstein built ties to Russians and sought to meet Putin, files show - The Washington Post",
      "pubDate": "Fri, 06 Feb 2026 11:32:02 GMT"
    },
    {
      "title": "What the Epstein Files Tell Us – And Don't Tell Us — About His Ties to Russia - The Moscow Times",
      "pubDate": "Fri, 06 Feb 2026 16:49:51 GMT"
    },
    {
      "title": "Members of Congress will be able to view unredacted Epstein files next week - NBC News",
      "pubDate": "Fri, 06 Feb 2026 22:58:06 GMT"
    },
    {
      "title": "How Epstein lured his victims: the women behind the black boxes - The Times",
      "pubDate": "Sat, 07 Feb 2026 22:15:00 GMT"
    },
    {
      "title": "Epstein files: Republican lawmaker Massie calls for Trump Commerce chief Lutnick to resign - CNBC",
      "pubDate": "Sun, 08 Feb 2026 19:27:58 GMT"
    },
    {
      "title": "Epstein files: Congressional lawmakers call for Trump Commerce chief Lutnick to resign, or be fired - CNBC",
      "pubDate": "Sun, 08 Feb 2026 19:27:58 GMT"
    },
    {
      "title": "House Dem identifies ‘wealthy, powerful men’ DOJ redacted in Epstein files - Politico",
      "pubDate": "Tue, 10 Feb 2026 19:56:17 GMT"
    },
    {
      "title": "Trump is in the unredacted Epstein files \"more than a million times,\" Raskin alleges - Axios",
      "pubDate": "Wed, 11 Feb 2026 09:32:40 GMT"
    },
    {
      "title": "Epstein files scrubbed to protect 'elite, powerful men,' Rep. Ro Khanna says - PBS",
      "pubDate": "Wed, 11 Feb 2026 23:28:05 GMT"
    },
    {
      "title": "Published Epstein files included video showing the face of an undercover FBI employee - CNN",
      "pubDate": "Thu, 12 Feb 2026 01:23:00 GMT"
    },
    {
      "title": "Ex-Leader of Norway Charged With Corruption Linked to Epstein - The New York Times",
      "pubDate": "Fri, 13 Feb 2026 02:49:49 GMT"
    },
    {
      "title": "Four men in unredacted files named by Ro Khanna have no ties to Epstein - The Guardian",
      "pubDate": "Fri, 13 Feb 2026 21:39:00 GMT"
    },
    {
      "title": "Hollywood talent agent Casey Wasserman to sell company over Epstein files revelations - CNN",
      "pubDate": "Sat, 14 Feb 2026 16:00:46 GMT"
    },
    {
      "title": "Epstein files fallout takes down elite figures in Europe, while U.S. reckoning is muted - NPR",
      "pubDate": "Sat, 14 Feb 2026 23:04:44 GMT"
    },
    {
      "title": "Mace slams DOJ over letter about completing Epstein files release: ‘They’re missing names’ - The Hill",
      "pubDate": "Sun, 15 Feb 2026 23:10:00 GMT"
    },
    {
      "title": "Khanna says 'stop protecting predators' as DOJ gives reasoning for redacting Epstein files - PBS",
      "pubDate": "Mon, 16 Feb 2026 23:40:51 GMT"
    },
    {
      "title": "The Epstein files have brought a wave of resignations and investigations - The Washington Post",
      "pubDate": "Tue, 17 Feb 2026 17:31:46 GMT"
    },
    {
      "title": "Allegations in Epstein files may amount to 'crimes against humanity,' UN experts say - Reuters",
      "pubDate": "Tue, 17 Feb 2026 22:39:36 GMT"
    },
    {
      "title": "Epstein files suggest acts that may amount to crimes against humanity, say UN experts - The Guardian",
      "pubDate": "Wed, 18 Feb 2026 13:11:00 GMT"
    },
    {
      "title": "Emails show 'Godfather of AGI' Ben Goertzel courted Epstein for funding and congratulated him on jail release - Business Insider",
      "pubDate": "Thu, 19 Feb 2026 14:52:00 GMT"
    },
    {
      "title": "Epstein files could be just tip of the iceberg for Andrew investigation - BBC",
      "pubDate": "Thu, 19 Feb 2026 20:17:08 GMT"
    },
    {
      "title": "Did Epstein Use Memory-Erasing Technology? 2014 Email With Senior MIT Figure Raises Fresh Questions - Times Now",
      "pubDate": "Fri, 20 Feb 2026 05:32:55 GMT"
    },
    {
      "title": "A Once Prominent American Statesman Faces Fallout From the Epstein Files - The New York Times - The New York Times",
      "pubDate": "Fri, 20 Feb 2026 10:02:53 GMT"
    },
    {
      "title": "Epstein files place renewed attention on US authorities’ failure to stop him - The Guardian",
      "pubDate": "Sat, 21 Feb 2026 11:10:00 GMT"
    },
    {
      "title": "Ghislaine Maxwell fights release of more Epstein documents, calling disclosure law unconstitutional - AP News",
      "pubDate": "Sat, 21 Feb 2026 19:39:00 GMT"
    },
    {
      "title": "After Epstein revelations, Europe vows accountability while U.S. holds back - The Washington Post",
      "pubDate": "Sun, 22 Feb 2026 18:00:02 GMT"
    },
    {
      "title": "Former British ambassador to the U.S. arrested after Epstein files release - NBC News",
      "pubDate": "Mon, 23 Feb 2026 22:49:27 GMT"
    },
    {
      "title": "Ex-UK ambassador Mandelson released on bail after arrest in Epstein probe - Al Jazeera",
      "pubDate": "Tue, 24 Feb 2026 10:14:21 GMT"
    },
    {
      "title": "Bill Gates apologizes to Gates Foundation staff over Epstein ties, admits to having affairs - CBS News",
      "pubDate": "Wed, 25 Feb 2026 16:23:13 GMT"
    },
    {
      "title": "Bill Clinton asked about hot tub photo and testifies he knew 'nothing' of Epstein crimes - BBC",
      "pubDate": "Sat, 28 Feb 2026 03:43:56 GMT"
    }
  ],
  "Energy Storage": [
    {
      "title": "Tesla energy storage deployments jumped in ‘crucial AI transformation year'; company expects margin compression in 2026 - Energy-Storage.News",
      "pubDate": "Mon, 02 Feb 2026 09:27:08 GMT"
    },
    {
      "title": "Energy company develops massive 'bubble battery' that could revolutionize power grid: 'This is incredible' - The Cool Down",
      "pubDate": "Tue, 03 Feb 2026 05:40:00 GMT"
    },
    {
      "title": "Leaving water in batteries nearly doubles energy storage - New Atlas",
      "pubDate": "Thu, 26 Feb 2026 06:21:35 GMT"
    }
  ],
  "Elections": [
    {
      "title": "Trump, in an Escalation, Calls for Republicans to ‘Nationalize’ Elections - The New York Times",
      "pubDate": "Mon, 02 Feb 2026 22:21:49 GMT"
    }
  ],
  "India": [
    {
      "title": "Trump Announces Initial Trade Deal With India, Cutting Tariffs to 18% - The New York Times",
      "pubDate": "Tue, 03 Feb 2026 00:37:12 GMT"
    },
    {
      "title": "India tells university to leave AI summit after presenting Chinese robot as its own, sources say - Reuters",
      "pubDate": "Wed, 18 Feb 2026 07:53:41 GMT"
    }
  ],
  "Artemis Program": [
    {
      "title": "NASA rocket that will return astronauts to the moon hit by fuel leak during practice countdown - PBS",
      "pubDate": "Mon, 02 Feb 2026 21:44:21 GMT"
    },
    {
      "title": "NASA delays astronaut moon mission again after new rocket problem - AP News",
      "pubDate": "Sat, 21 Feb 2026 20:51:00 GMT"
    },
    {
      "title": "NASA's Artemis moon mission is in trouble again. Here's what we know - USA Today",
      "pubDate": "Mon, 23 Feb 2026 18:22:00 GMT"
    }
  ],
  "Middle East": [
    {
      "title": "Seif al-Islam el-Qaddafi, Son of Libyan Dictator, Is Killed in Attack, Lawyer Says - The New York Times",
      "pubDate": "Tue, 03 Feb 2026 23:24:40 GMT"
    },
    {
      "title": "LIVE: Israeli attacks across Gaza kill 21 Palestinians since dawn - Al Jazeera",
      "pubDate": "Wed, 04 Feb 2026 10:57:12 GMT"
    },
    {
      "title": "Live Updates: U.S. and Israel Conduct Strikes on Iran - The New York Times",
      "pubDate": "Sat, 28 Feb 2026 11:47:51 GMT"
    }
  ],
  "US Foreign Policy": [
    {
      "title": "U.S.-Iran nuclear talks back on after Arab leaders lobby White House - Axios",
      "pubDate": "Wed, 04 Feb 2026 20:50:08 GMT"
    },
    {
      "title": "Massive Buildup Against Iran Continues: F-22s to Israel, More F-35s and F-15Es to Europe - Air & Space Forces Magazine",
      "pubDate": "Fri, 27 Feb 2026 05:19:56 GMT"
    }
  ],
  "Anthropic": [
    {
      "title": "Anthropic's newest AI model uncovered 500 zero-day software flaws in testing - Axios",
      "pubDate": "Thu, 05 Feb 2026 17:45:12 GMT"
    },
    {
      "title": "Anthropic Puts $20 Million Into a Super PAC Operation to Counter OpenAI - The New York Times",
      "pubDate": "Thu, 12 Feb 2026 12:00:06 GMT"
    },
    {
      "title": "Exclusive: Pentagon warns Anthropic will \"pay a price\" as feud escalates - Axios",
      "pubDate": "Mon, 16 Feb 2026 18:40:18 GMT"
    },
    {
      "title": "Anthropic CEO: AI to surpass humans in 'small number of years' - Yahoo Finance UK",
      "pubDate": "Thu, 19 Feb 2026 05:37:00 GMT"
    }
  ],
  "Semiconductors": [
    {
      "title": "TSMC to make advanced AI semiconductors in Japan in boost for its chipmaking ambitions - The Tribune-Democrat",
      "pubDate": "Thu, 05 Feb 2026 10:41:00 GMT"
    },
    {
      "title": "India’s semiconductor market to hit $103 billlion by 2030, fuelled by AI, EVs, and defence - The Economic Times",
      "pubDate": "Sat, 28 Feb 2026 06:11:16 GMT"
    }
  ],
  "Economic": [
    {
      "title": "January Layoffs Surge Across US, Jobs Report Says - Forbes",
      "pubDate": "Thu, 05 Feb 2026 15:38:54 GMT"
    }
  ],
  "Military Intelligence": [
    {
      "title": "Ukraine War, Day 1,443: Russia's Deputy Director of Military Intelligence Critically Wounded in Moscow Shooting - EA WorldView",
      "pubDate": "Fri, 06 Feb 2026 16:25:53 GMT"
    },
    {
      "title": "Russia detains suspect in shooting of top military intelligence officer in Moscow - TRT World",
      "pubDate": "Sun, 08 Feb 2026 11:37:43 GMT"
    }
  ],
  "Europe": [
    {
      "title": "Europe Accuses TikTok of ‘Addictive Design’ and Pushes for Change - The New York Times",
      "pubDate": "Fri, 06 Feb 2026 12:06:58 GMT"
    }
  ],
  "Drone Warfare": [
    {
      "title": "Deadly attacks hit Kordofan as scrutiny grows over drone warfare in Sudan - Radio Dabanga",
      "pubDate": "Fri, 06 Feb 2026 19:37:18 GMT"
    },
    {
      "title": "Ukrainian drone strike sparks fire at Russian Black Sea port ahead of talks with U.S. - CBS News",
      "pubDate": "Sun, 15 Feb 2026 13:16:42 GMT"
    }
  ],
  "Universe": [
    {
      "title": "'Invisible scaffolding of the universe' revealed in ambitious new James Webb telescope images - Live Science",
      "pubDate": "Fri, 06 Feb 2026 22:04:42 GMT"
    }
  ],
  "Economics": [
    {
      "title": "Dow surges 1,200 points for first close above 50,000 in sharp rebound from tech rout: Live updates - CNBC",
      "pubDate": "Fri, 06 Feb 2026 19:49:36 GMT"
    },
    {
      "title": "Economic growth is still heating the planet. Is there any way out? - The Guardian",
      "pubDate": "Tue, 10 Feb 2026 12:26:00 GMT"
    }
  ],
  "Autonomous Vehicles": [
    {
      "title": "Waymo Reveals Its Driverless Cars Are \"Guided\" By Remote Workers In Philippines: \"Phone-A-Friend\" - NDTV",
      "pubDate": "Sun, 08 Feb 2026 13:47:19 GMT"
    }
  ],
  "Japan": [
    {
      "title": "Japan's governing party on course for landslide election win - BBC",
      "pubDate": "Sun, 08 Feb 2026 16:52:15 GMT"
    },
    {
      "title": "Drive to Unlock $840 Billion in Cash Lifts Japan Stocks Outlook - Bloomberg",
      "pubDate": "Tue, 24 Feb 2026 22:00:00 GMT"
    }
  ],
  "Finance": [
    {
      "title": "Russian officials are warning Putin that a financial crisis could arrive this summer, report says - Fortune",
      "pubDate": "Sun, 08 Feb 2026 21:14:00 GMT"
    },
    {
      "title": "Jamie Dimon warns markets resemble pre-financial crisis era: 'I see a couple of people doing some dumb things' - Yahoo Finance",
      "pubDate": "Tue, 24 Feb 2026 13:37:19 GMT"
    }
  ],
  "Real Estate": [
    {
      "title": "S&P is already predicting China's property slump will be worse than it expected this year - CNBC",
      "pubDate": "Mon, 09 Feb 2026 11:45:03 GMT"
    }
  ],
  "Black Holes": [
    {
      "title": "It’s Historic: Two Black Holes Have Just Been Photographed Together for the First Time - Futura, Le média qui explore le monde",
      "pubDate": "Mon, 09 Feb 2026 11:46:11 GMT"
    },
    {
      "title": "Caught on camera: Black hole seen tearing a star apart for the first time - The Times of India",
      "pubDate": "Fri, 27 Feb 2026 01:30:00 GMT"
    }
  ],
  "Big Tech": [
    {
      "title": "US plans Big Tech carve-out from next chip tariffs, FT reports - Reuters",
      "pubDate": "Tue, 10 Feb 2026 00:04:40 GMT"
    },
    {
      "title": "Big Tech Is Now Big on Debt and That Changes Everything - Bloomberg.com",
      "pubDate": "Wed, 11 Feb 2026 17:37:12 GMT"
    },
    {
      "title": "Nvidia shares go cold even as Big Tech spending on AI balloons - Yahoo Finance",
      "pubDate": "Fri, 13 Feb 2026 19:44:45 GMT"
    },
    {
      "title": "How a Social Media Addiction Trial Threatens Big Tech - Bloomberg",
      "pubDate": "Wed, 18 Feb 2026 10:30:00 GMT"
    },
    {
      "title": "Meta CEO to testify in high-stakes trial that could cost Big Tech billions - Fox Business",
      "pubDate": "Wed, 18 Feb 2026 10:00:00 GMT"
    }
  ],
  "Benjamin Netanyahu": [
    {
      "title": "Netanyahu rushes to Washington for talks with Trump over Iran - The Times",
      "pubDate": "Tue, 10 Feb 2026 08:30:00 GMT"
    }
  ],
  "Canada": [
    {
      "title": "Tumbler Ridge Live Updates: 9 Killed in Shooting at School and Home in British Columbia - The New York Times",
      "pubDate": "Wed, 11 Feb 2026 11:22:15 GMT"
    },
    {
      "title": "Canada seeks answers from OpenAI for failing to alert police after suspending school shooter’s account - The Guardian",
      "pubDate": "Mon, 23 Feb 2026 22:56:00 GMT"
    }
  ],
  "DeepMind": [
    {
      "title": "How Demis Hassabis is leading Google through an innovator’s dilemma—and made OpenAI declare 'code red' - Fortune",
      "pubDate": "Wed, 11 Feb 2026 10:00:00 GMT"
    },
    {
      "title": "Former Google DeepMind Scientist Targets $4 Billion Valuation for New AI Lab - PYMNTS.com",
      "pubDate": "Wed, 18 Feb 2026 19:52:20 GMT"
    }
  ],
  "National Security Agency": [
    {
      "title": "Exclusive / NSA pick warns of China pursuing AI chips for weapons - Semafor",
      "pubDate": "Wed, 11 Feb 2026 09:59:00 GMT"
    }
  ],
  "Science": [
    {
      "title": "Nanoplastics hindering cognitive abilities of fish, international research shows - Phys.org",
      "pubDate": "Wed, 11 Feb 2026 11:44:45 GMT"
    }
  ],
  "DOJ": [
    {
      "title": "IRS improperly disclosed confidential immigrant tax data to DHS - The Washington Post",
      "pubDate": "Thu, 12 Feb 2026 04:46:29 GMT"
    }
  ],
  "Google Cloud": [
    {
      "title": "Investigators wrangled video from Nancy Guthrie’s Google Nest camera out of ‘backend systems’ - NBC News",
      "pubDate": "Wed, 11 Feb 2026 20:07:00 GMT"
    }
  ],
  "Technology": [
    {
      "title": "Border Officials Are Said to Have Caused El Paso Closure by Firing Anti-Drone Laser - The New York Times",
      "pubDate": "Wed, 11 Feb 2026 18:29:39 GMT"
    },
    {
      "title": "Apple Ramps Up Work on Glasses, Pendant, and Camera AirPods for AI Era - Bloomberg.com",
      "pubDate": "Tue, 17 Feb 2026 18:02:57 GMT"
    }
  ],
  "Immigration": [
    {
      "title": "Trump administration working to expand effort to strip citizenship from foreign-born Americans - NBC News",
      "pubDate": "Thu, 12 Feb 2026 10:00:00 GMT"
    },
    {
      "title": "Columbia University says US immigration agents lied to detain student - Al Jazeera",
      "pubDate": "Thu, 26 Feb 2026 22:12:44 GMT"
    },
    {
      "title": "911 calls capture kids burning with fever, struggling to breathe at ICE detention center - NBC News",
      "pubDate": "Fri, 27 Feb 2026 10:00:00 GMT"
    }
  ],
  "Unemployment": [
    {
      "title": "Khan Academy CEO warns even a 10% workforce reduction due to AI 'will feel like a depression' - Fortune",
      "pubDate": "Thu, 12 Feb 2026 10:36:00 GMT"
    }
  ],
  "Apple": [
    {
      "title": "Apple has worst day since April as company faces FTC scrutiny, Siri delay reports - CNBC",
      "pubDate": "Thu, 12 Feb 2026 21:48:02 GMT"
    },
    {
      "title": "Apple sued by West Virginia for alleged failure to stop child sexual abuse material on iCloud, iOS devices - CNBC",
      "pubDate": "Thu, 19 Feb 2026 15:00:01 GMT"
    }
  ],
  "Physics": [
    {
      "title": "Record-breaking gravitational wave puts Einstein's relativity to its toughest test yet — and proves him right again - Live Science",
      "pubDate": "Fri, 13 Feb 2026 11:00:00 GMT"
    }
  ],
  "Civil Rights": [
    {
      "title": "California launches civil rights probe into botched evacuations in historically Black Altadena - Los Angeles Times",
      "pubDate": "Fri, 13 Feb 2026 00:34:10 GMT"
    },
    {
      "title": "Jesse Jackson, a leading voice for civil rights, dies at 84 - The Washington Post",
      "pubDate": "Tue, 17 Feb 2026 17:45:37 GMT"
    }
  ],
  "Fusion Power": [
    {
      "title": "China has just broken a barrier that physicists believed to be unbreakable for decades, and its 150 million-degree artificial sun could bring us closer than ever to the energy of the stars - ECOticias.com",
      "pubDate": "Sat, 14 Feb 2026 20:00:00 GMT"
    }
  ],
  "Interest Rates": [
    {
      "title": "US debt spiral could start soon as interest rate on borrowing tops GDP growth - Fortune",
      "pubDate": "Sat, 14 Feb 2026 18:53:00 GMT"
    }
  ],
  "European Union": [
    {
      "title": "EU foreign policy chief criticises ‘fashionable euro-bashing’ by US - The Guardian",
      "pubDate": "Sun, 15 Feb 2026 20:42:00 GMT"
    }
  ],
  "Google": [
    {
      "title": "Google puts users at risk by downplaying health disclaimers under AI Overviews - The Guardian",
      "pubDate": "Mon, 16 Feb 2026 21:24:00 GMT"
    }
  ],
  "Asteroids": [
    {
      "title": "City Killing Asteroids: NASA Scientist Warns of Unstoppable Threats to Earth - Meyka",
      "pubDate": "Wed, 18 Feb 2026 08:03:45 GMT"
    }
  ],
  "Demis Hassabis": [
    {
      "title": "Watch DeepMind CEO Warns of AI Risks, Urges Global Cooperation - Bloomberg.com",
      "pubDate": "Thu, 19 Feb 2026 00:00:00 GMT"
    }
  ],
  "Perplexity": [
    {
      "title": "OpenAI, Google, and Perplexity near approval to host AI directly for the U.S. government (exclusive) - Fast Company",
      "pubDate": "Thu, 19 Feb 2026 05:31:06 GMT"
    }
  ],
  "Tariffs": [
    {
      "title": "Trump Imposes 10% Global Tariff After Supreme Court Rules Against Him: Live Updates - The New York Times",
      "pubDate": "Sat, 21 Feb 2026 01:39:00 GMT"
    },
    {
      "title": "Trump tariffs live updates: Trump raises 'global' tariff to 15%; EU postpones vote on US deal - Yahoo Finance",
      "pubDate": "Mon, 23 Feb 2026 16:49:54 GMT"
    },
    {
      "title": "$3.8B in Michigan tariffs in limbo after Supreme Court ruling - Axios",
      "pubDate": "Tue, 24 Feb 2026 11:37:25 GMT"
    }
  ],
  "Hungary": [
    {
      "title": "Hungary Poses Unexpected Hurdle to Europe’s 90-Billion Euro Loan to Ukraine - The New York Times",
      "pubDate": "Fri, 20 Feb 2026 20:56:32 GMT"
    }
  ],
  "FBI": [
    {
      "title": "FBI arrests engineers for leaking tech secrets to Iran - The Jerusalem Post",
      "pubDate": "Fri, 20 Feb 2026 21:58:14 GMT"
    }
  ],
  "Military and Defense": [
    {
      "title": "The US Army hasn't faced serious threats from above in years. The war in Ukraine is forcing a rethink. - Business Insider",
      "pubDate": "Tue, 24 Feb 2026 10:52:00 GMT"
    },
    {
      "title": "Japan to deploy missiles on island near Taiwan by 2031 - BBC",
      "pubDate": "Wed, 25 Feb 2026 06:00:50 GMT"
    }
  ],
  "Meta": [
    {
      "title": "Meta and AMD Agree to AI Chips Deal Worth More Than $100 Billion - WSJ",
      "pubDate": "Tue, 24 Feb 2026 14:34:00 GMT"
    }
  ],
  "Cancer": [
    {
      "title": "Scientists engineer bacteria to eat cancer tumors from the inside out - ScienceDaily",
      "pubDate": "Tue, 24 Feb 2026 08:43:38 GMT"
    }
  ],
  "Goldman Sachs": [
    {
      "title": "Goldman Sachs warns AI-fueled layoffs could raise the unemployment rate this year: Chart - Yahoo Finance",
      "pubDate": "Tue, 24 Feb 2026 15:42:51 GMT"
    }
  ],
  "Oceans": [
    {
      "title": "Ocean warming drives a nearly 20% annual decline in fish biomass, research confirms - Phys.org",
      "pubDate": "Wed, 25 Feb 2026 10:00:04 GMT"
    }
  ],
  "Astronomy": [
    {
      "title": "World's largest radio telescope array pierces heart of our Milky Way: 'This is just the beginning' - Space",
      "pubDate": "Wed, 25 Feb 2026 13:00:00 GMT"
    },
    {
      "title": "James Webb reveals a barred spiral galaxy shockingly early in the Universe - ScienceDaily",
      "pubDate": "Fri, 27 Feb 2026 17:16:36 GMT"
    }
  ],
  "World Economy": [
    {
      "title": "World Trade Surged in 2025 Despite Higher Tariffs - WSJ",
      "pubDate": "Wed, 25 Feb 2026 11:47:00 GMT"
    }
  ],
  "Human Brain": [
    {
      "title": "Superagers' brains have a 'resilience signature,' and it's all about neuron growth - Medical Xpress",
      "pubDate": "Wed, 25 Feb 2026 16:00:01 GMT"
    }
  ],
  "Medicine": [
    {
      "title": "Scientists turn methane into medicine in stunning breakthrough - ScienceDaily",
      "pubDate": "Fri, 27 Feb 2026 15:53:35 GMT"
    }
  ],
  "Renewable Energy": [
    {
      "title": "Google is building the world’s largest battery system with a massive 100 hours of power in Minnesota - Fortune",
      "pubDate": "Sat, 28 Feb 2026 07:58:00 GMT"
    }
  ],
  "Biology": [
    {
      "title": "Scientists discover microbe that breaks a fundamental rule of the genetic code - ScienceDaily",
      "pubDate": "Sat, 28 Feb 2026 06:49:30 GMT"
    }
  ]
}