{
  "Artificial Intelligence": [
    {
      "title": "Lafourche middle school student arrested, accused of sharing AI nude image of classmate - WDSU",
      "pubDate": "Tue, 11 Nov 2025 01:20:00 GMT"
    },
    {
      "title": "SoftBank Sells $5.8 Billion Stake in Nvidia to Pay for OpenAI Deals - The New York Times",
      "pubDate": "Tue, 11 Nov 2025 16:40:31 GMT"
    },
    {
      "title": "Anthropic announces $50B investment in new US data centers to meet AI demand - The Hill",
      "pubDate": "Wed, 12 Nov 2025 16:21:00 GMT"
    },
    {
      "title": "Anthropic Says Chinese Hackers Used Its A.I. in Online Attack - The New York Times",
      "pubDate": "Fri, 14 Nov 2025 09:50:30 GMT"
    },
    {
      "title": "Jeff Bezos Creates A.I. Start-Up Where He Will Be Co-Chief Executive - The New York Times",
      "pubDate": "Mon, 17 Nov 2025 09:15:40 GMT"
    },
    {
      "title": "Google boss Sundar Pichai warns 'no company immune' if AI bubble bursts - BBC",
      "pubDate": "Tue, 18 Nov 2025 05:02:04 GMT"
    },
    {
      "title": "Google Unveils Gemini's Next Generation, Aiming to Turn Its Search Engine Into a 'Thought Partner' - U.S. News & World Report",
      "pubDate": "Tue, 18 Nov 2025 16:31:00 GMT"
    },
    {
      "title": "Harnessing artificial intelligence to advance CRISPR-based genome editing technologies - Nature",
      "pubDate": "Tue, 18 Nov 2025 13:47:48 GMT"
    },
    {
      "title": "AI borrowing binge prompts investors to back away from corporate bonds - Reuters",
      "pubDate": "Thu, 20 Nov 2025 05:00:00 GMT"
    },
    {
      "title": "Is AI making some people delusional? Families and experts are worried - Los Angeles Times",
      "pubDate": "Fri, 21 Nov 2025 11:00:00 GMT"
    },
    {
      "title": "Trump Team Internally Floats Idea of Selling Nvidia H200 Chips to China - Bloomberg.com",
      "pubDate": "Fri, 21 Nov 2025 20:47:12 GMT"
    },
    {
      "title": "The A.I. Boom Is Driving the Economy. What Happens if It Falters? - The New York Times",
      "pubDate": "Sat, 22 Nov 2025 10:01:41 GMT"
    },
    {
      "title": "Amazon to invest up to $50 billion to expand AI and supercomputing infrastructure for US government agencies - About Amazon",
      "pubDate": "Mon, 24 Nov 2025 16:03:48 GMT"
    },
    {
      "title": "Foxconn adding nearly 1,400 jobs to build artificial intelligence servers at Racine County plant - WISN",
      "pubDate": "Tue, 25 Nov 2025 22:12:13 GMT"
    },
    {
      "title": "The U.S. has been cutting cyber defenses as AI boosts attacks - The Washington Post",
      "pubDate": "Fri, 28 Nov 2025 18:00:31 GMT"
    },
    {
      "title": "China's DeepSeek Releases New Open Source AI Model Amid Google's Gemini 3 Roll Out - Investor's Business Daily",
      "pubDate": "Fri, 28 Nov 2025 21:35:00 GMT"
    },
    {
      "title": "Bigger than COVID? The graph that explains why AI is going to be so huge - Sky News",
      "pubDate": "Sat, 29 Nov 2025 03:22:32 GMT"
    },
    {
      "title": "Judges caution against Artificial Intelligence in courts, flag ‘hallucinated’ citations - Times of India",
      "pubDate": "Sat, 29 Nov 2025 23:06:00 GMT"
    },
    {
      "title": "At home and at school, artificial intelligence is transforming childhood - The Economist",
      "pubDate": "Thu, 04 Dec 2025 11:31:16 GMT"
    }
  ],
  "US Politics": [
    {
      "title": "Trump Administration Live Updates: Senate Moves to Vote as Democratic Defectors Relent on Shutdown - The New York Times",
      "pubDate": "Mon, 10 Nov 2025 04:11:00 GMT"
    },
    {
      "title": "Senate Passes Bill to Reopen Government Amid Democratic Rift - The New York Times",
      "pubDate": "Tue, 11 Nov 2025 15:22:00 GMT"
    },
    {
      "title": "Trump pulling out all the stops to welcome Saudi crown prince for first White House visit since Khashoggi killing - CNN",
      "pubDate": "Sun, 16 Nov 2025 10:00:01 GMT"
    },
    {
      "title": "Trump Accuses Democratic Lawmakers of ”SEDITIOUS BEHAVIOR, punishable by DEATH!” - Democracy Now!",
      "pubDate": "Fri, 21 Nov 2025 15:01:33 GMT"
    },
    {
      "title": "US: Immigration requests for Afghans ‘stopped indefinitely’ - CNN",
      "pubDate": "Thu, 27 Nov 2025 06:10:09 GMT"
    }
  ],
  "Israel": [
    {
      "title": "Updates: Israel’s Gaza attacks continue; Hamas hands over Goldin’s remains - Al Jazeera",
      "pubDate": "Sun, 09 Nov 2025 16:01:41 GMT"
    },
    {
      "title": "Jared Kushner arrives in Israel for Gaza talks with Netanyahu, source says - Reuters",
      "pubDate": "Sun, 09 Nov 2025 17:58:17 GMT"
    },
    {
      "title": "Scoop: Israel wants Trump to condition F-35 sale to Saudi Arabia on Israel normalization - Axios",
      "pubDate": "Sat, 15 Nov 2025 18:00:19 GMT"
    },
    {
      "title": "Israel Vows No Palestinian State as UN Set to Vote on Gaza Plan - Bloomberg.com",
      "pubDate": "Sun, 16 Nov 2025 14:34:01 GMT"
    },
    {
      "title": "Palestinians dying at \"alarming rate\" in Israeli prisons since Oct 7, 2023, rights group says - CBS News",
      "pubDate": "Mon, 17 Nov 2025 16:22:00 GMT"
    },
    {
      "title": "Tense calm in far north as Israel prepares to ‘finish the job’ against Hezbollah - The Guardian",
      "pubDate": "Sat, 22 Nov 2025 09:00:00 GMT"
    },
    {
      "title": "Israeli Strikes Have Killed at Least 127 Civilians in Lebanon Since Ceasefire, UN Says - U.S. News & World Report",
      "pubDate": "Tue, 25 Nov 2025 10:23:00 GMT"
    },
    {
      "title": "Aid access and hospital operations remain constrained in Gaza - UN News",
      "pubDate": "Thu, 27 Nov 2025 01:50:51 GMT"
    },
    {
      "title": "Israeli Forces Kill Two Palestinians in West Bank After They Appear to Surrender, Video Shows - The New York Times",
      "pubDate": "Fri, 28 Nov 2025 18:15:30 GMT"
    },
    {
      "title": "Hezbollah leader promises response to Israel’s strike killing top commander - Al Jazeera",
      "pubDate": "Fri, 28 Nov 2025 19:30:58 GMT"
    },
    {
      "title": "How Israel’s Settlement Surge in the West Bank Is Displacing Palestinians - The New York Times",
      "pubDate": "Thu, 04 Dec 2025 10:21:36 GMT"
    }
  ],
  "Ukraine": [
    {
      "title": "Ukraine war latest: Trump laughs as Orban tells him win for Kyiv would be ‘miracle’ - The Independent",
      "pubDate": "Sat, 08 Nov 2025 05:15:55 GMT"
    },
    {
      "title": "Three years after liberation, Ukraine's Kherson faces another kind of siege - The Independent",
      "pubDate": "Mon, 10 Nov 2025 05:24:00 GMT"
    },
    {
      "title": "'No turning back': More and more Ukrainian women join the army to fight Russia - NPR",
      "pubDate": "Tue, 11 Nov 2025 10:00:00 GMT"
    },
    {
      "title": "Zelensky vows energy sector overhaul after $100m corruption scandal - BBC",
      "pubDate": "Sat, 15 Nov 2025 20:26:30 GMT"
    },
    {
      "title": "Video shows gas tanker ship on fire after attack on Ukrainian Danube port - BBC",
      "pubDate": "Mon, 17 Nov 2025 17:11:45 GMT"
    },
    {
      "title": "‘Dire situation’: Russia gains ground in Ukraine’s Zaporizhia region - Al Jazeera",
      "pubDate": "Tue, 18 Nov 2025 11:28:03 GMT"
    },
    {
      "title": "Ukraine hits targets in Russia with U.S.-supplied ATACMS missiles, military says - NBC News",
      "pubDate": "Tue, 18 Nov 2025 22:33:48 GMT"
    },
    {
      "title": "Zelensky to speak to Trump after US proposes Russia-Ukraine peace plan - BBC",
      "pubDate": "Thu, 20 Nov 2025 19:47:32 GMT"
    },
    {
      "title": "Ukraine faces losing dignity or US support with Trump’s plan to end war, Zelensky says - CNN",
      "pubDate": "Fri, 21 Nov 2025 15:19:41 GMT"
    },
    {
      "title": "As Trump Pushes to End Ukraine War, Europe Toils to Have a Say - The New York Times",
      "pubDate": "Tue, 25 Nov 2025 10:31:36 GMT"
    },
    {
      "title": "Allies worry US demands Ukraine deal before security guarantees - Politico",
      "pubDate": "Thu, 27 Nov 2025 02:10:00 GMT"
    },
    {
      "title": "Russian drones, missiles kill one, injure 11 in Kyiv, cause damage - Reuters",
      "pubDate": "Sat, 29 Nov 2025 04:17:00 GMT"
    },
    {
      "title": "Ukraine peace talks shift to Moscow — the big unknown is whether Putin will play ball - CNBC",
      "pubDate": "Mon, 01 Dec 2025 09:58:57 GMT"
    },
    {
      "title": "Weak Spots Are Few for Russia in Ukraine Peace Talks - The New York Times",
      "pubDate": "Wed, 03 Dec 2025 13:01:30 GMT"
    },
    {
      "title": "Macron warned US could ‘betray’ Ukraine in leaked leaders’ call, Spiegel reports - politico.eu",
      "pubDate": "Thu, 04 Dec 2025 11:32:00 GMT"
    },
    {
      "title": "Putin says there are points he can't agree to in the U.S. proposal to end Ukraine war - NPR",
      "pubDate": "Thu, 04 Dec 2025 16:57:23 GMT"
    }
  ],
  "Russia": [
    {
      "title": "Russia says Ukrainian troops in Pokrovsk and Kupiansk should surrender to save themselves - Reuters",
      "pubDate": "Wed, 05 Nov 2025 08:34:06 GMT"
    },
    {
      "title": "German general says Russia could launch limited attack on NATO any time - Reuters",
      "pubDate": "Fri, 07 Nov 2025 07:34:00 GMT"
    },
    {
      "title": "Ukraine war latest: Russian oil depot goes up in flames after direct strike by Kyiv - The Independent",
      "pubDate": "Tue, 11 Nov 2025 10:58:01 GMT"
    },
    {
      "title": "Ukraine war briefing: Top banker’s straight talk to Putin over troubled economy - The Guardian",
      "pubDate": "Wed, 12 Nov 2025 01:43:00 GMT"
    },
    {
      "title": "Zelenskyy condemns Russia’s ‘wicked’ overnight attack on Ukraine – Europe live - The Guardian",
      "pubDate": "Fri, 14 Nov 2025 08:44:00 GMT"
    },
    {
      "title": "Russia Tried to Cut Ukraine’s Lights. Now It’s Aiming for the Heat. - The New York Times",
      "pubDate": "Sat, 15 Nov 2025 10:00:37 GMT"
    },
    {
      "title": "Ukraine says it attacked Russian oil refinery near Moscow as winter looms - Al Jazeera",
      "pubDate": "Sat, 15 Nov 2025 16:52:30 GMT"
    },
    {
      "title": "BRICS Shift Deepens: Russia Sets Date for First Chinese Yuan Bonds - CryptoDnes.bg",
      "pubDate": "Sun, 16 Nov 2025 16:33:09 GMT"
    },
    {
      "title": "Ukraine-Russia war latest: Kyiv to buy 100 French fighter jets in historic deal after Zelensky-Macron talks - The Independent",
      "pubDate": "Mon, 17 Nov 2025 11:00:00 GMT"
    },
    {
      "title": "Senate to move on Trump-backed Russia sanctions, Graham says - Politico",
      "pubDate": "Mon, 17 Nov 2025 18:23:40 GMT"
    },
    {
      "title": "Polish Authorities Say Russia Is Likely Behind Railway Explosion - Bloomberg.com",
      "pubDate": "Tue, 18 Nov 2025 11:23:34 GMT"
    },
    {
      "title": "Ukraine war live: Nato member evacuates villages after Putin attack - The Independent",
      "pubDate": "Tue, 18 Nov 2025 23:00:00 GMT"
    },
    {
      "title": "Russian Spy Ship Breaches Allied Waters, Fires Lasers at Military Planes - Newsweek",
      "pubDate": "Wed, 19 Nov 2025 10:29:00 GMT"
    },
    {
      "title": "US military officials in Kyiv as Europe warns against reported Russia peace plan - BBC",
      "pubDate": "Thu, 20 Nov 2025 11:55:36 GMT"
    },
    {
      "title": "Sanctions have choked Russia's oil industry, a key source of Kremlin funds, U.S. Treasury finds - CBS News",
      "pubDate": "Thu, 20 Nov 2025 22:53:32 GMT"
    },
    {
      "title": "As Russia is accused of hybrid warfare against the West, vital undersea cables show their vulnerability - CBS News",
      "pubDate": "Thu, 20 Nov 2025 18:35:00 GMT"
    },
    {
      "title": "Trump's full 28-point Ukraine-Russia peace plan - Axios",
      "pubDate": "Fri, 21 Nov 2025 10:50:45 GMT"
    },
    {
      "title": "Russia’s drone revolution heaps pressure on Ukrainian defenses - CNN",
      "pubDate": "Sat, 22 Nov 2025 11:27:44 GMT"
    },
    {
      "title": "In Russian-Occupied Mariupol, Everything Ukrainian Must Go - The New York Times",
      "pubDate": "Sun, 23 Nov 2025 05:01:15 GMT"
    },
    {
      "title": "Russia-Ukraine war live: Nine killed in Kyiv, Rostov in overnight attacks - Al Jazeera",
      "pubDate": "Tue, 25 Nov 2025 09:40:57 GMT"
    },
    {
      "title": "Russia Strikes Ukraine and Signals Resistance to Amended Peace Plan - The New York Times",
      "pubDate": "Tue, 25 Nov 2025 21:08:50 GMT"
    },
    {
      "title": "Putin doubles down on demands for Ukrainian territory ahead of talks with US - BBC",
      "pubDate": "Thu, 27 Nov 2025 22:18:56 GMT"
    },
    {
      "title": "Ukraine war latest: Kyiv says Zelensky will never give up territory to Putin - The Independent",
      "pubDate": "Fri, 28 Nov 2025 10:30:00 GMT"
    },
    {
      "title": "Trump to hand Putin Ukraine’s occupied territories - The Telegraph",
      "pubDate": "Fri, 28 Nov 2025 12:47:00 GMT"
    },
    {
      "title": "Ukraine says it hit Russian ‘shadow fleet’ tankers with underwater drones in Black Sea - CNN",
      "pubDate": "Sat, 29 Nov 2025 12:59:48 GMT"
    },
    {
      "title": "Analysis: After ‘progress’ in talks to end Ukraine war, US diplomacy faces Kremlin test - CNN",
      "pubDate": "Mon, 01 Dec 2025 05:00:58 GMT"
    },
    {
      "title": "Third Russia-Linked Oil Tanker Suffers Explosions at Sea - Bloomberg.com",
      "pubDate": "Mon, 01 Dec 2025 11:11:10 GMT"
    },
    {
      "title": "After US-Russia meeting, Ukraine to begin regrouping with European and American allies - ABC News",
      "pubDate": "Thu, 04 Dec 2025 03:20:44 GMT"
    }
  ],
  "Donald Trump": [
    {
      "title": "Trump announces deals with Eli Lilly, Novo Nordisk to slash weight loss drug prices, offer some Medicare coverage - CNBC",
      "pubDate": "Thu, 06 Nov 2025 17:04:07 GMT"
    },
    {
      "title": "Donald Trump Signs New Nuclear Deal with Vladimir Putin Ally - Newsweek",
      "pubDate": "Fri, 07 Nov 2025 16:54:00 GMT"
    },
    {
      "title": "Trump tells Senate Republicans to send federal health insurance money 'directly to the people' - CNBC",
      "pubDate": "Sat, 08 Nov 2025 17:23:15 GMT"
    },
    {
      "title": "Trump's sweeping student-loan repayment changes are a big step closer to reaching borrowers - Business Insider",
      "pubDate": "Sun, 09 Nov 2025 09:42:00 GMT"
    },
    {
      "title": "Epstein Alleged in Emails That Trump Knew of His Conduct - The New York Times",
      "pubDate": "Wed, 12 Nov 2025 17:45:16 GMT"
    },
    {
      "title": "Trump dismisses mounting questions over Epstein links, then threatens Democratic foes with justice department investigation – live - The Guardian",
      "pubDate": "Fri, 14 Nov 2025 11:23:00 GMT"
    },
    {
      "title": "How sanctions imposed by Trump are taking a toll on the International Criminal Court - PBS",
      "pubDate": "Sat, 15 Nov 2025 22:35:24 GMT"
    },
    {
      "title": "The prospect of an embarrassing defeat convinced Trump to reverse course on Epstein files - CNN",
      "pubDate": "Tue, 18 Nov 2025 01:12:00 GMT"
    },
    {
      "title": "Trump abruptly pulls plan to announce Obamacare extension after ‘significant congressional backlash’: report - The Independent",
      "pubDate": "Tue, 25 Nov 2025 10:30:00 GMT"
    },
    {
      "title": "Live updates: Trump directs Witkoff to meet Putin as momentum builds on Ukraine peace talks - CNN",
      "pubDate": "Tue, 25 Nov 2025 23:05:00 GMT"
    },
    {
      "title": "Trump once again steps up attacks on TV networks as he threatens to revoke licenses - The Guardian",
      "pubDate": "Wed, 26 Nov 2025 11:02:00 GMT"
    },
    {
      "title": "Trump says US will permanently pause migration from 'Third World Countries' - Reuters",
      "pubDate": "Fri, 28 Nov 2025 04:54:00 GMT"
    },
    {
      "title": "Trump’s Response to Shooting Shows Intensified Anti-Immigration Stance - The New York Times",
      "pubDate": "Fri, 28 Nov 2025 20:26:39 GMT"
    },
    {
      "title": "Trump says airspace above and around Venezuela should be considered closed - Reuters",
      "pubDate": "Sat, 29 Nov 2025 16:58:06 GMT"
    },
    {
      "title": "Trump Says He Has Made His Choice to Lead the Federal Reserve - Bloomberg.com",
      "pubDate": "Sun, 30 Nov 2025 23:06:42 GMT"
    },
    {
      "title": "Live updates: Trump pardons Henry Cuellar; DHS launches immigration operations in Minneapolis, New Orleans - NBC News",
      "pubDate": "Wed, 03 Dec 2025 17:29:48 GMT"
    }
  ],
  "Financial Markets": [
    {
      "title": "Stock Market Today: S&P 500 Slips; ADP Data Points to Softer Jobs Market — Live Updates - The Wall Street Journal",
      "pubDate": "Tue, 11 Nov 2025 17:45:00 GMT"
    },
    {
      "title": "Dow rallies 300 points to new record with shutdown set to end Wednesday: Live updates - CNBC",
      "pubDate": "Wed, 12 Nov 2025 17:24:00 GMT"
    },
    {
      "title": "Stock Market Today: Dow Drops 557 Points as Selloff Intensifies - The Wall Street Journal",
      "pubDate": "Mon, 17 Nov 2025 22:30:00 GMT"
    }
  ],
  "China": [
    {
      "title": "China Suspends Some Export Controls on Critical Minerals but Retains Others - The New York Times",
      "pubDate": "Fri, 07 Nov 2025 12:32:22 GMT"
    },
    {
      "title": "China’s Deflationary Spiral Hurts Economy Harder Than Official Numbers Suggest - Bloomberg.com",
      "pubDate": "Sun, 09 Nov 2025 22:00:00 GMT"
    },
    {
      "title": "China devises plan to keep US military from getting its rare-earth magnets, WSJ reports - Reuters",
      "pubDate": "Tue, 11 Nov 2025 04:18:00 GMT"
    },
    {
      "title": "Bridge partially collapses in southwest China, months after opening - Reuters",
      "pubDate": "Tue, 11 Nov 2025 15:16:31 GMT"
    },
    {
      "title": "Xi’s Military Purges Show Unease About China’s Nuclear Forces - The New York Times",
      "pubDate": "Wed, 12 Nov 2025 05:01:06 GMT"
    },
    {
      "title": "China’s AI Leap: Matching U.S. Rivals in Power and Peril - WebProNews",
      "pubDate": "Fri, 14 Nov 2025 15:31:08 GMT"
    },
    {
      "title": "China issues travel warning for Japan over threats to intervene in Taiwan - Al Jazeera",
      "pubDate": "Sat, 15 Nov 2025 15:56:15 GMT"
    },
    {
      "title": "China sends coast guard to Senkaku islands amid row with Japan - The Guardian",
      "pubDate": "Sun, 16 Nov 2025 07:03:00 GMT"
    },
    {
      "title": "China Escalates Japan Feud With Island Patrols and Warnings to Citizens - The New York Times",
      "pubDate": "Sun, 16 Nov 2025 10:32:29 GMT"
    },
    {
      "title": "Japan says warplanes scrambled as Chinese drone detected near southern island close to Taiwan - CBS News",
      "pubDate": "Mon, 17 Nov 2025 13:06:00 GMT"
    },
    {
      "title": "We Now Have a Better Picture of China’s Global Lending Spree - The New York Times",
      "pubDate": "Tue, 18 Nov 2025 06:00:08 GMT"
    },
    {
      "title": "Chinese spies using LinkedIn to target British lawmakers, MI5 warns - CNN",
      "pubDate": "Tue, 18 Nov 2025 18:13:20 GMT"
    },
    {
      "title": "China and Japan are in a vicious game of chicken over Taiwan - The Economist",
      "pubDate": "Tue, 18 Nov 2025 18:00:53 GMT"
    },
    {
      "title": "China Is Priming Its People and the World for a New Pressure Campaign on Taiwan - The Wall Street Journal",
      "pubDate": "Thu, 20 Nov 2025 04:00:00 GMT"
    },
    {
      "title": "Shadow navy: How China's civilian fleet could be a potent weapon in a Taiwan invasion - Reuters",
      "pubDate": "Thu, 20 Nov 2025 11:00:00 GMT"
    },
    {
      "title": "Japan Set to Lean on US Allies for Support If China Escalates - Bloomberg.com",
      "pubDate": "Fri, 21 Nov 2025 11:00:00 GMT"
    },
    {
      "title": "US-Philippine task force to reestablish South China Sea ‘deterrence’ - Defense News",
      "pubDate": "Fri, 21 Nov 2025 16:09:05 GMT"
    },
    {
      "title": "China takes spat with Japan over Taiwan to UN, vows to defend itself - Reuters",
      "pubDate": "Sat, 22 Nov 2025 06:10:49 GMT"
    },
    {
      "title": "China criticizes Japan's plan to deploy missiles on island near Taiwan - NBC News",
      "pubDate": "Mon, 24 Nov 2025 10:01:04 GMT"
    },
    {
      "title": "China and Japan Are in a Showdown, With Trump in the Middle - The New York Times",
      "pubDate": "Tue, 25 Nov 2025 11:39:55 GMT"
    },
    {
      "title": "Taiwan's President Lai lashes out against Beijing, pledging $40 billion in additional defense budget - CNBC",
      "pubDate": "Wed, 26 Nov 2025 05:23:26 GMT"
    },
    {
      "title": "China’s property market is (somehow) worsening - The Economist",
      "pubDate": "Thu, 27 Nov 2025 11:37:22 GMT"
    },
    {
      "title": "Watch How China Came to Dominate Global Shipping Ports - Bloomberg.com",
      "pubDate": "Thu, 27 Nov 2025 22:00:03 GMT"
    },
    {
      "title": "China Wants to Dominate High- and Low-Tech Industries: New Economy - Bloomberg.com",
      "pubDate": "Sat, 29 Nov 2025 11:45:01 GMT"
    },
    {
      "title": "China's military firms struggle as corruption purge bites, report says - Reuters",
      "pubDate": "Mon, 01 Dec 2025 00:14:00 GMT"
    },
    {
      "title": "China to Intensify Crackdown on Virtual Currencies, Including Stablecoins: Report - CoinDesk",
      "pubDate": "Mon, 01 Dec 2025 03:45:50 GMT"
    },
    {
      "title": "Trump Signs Bill to Deepen US-Taiwan Ties Amid China Concerns - Bloomberg.com",
      "pubDate": "Wed, 03 Dec 2025 07:32:00 GMT"
    },
    {
      "title": "US halted plans to sanction Chinese spy agency to maintain trade truce - Financial Times",
      "pubDate": "Thu, 04 Dec 2025 04:22:52 GMT"
    },
    {
      "title": "Exclusive: China massing military ships across region in show of maritime force, sources say - Reuters",
      "pubDate": "Thu, 04 Dec 2025 07:11:00 GMT"
    },
    {
      "title": "US senators seek to block Nvidia sales of advanced chips to China - Financial Times",
      "pubDate": "Thu, 04 Dec 2025 19:49:55 GMT"
    }
  ],
  "AI Safety": [
    {
      "title": "AI reasoning models that can ‘think’ are more vulnerable to jailbreak attacks, new research suggests - Fortune",
      "pubDate": "Fri, 07 Nov 2025 22:00:00 GMT"
    },
    {
      "title": "California backs down on AI laws so more tech leaders don’t flee the state - Los Angeles Times",
      "pubDate": "Sat, 08 Nov 2025 20:47:00 GMT"
    },
    {
      "title": "OpenAI warns of ‘potentially catastrophic’ risks from superintelligent AI, outlines global safety measures - The Indian Express",
      "pubDate": "Sun, 09 Nov 2025 09:34:00 GMT"
    },
    {
      "title": "Carnegie Mellon prof. Zico Kolter leads an OpenAI safety panel that can halt unsafe AI releases - 90.5 WESA",
      "pubDate": "Sun, 09 Nov 2025 18:00:00 GMT"
    },
    {
      "title": "Tech companies and UK child safety agencies to test AI tools’ ability to create abuse images - The Guardian",
      "pubDate": "Wed, 12 Nov 2025 02:30:00 GMT"
    },
    {
      "title": "'I'm deeply uncomfortable': Anthropic CEO warns that a cadre of AI leaders, including himself, should not be in charge of the technology’s future - Fortune",
      "pubDate": "Mon, 17 Nov 2025 18:43:00 GMT"
    },
    {
      "title": "The UK’s Contribution to Developing the International Governance of AI Safety and How its Policy Took a Sharp Turn - Opinio Juris",
      "pubDate": "Tue, 18 Nov 2025 13:02:38 GMT"
    },
    {
      "title": "Lawmakers press tech and health experts on AI safety and data privacy, hoping to shape future regulation - Scripps News",
      "pubDate": "Wed, 19 Nov 2025 19:33:01 GMT"
    },
    {
      "title": "Trump renews effort to block states from regulating AI, raising alarms about safety - KTVZ",
      "pubDate": "Thu, 20 Nov 2025 17:23:55 GMT"
    },
    {
      "title": "Senators Introduce AI Security Readiness Act - ExecutiveGov",
      "pubDate": "Thu, 20 Nov 2025 22:23:22 GMT"
    },
    {
      "title": "Anthropic's AI Safety Team Raises Alarm: AI That Designs Vaccines Could Just As Easily Be Used To Build Bioweapons - Yahoo",
      "pubDate": "Tue, 25 Nov 2025 17:00:49 GMT"
    },
    {
      "title": "Congress calls Anthropic CEO to testify on Chinese AI cyberattack - Tech in Asia",
      "pubDate": "Thu, 27 Nov 2025 02:36:00 GMT"
    },
    {
      "title": "OpenAI responds lawsuit over teen suicide as debate over AI safety intensifies - Techloy",
      "pubDate": "Thu, 27 Nov 2025 13:25:35 GMT"
    },
    {
      "title": "California, White House Clash Over Who Should Regulate Artificial Intelligence - ABC10",
      "pubDate": "Fri, 28 Nov 2025 01:45:00 GMT"
    },
    {
      "title": "Poetry Can Jailbreak AI Into Making Nuclear Weapons - The Tech Buzz",
      "pubDate": "Fri, 28 Nov 2025 10:49:00 GMT"
    },
    {
      "title": "AI companies' safety practices fail to meet global standards, study shows - Reuters",
      "pubDate": "Wed, 03 Dec 2025 11:18:04 GMT"
    },
    {
      "title": "AI safety report warns industry is 'structurally unprepared' for rising risks - Scripps News",
      "pubDate": "Thu, 04 Dec 2025 21:01:23 GMT"
    }
  ],
  "Data Breach": [
    {
      "title": "Data breach at Chinese infosec firm reveals cyber-weapons and target list - theregister.com",
      "pubDate": "Sun, 09 Nov 2025 23:51:00 GMT"
    },
    {
      "title": "Hyundai, Kia, And Genesis Suffer Massive Customer Data Breach - thetruthaboutcars.com",
      "pubDate": "Mon, 10 Nov 2025 18:30:00 GMT"
    },
    {
      "title": "How hackers exposed personal info of 1.7M students in NY, prompting data breach settlement - LoHud.com",
      "pubDate": "Tue, 11 Nov 2025 08:02:39 GMT"
    },
    {
      "title": "DoorDash confirms data breach impacting users’ phone numbers and physical addresses - TechCrunch",
      "pubDate": "Mon, 17 Nov 2025 15:27:38 GMT"
    },
    {
      "title": "CodeRED Emergency Alerts Disrupted Across US After Ransomware Breach - Bitdefender",
      "pubDate": "Fri, 28 Nov 2025 11:50:20 GMT"
    },
    {
      "title": "South Korean e-commerce firm Coupang says 33.7 million customer accounts breached - Reuters",
      "pubDate": "Sat, 29 Nov 2025 23:01:30 GMT"
    },
    {
      "title": "700Credit data breach affects 18,000 dealerships, 5.6 million customers - Automotive News",
      "pubDate": "Wed, 03 Dec 2025 11:00:00 GMT"
    }
  ],
  "Cybersecurity": [
    {
      "title": "US Congressional Budget Office hit by cybersecurity incident - Reuters",
      "pubDate": "Fri, 07 Nov 2025 15:38:39 GMT"
    },
    {
      "title": "US Congress moves to restore CISA 2015, closing cybersecurity gaps for critical infrastructure - Industrial Cyber",
      "pubDate": "Wed, 12 Nov 2025 14:53:59 GMT"
    },
    {
      "title": "An AI-Powered Cyberattack Is Self-Replicating - Forbes",
      "pubDate": "Tue, 18 Nov 2025 13:59:27 GMT"
    },
    {
      "title": "AI-Powered Cybersecurity: New Tools Combat Evolving Threats in Real Time - Tech Times",
      "pubDate": "Sat, 22 Nov 2025 16:25:39 GMT"
    },
    {
      "title": "Harvard cyberattack data breach exposes alumni, donors, students and faculty records? Here's complete trut - The Economic Times",
      "pubDate": "Sat, 22 Nov 2025 20:36:46 GMT"
    },
    {
      "title": "Eroding Global Stability: The Cybersecurity Strategies Of China, Russia, North Korea, And Iran - Small Wars Journal",
      "pubDate": "Wed, 26 Nov 2025 06:01:40 GMT"
    },
    {
      "title": "State-backed spyware attacks are targeting Signal and WhatsApp users, CISA warns - Bitdefender",
      "pubDate": "Thu, 27 Nov 2025 09:11:41 GMT"
    },
    {
      "title": "Cybersecurity experts alarmed by Snapchat's age-verification plan - abc.net.au",
      "pubDate": "Thu, 27 Nov 2025 19:30:09 GMT"
    },
    {
      "title": "Malicious LLMs are letting even unskilled hackers to craft dangerous new malware - TechRadar",
      "pubDate": "Fri, 28 Nov 2025 19:56:00 GMT"
    },
    {
      "title": "FCC Warns of Cybersecurity Risks After Texas, Virginia Breaches - radioworld.com",
      "pubDate": "Sat, 29 Nov 2025 15:01:53 GMT"
    },
    {
      "title": "N. Korean hacking group Lazarus behind 31 attacks over past year: report - Yonhap News Agency",
      "pubDate": "Sun, 30 Nov 2025 02:19:09 GMT"
    },
    {
      "title": "CISA Warns of Android 0-Day Vulnerability Exploited in Attacks - Cyber Press",
      "pubDate": "Wed, 03 Dec 2025 18:21:18 GMT"
    },
    {
      "title": "Exclusive | Cybersecurity Startup 7AI Raises $130 Million in Series A Funding - The Wall Street Journal",
      "pubDate": "Thu, 04 Dec 2025 10:55:00 GMT"
    }
  ],
  "US Economy": [
    {
      "title": "Shutdown strain: US economy reels under layoffs and lost pay; food banks, small firms struggle to cope - The Times of India",
      "pubDate": "Sat, 08 Nov 2025 16:57:00 GMT"
    },
    {
      "title": "US economy saw stronger-than-expected job growth in September, but the unemployment rate rose - CNN",
      "pubDate": "Thu, 20 Nov 2025 16:06:00 GMT"
    },
    {
      "title": "Grim retail sales data fuels concerns about health of US economy - Financial Times",
      "pubDate": "Tue, 25 Nov 2025 13:38:02 GMT"
    },
    {
      "title": "US dollar set for worst week since July as Fed rate cut looms - Reuters",
      "pubDate": "Fri, 28 Nov 2025 19:53:39 GMT"
    }
  ],
  "Earthquakes": [
    {
      "title": "Japan Issues Tsunami Advisory After Strong Earthquake Off Its Coast - The New York Times",
      "pubDate": "Sun, 09 Nov 2025 09:08:53 GMT"
    }
  ],
  "Bitcoin": [
    {
      "title": "Oct. 7 families' lawsuit says Bitcoin CEO, whom Trump pardoned, facilitated $1B in payments to Hamas and its allies - Jewish Telegraphic Agency",
      "pubDate": "Tue, 25 Nov 2025 19:51:09 GMT"
    },
    {
      "title": "Did the U.S. Steal $13 Billion in Bitcoin? China Says the Biggest Crypto Heist Ever Was a Black Ops Job - Disruption Banking",
      "pubDate": "Sat, 29 Nov 2025 11:16:48 GMT"
    },
    {
      "title": "Bitcoin Plunges to Below $86,000 in Risk-Off Start to December - Bloomberg.com",
      "pubDate": "Mon, 01 Dec 2025 10:03:39 GMT"
    }
  ],
  "Fusion Power": [
    {
      "title": "Department of Energy unveils ambitious plan to tap into unlimited energy source: 'Deliver large-scale integration' - Yahoo",
      "pubDate": "Tue, 11 Nov 2025 02:30:00 GMT"
    },
    {
      "title": "China accelerates efforts towards nuclear fusion with global research program - CCTV.com English",
      "pubDate": "Tue, 25 Nov 2025 03:02:54 GMT"
    }
  ],
  "OpenAI": [
    {
      "title": "OpenAI taps iPhone assembler Foxconn to manufacture data center components in U.S. - CNBC",
      "pubDate": "Thu, 20 Nov 2025 22:50:01 GMT"
    },
    {
      "title": "OpenAI partners amass $100bn debt pile to fund its ambitions - Financial Times",
      "pubDate": "Fri, 28 Nov 2025 05:00:22 GMT"
    },
    {
      "title": "OpenAI’s Sora Is Letting Teens Generate Videos of School Shootings - Futurism",
      "pubDate": "Sat, 29 Nov 2025 11:45:00 GMT"
    },
    {
      "title": "OpenAI Declares ‘Code Red’ as Google Threatens AI Lead - The Wall Street Journal",
      "pubDate": "Tue, 02 Dec 2025 06:27:00 GMT"
    }
  ],
  "Gaza": [
    {
      "title": "LIVE: Israel kills more Palestinians in Gaza, bombs southern Lebanon - Al Jazeera",
      "pubDate": "Thu, 06 Nov 2025 15:20:35 GMT"
    },
    {
      "title": "US and Israel’s controversial plan to build ‘New Gaza’ sparks alarm - Financial Times",
      "pubDate": "Sat, 08 Nov 2025 05:00:16 GMT"
    },
    {
      "title": "Gaza death toll tops 69,000 as Israel and Hamas exchange more remains - PBS",
      "pubDate": "Sat, 08 Nov 2025 17:19:53 GMT"
    },
    {
      "title": "Trump has promised peace for Gaza. Private documents paint a grim picture. - Politico",
      "pubDate": "Tue, 11 Nov 2025 10:55:00 GMT"
    },
    {
      "title": "UNICEF says Israel blocking 1 million syringes needed to vaccinate Gaza children - NBC News",
      "pubDate": "Tue, 11 Nov 2025 13:05:39 GMT"
    },
    {
      "title": "They found a 'bucket of lentils.' Then it blew up. The menace of Gaza's unexploded ordnance - NPR",
      "pubDate": "Wed, 12 Nov 2025 10:03:00 GMT"
    },
    {
      "title": "Hamas quietly reasserts control in Gaza as post-war talks grind on - Reuters",
      "pubDate": "Fri, 14 Nov 2025 08:31:47 GMT"
    },
    {
      "title": "LIVE: Israel closely coordinated Gaza families’ mystery transit to S Africa - Al Jazeera",
      "pubDate": "Sat, 15 Nov 2025 11:32:36 GMT"
    },
    {
      "title": "Israel-Gaza live updates: Mixed responses to UN vote approving Trump peace plan - abcnews.go.com",
      "pubDate": "Tue, 18 Nov 2025 20:45:00 GMT"
    },
    {
      "title": "LIVE: 14 killed in Israeli air attacks in Lebanon; air strikes in Gaza - Al Jazeera",
      "pubDate": "Wed, 19 Nov 2025 11:15:00 GMT"
    },
    {
      "title": "7 Km Long, 25 Metres Deep, 80 Rooms: Israel Finds Hamas \"Complex\" Tunnel - NDTV",
      "pubDate": "Fri, 21 Nov 2025 02:32:46 GMT"
    },
    {
      "title": "Gaza: Two children killed every day during fragile ceasefire, says UNICEF - UN News",
      "pubDate": "Fri, 21 Nov 2025 13:10:32 GMT"
    },
    {
      "title": "Israel launches strikes in Gaza ceasefire’s latest test as hospitals say more than 20 killed - Politico",
      "pubDate": "Sat, 22 Nov 2025 16:22:36 GMT"
    },
    {
      "title": "Sexual abuse claims emerge from the Israel-Gaza war - NBC News",
      "pubDate": "Tue, 25 Nov 2025 14:12:06 GMT"
    },
    {
      "title": "Rebuilding ‘human-made abyss’ in Gaza will cost at least $70bn, UN says - The Guardian",
      "pubDate": "Tue, 25 Nov 2025 19:54:00 GMT"
    },
    {
      "title": "Israel still committing genocide in Gaza, Amnesty International says - The Guardian",
      "pubDate": "Thu, 27 Nov 2025 19:07:00 GMT"
    },
    {
      "title": "LIVE: Israel bombs Syria, Gaza after extrajudicial killings in West Bank - Al Jazeera",
      "pubDate": "Fri, 28 Nov 2025 10:18:50 GMT"
    },
    {
      "title": "As bodies continue to be pulled from the rubble, Hamas-run health ministry says Gaza death toll passed 70,000 - The Times of Israel",
      "pubDate": "Sat, 29 Nov 2025 16:53:18 GMT"
    },
    {
      "title": "Israel says it will reopen Rafah Crossing within days to allow Gazans to exit to Egypt - The Times of Israel",
      "pubDate": "Wed, 03 Dec 2025 08:10:14 GMT"
    },
    {
      "title": "Puppet Regime: Hamas' Coercive Grip on Aid and NGO Operations in Gaza - NGO Monitor",
      "pubDate": "Wed, 03 Dec 2025 13:22:03 GMT"
    }
  ],
  "Climate Change": [
    {
      "title": "Solar geoengineering in wrong hands could wreak climate havoc, scientists warn - The Guardian",
      "pubDate": "Wed, 05 Nov 2025 00:02:00 GMT"
    },
    {
      "title": "U.S. skips COP30 climate conference, lobbies to sink new global deals - The Washington Post",
      "pubDate": "Fri, 07 Nov 2025 17:00:57 GMT"
    },
    {
      "title": "Leaders at the Global Climate Summit Highlight the Rising Toll of Warming - The New York Times",
      "pubDate": "Fri, 07 Nov 2025 18:38:18 GMT"
    },
    {
      "title": "COP30: How the world plans to pay its rising climate costs - Reuters",
      "pubDate": "Tue, 11 Nov 2025 05:01:00 GMT"
    },
    {
      "title": "Earth's reality check: UN Climate Change Conference COP30 venue flooded in Brazil - Watch - The Times of India",
      "pubDate": "Wed, 12 Nov 2025 03:50:00 GMT"
    },
    {
      "title": "COP30: Climate crisis is a health crisis, WHO warns as philanthropies pledge $300m for solutions - UN News",
      "pubDate": "Fri, 14 Nov 2025 16:58:50 GMT"
    },
    {
      "title": "Cop30: calls for new urgency to talks as studies show global warming may reach 2.5C – latest updates - The Guardian",
      "pubDate": "Mon, 17 Nov 2025 16:37:31 GMT"
    },
    {
      "title": "A Landmark Court Ruling Looms Over U.S. Absence at COP30 - Inside Climate News",
      "pubDate": "Tue, 18 Nov 2025 10:00:00 GMT"
    },
    {
      "title": "Pope Leo XIV calls for urgent climate action and says God’s creation is 'crying out' - abcnews.go.com",
      "pubDate": "Tue, 18 Nov 2025 08:16:24 GMT"
    },
    {
      "title": "Brazil pushes for early COP30 climate deal, though divisions persist - Reuters",
      "pubDate": "Tue, 18 Nov 2025 23:36:42 GMT"
    },
    {
      "title": "Climate Adaptation Moves Closer to Center Stage at COP30 - Bloomberg.com",
      "pubDate": "Wed, 19 Nov 2025 10:51:13 GMT"
    },
    {
      "title": "Human-induced climate change compounded by socio-economic water stressors increased severity of 5-year drought in Iran and Euphrates and Tigris basin – World Weather Attribution - World Weather Attribution",
      "pubDate": "Fri, 21 Nov 2025 05:04:09 GMT"
    },
    {
      "title": "Brazil Draft COP30 Climate Deal Omits Plan to Exit Fossil Fuels - Bloomberg.com",
      "pubDate": "Fri, 21 Nov 2025 10:57:59 GMT"
    },
    {
      "title": "'A lot of fighting': Fossil fuel row breaks out at UN climate summit - BBC",
      "pubDate": "Fri, 21 Nov 2025 21:21:41 GMT"
    },
    {
      "title": "Alaska Native villages have few options and little US help as climate change devours their land - ABC News",
      "pubDate": "Sat, 22 Nov 2025 14:41:00 GMT"
    },
    {
      "title": "N.C. Regulators Say Trump’s Proposed Repeal of the Endangerment Finding Would Increase ‘Criteria’ Air Pollutants - Inside Climate News",
      "pubDate": "Tue, 25 Nov 2025 23:33:51 GMT"
    },
    {
      "title": "Dimming the Sun to fight climate change is bad for planet, ministers fear - The Telegraph",
      "pubDate": "Thu, 27 Nov 2025 19:48:00 GMT"
    },
    {
      "title": "Revealed: Europe’s water reserves drying up due to climate breakdown - The Guardian",
      "pubDate": "Sat, 29 Nov 2025 06:00:00 GMT"
    },
    {
      "title": "How climate change is mobilizing plastic pollution - earth.com",
      "pubDate": "Sat, 29 Nov 2025 14:35:22 GMT"
    },
    {
      "title": "Australia climate change protest disrupts shipping at coal port, 21 arrested - Deccan Herald",
      "pubDate": "Sun, 30 Nov 2025 04:40:49 GMT"
    },
    {
      "title": "In era of AI and climate change, energy policy must navigate new trade-offs and dilemmas - The Indian Express",
      "pubDate": "Mon, 01 Dec 2025 01:06:46 GMT"
    },
    {
      "title": "Here's what would make Bill Gates support dimming the sun to stop climate change - Axios",
      "pubDate": "Mon, 01 Dec 2025 10:02:04 GMT"
    },
    {
      "title": "Top Journal Retracts Study Predicting Catastrophic Climate Toll - The New York Times",
      "pubDate": "Wed, 03 Dec 2025 10:03:38 GMT"
    },
    {
      "title": "How do we know the role of climate change in weather events? Attribution science. - Climate Central",
      "pubDate": "Wed, 03 Dec 2025 14:27:17 GMT"
    },
    {
      "title": "‘Too hot to handle’: climate change pushing Arab region to limits, says WMO - Financial Times",
      "pubDate": "Thu, 04 Dec 2025 08:00:08 GMT"
    }
  ],
  "FBI": [
    {
      "title": "FBI reveals ISIS terror attack plan on Chicago Pride Parade - The Jerusalem Post",
      "pubDate": "Sun, 16 Nov 2025 04:16:03 GMT"
    }
  ],
  "Artificial General Intelligence": [
    {
      "title": "'We're At This Intermediate Stage': Ex-Tesla AI Chief Andrej Karpathy Says AGI Is Still A Decade Away - Yahoo Finance",
      "pubDate": "Sun, 09 Nov 2025 19:32:06 GMT"
    },
    {
      "title": "Intel’s AI Leader Sachin Katti Joins OpenAI, To Focus On Artificial General Intelligence - NDTV Profit",
      "pubDate": "Tue, 11 Nov 2025 07:54:07 GMT"
    },
    {
      "title": "AI pioneer Yann Le Cun is quitting Meta over the future of intelligence - France 24",
      "pubDate": "Sun, 16 Nov 2025 15:16:10 GMT"
    },
    {
      "title": "How Superintelligent AI Could Upend Work and Politics - The Ringer",
      "pubDate": "Tue, 18 Nov 2025 22:27:58 GMT"
    },
    {
      "title": "Luma AI secures $900 million to speed up multimodal AGI push - Times of India",
      "pubDate": "Thu, 20 Nov 2025 17:34:00 GMT"
    },
    {
      "title": "If we don’t control the AI industry, it could end up controlling us, warn two chilling new books - Scroll.in",
      "pubDate": "Sat, 22 Nov 2025 15:00:00 GMT"
    }
  ],
  "National Security": [
    {
      "title": "Military experts warn security hole in most AI chatbots can sow chaos - Defense News",
      "pubDate": "Mon, 10 Nov 2025 21:50:50 GMT"
    },
    {
      "title": "Trump’s Venezuela war threats roil Latin American leaders - The Washington Post",
      "pubDate": "Sat, 15 Nov 2025 11:44:41 GMT"
    },
    {
      "title": "Narco-Terrorism in the Tri-Border Area: A Hidden Threat to U.S. National Security - Homeland Security Today",
      "pubDate": "Mon, 17 Nov 2025 11:30:57 GMT"
    },
    {
      "title": "China rapidly expands nuclear test site as Trump revives Cold War tension - The Washington Post",
      "pubDate": "Mon, 17 Nov 2025 17:31:59 GMT"
    },
    {
      "title": "Dozens of groups call for governments to protect encryption - CyberScoop",
      "pubDate": "Mon, 17 Nov 2025 20:58:48 GMT"
    },
    {
      "title": "Mounting Chinese threat prompts CISA to ramp up hiring - SC Media",
      "pubDate": "Tue, 18 Nov 2025 17:13:45 GMT"
    },
    {
      "title": "Congressional committee urges swift action on escalating Chinese threats - The Washington Post",
      "pubDate": "Wed, 19 Nov 2025 00:22:51 GMT"
    },
    {
      "title": "USCIS Implements Extra National Security Measures in Wake of National Guard Shooting by Afghan National - Homeland Security Today",
      "pubDate": "Fri, 28 Nov 2025 08:11:54 GMT"
    },
    {
      "title": "Hegseth order on first Caribbean boat strike, officials say: Kill them all - The Washington Post",
      "pubDate": "Sat, 29 Nov 2025 07:54:00 GMT"
    },
    {
      "title": "Kogi church attack: Tinubu declare national security emergency but attacks never stop, how military dey respond? - BBC",
      "pubDate": "Mon, 01 Dec 2025 10:41:14 GMT"
    },
    {
      "title": "A Devastating Fire Has Fueled a National Security Crackdown in Hong Kong - The New York Times",
      "pubDate": "Wed, 03 Dec 2025 15:47:43 GMT"
    }
  ],
  "North Korea": [
    {
      "title": "North Korea Threatens US With ‘More Aggressive Actions’ - Newsweek",
      "pubDate": "Sat, 08 Nov 2025 18:05:00 GMT"
    },
    {
      "title": "North Korean troops deployed to clear land mines for Russia - The Telegraph",
      "pubDate": "Sat, 15 Nov 2025 11:58:00 GMT"
    },
    {
      "title": "N. Korea may possess more than 400 nuclear weapons by 2040: analyst - upi.com",
      "pubDate": "Wed, 26 Nov 2025 09:58:54 GMT"
    },
    {
      "title": "Report Flags Alarming North Korea Nuke Surge - StratNews Global",
      "pubDate": "Sat, 29 Nov 2025 04:37:16 GMT"
    },
    {
      "title": "US-North Korea Tensions Rise Amid Military Drills: Implications for Global Stability - Meyka",
      "pubDate": "Sat, 29 Nov 2025 11:18:39 GMT"
    },
    {
      "title": "North Korea's Kim stresses Air Force's nuclear war deterrence on its 80th anniversary - Reuters",
      "pubDate": "Sat, 29 Nov 2025 22:17:34 GMT"
    },
    {
      "title": "North Korea First Unveils Long-Range Missile Resembling Taurus - 조선일보",
      "pubDate": "Sun, 30 Nov 2025 21:14:15 GMT"
    },
    {
      "title": "North Korea lures engineers to rent identities in fake IT worker scheme - BleepingComputer",
      "pubDate": "Tue, 02 Dec 2025 14:04:18 GMT"
    }
  ],
  "Iran": [
    {
      "title": "IAEA says Iran must 'seriously improve' nuclear cooperation, FT reports - Reuters",
      "pubDate": "Wed, 05 Nov 2025 05:55:29 GMT"
    },
    {
      "title": "Iran plotted to assassinate Israel's ambassador to Mexico, U.S. officials say - Axios",
      "pubDate": "Fri, 07 Nov 2025 15:04:22 GMT"
    },
    {
      "title": "Another Israel-Iran war increasingly seen as just a matter of time — New York Times - The Times of Israel",
      "pubDate": "Sun, 09 Nov 2025 13:34:55 GMT"
    },
    {
      "title": "Iran confirms seizure of oil tanker in the Strait of Hormuz - CBS News",
      "pubDate": "Sat, 15 Nov 2025 12:21:33 GMT"
    },
    {
      "title": "Iran's foreign minister says the nation is no longer enriching uranium at any site in the country - NPR",
      "pubDate": "Sun, 16 Nov 2025 11:00:38 GMT"
    },
    {
      "title": "Iran’s Water Crisis: When Drought Hits Harder Than Sanctions and Bombs - Forbes",
      "pubDate": "Sun, 16 Nov 2025 18:14:36 GMT"
    },
    {
      "title": "US-E3 draft resolution at IAEA board demands swift cooperation from Iran - Reuters",
      "pubDate": "Tue, 18 Nov 2025 22:59:44 GMT"
    },
    {
      "title": "IAEA puts pressure on Iran, targeting 60% enriched uranium - The Jerusalem Post",
      "pubDate": "Wed, 19 Nov 2025 14:45:22 GMT"
    },
    {
      "title": "Iran cancels new nuclear inspections it agreed to after bombing campaign - The Washington Post",
      "pubDate": "Fri, 21 Nov 2025 05:21:59 GMT"
    },
    {
      "title": "Taps are running dry in Iran. Decades of bad decisions are to blame. - The Washington Post",
      "pubDate": "Mon, 24 Nov 2025 17:31:54 GMT"
    }
  ],
  "US Supreme Court": [
    {
      "title": "US Supreme Court rejects bid to overturn same-sex marriage right - Reuters",
      "pubDate": "Mon, 10 Nov 2025 17:57:11 GMT"
    },
    {
      "title": "Supreme Court to review US government power to limit asylum processing - Reuters",
      "pubDate": "Mon, 17 Nov 2025 15:04:30 GMT"
    },
    {
      "title": "North Dakota court upholds near-total abortion ban - BBC",
      "pubDate": "Sat, 22 Nov 2025 22:28:09 GMT"
    }
  ],
  "Climate": [
    {
      "title": "COP30 kicks off with urgent call to deliver on climate promises and scale up finance - UN News",
      "pubDate": "Sat, 08 Nov 2025 23:00:00 GMT"
    },
    {
      "title": "Climate disasters displaced 250 million people in past 10 years, UN report finds - The Guardian",
      "pubDate": "Sun, 09 Nov 2025 23:02:00 GMT"
    },
    {
      "title": "Trump administration skips COP30 climate summit, leaving California's Newsom to hurl criticism from Brazil - CBS News",
      "pubDate": "Tue, 11 Nov 2025 15:30:00 GMT"
    },
    {
      "title": "Newsom calls Trump an ‘invasive species’ and ‘wrecking ball’ in fiery remarks at COP30 climate summit - CNN",
      "pubDate": "Wed, 12 Nov 2025 17:31:29 GMT"
    },
    {
      "title": "Cop30 live: current climate pathway ‘a death sentence for many’, says UN secretary-general - The Guardian",
      "pubDate": "Thu, 20 Nov 2025 12:08:00 GMT"
    },
    {
      "title": "Cop30 climate summit in Brazil disrupted after fire breaks out in venue - The Guardian",
      "pubDate": "Thu, 20 Nov 2025 20:28:00 GMT"
    },
    {
      "title": "With the world at COP30, Trump administration rolls back environmental rules - NBC News",
      "pubDate": "Sat, 22 Nov 2025 11:45:00 GMT"
    },
    {
      "title": "Canada Lifts Climate Laws for Alberta Oil Sands, Planning Pipeline - The New York Times",
      "pubDate": "Fri, 28 Nov 2025 02:20:34 GMT"
    },
    {
      "title": "More than 1,000 Amazon workers warn rapid AI rollout threatens jobs and climate - The Guardian",
      "pubDate": "Fri, 28 Nov 2025 13:50:00 GMT"
    }
  ],
  "Cybersecurity and Infrastructure Security Agency": [
    {
      "title": "CISA Issues Alert on Samsung 0-Day RCE Flaw Actively Exploited in Attacks - GBHackers News",
      "pubDate": "Tue, 11 Nov 2025 06:53:54 GMT"
    },
    {
      "title": "Akira Ransomware Targets Over 250 Organizations, Extracts $42 Million in Ransom Payments – New CISA Report - CyberSecurityNews",
      "pubDate": "Sat, 15 Nov 2025 06:09:37 GMT"
    },
    {
      "title": "CISA Warns of Google Chrome 0-Day Vulnerability Exploited in Attacks - CyberSecurityNews",
      "pubDate": "Thu, 20 Nov 2025 08:58:51 GMT"
    },
    {
      "title": "U.S. Cyber Agency Flags Critical Oracle Identity Manager Flaw Amid Evidence of Active Attacks - LinkedIn",
      "pubDate": "Mon, 24 Nov 2025 16:09:39 GMT"
    },
    {
      "title": "CISA to Broaden AI Deployment for Faster Cyber Defense - CDO Magazine",
      "pubDate": "Fri, 28 Nov 2025 13:17:00 GMT"
    }
  ],
  "Elon Musk": [
    {
      "title": "Elon Musk says that in 10 to 20 years, work will be optional and money will be irrelevant thanks to AI and robotics - Fortune",
      "pubDate": "Thu, 20 Nov 2025 18:37:00 GMT"
    },
    {
      "title": "Elon Musk says he tried to warn Trump about tariffs, which manufacturers say are eroding U.S. jobs - Fortune",
      "pubDate": "Tue, 02 Dec 2025 17:08:00 GMT"
    }
  ],
  "Pollution": [
    {
      "title": "Delhi pollution: Children are hit hardest by toxic air in Indian capital - BBC",
      "pubDate": "Thu, 27 Nov 2025 01:02:03 GMT"
    },
    {
      "title": "Pollution Worsens In Delhi, Air Quality 'Severe' In Most Areas - NDTV",
      "pubDate": "Fri, 28 Nov 2025 03:27:23 GMT"
    }
  ],
  "World News": [
    {
      "title": "Argentina: 'Huge' explosions rock industrial complex - Times of India",
      "pubDate": "Sat, 15 Nov 2025 17:40:00 GMT"
    },
    {
      "title": "November 30, 2025 — Trump administration news, Ukraine war talks, Venezuela tensions - CNN",
      "pubDate": "Mon, 01 Dec 2025 03:07:00 GMT"
    }
  ],
  "Hacking": [
    {
      "title": "U.S. Targets Suspected North Korean Hackers Funding Nuclear Bombs - Newsweek",
      "pubDate": "Wed, 05 Nov 2025 05:57:00 GMT"
    },
    {
      "title": "Chinese hackers probe Australian, US cyber infrastructure - The Jerusalem Post",
      "pubDate": "Wed, 12 Nov 2025 04:03:41 GMT"
    },
    {
      "title": "Security News This Week: A Major Leak Spills a Chinese Hacking Contractor’s Tools and Targets - WIRED",
      "pubDate": "Sat, 15 Nov 2025 11:30:00 GMT"
    },
    {
      "title": "Russian alleged cyber-hacker faces extradition to US after arrest in Thailand - CNN",
      "pubDate": "Sat, 15 Nov 2025 07:49:21 GMT"
    },
    {
      "title": "The Pentagon Is Spending Millions On AI Hacking From Startup Twenty - Forbes",
      "pubDate": "Sat, 15 Nov 2025 13:00:00 GMT"
    },
    {
      "title": "Google Issues Security Fix for Actively Exploited Chrome V8 Zero-Day Vulnerability - The Hacker News",
      "pubDate": "Tue, 18 Nov 2025 04:44:00 GMT"
    },
    {
      "title": "N. Korean hacking group Lazarus suspected behind recent crypto hacking: sources - upi.com",
      "pubDate": "Fri, 28 Nov 2025 04:15:25 GMT"
    },
    {
      "title": "South Korea police say 120,000 home cameras hacked for 'sexploitation' footage - BBC",
      "pubDate": "Mon, 01 Dec 2025 06:04:53 GMT"
    }
  ],
  "Drones": [
    {
      "title": "African women tricked into making Russian drones: 'My skin was peeling' - BBC",
      "pubDate": "Wed, 05 Nov 2025 06:23:25 GMT"
    },
    {
      "title": "Army wants to buy one million drones over next two to three years - Breaking Defense",
      "pubDate": "Fri, 07 Nov 2025 19:20:59 GMT"
    },
    {
      "title": "Russia pounds Ukraine with drones and missiles, killing eight and hitting energy sites - Reuters",
      "pubDate": "Fri, 14 Nov 2025 12:46:10 GMT"
    },
    {
      "title": "Ukraine war briefing: mass production of Ukrainian ‘Octopus’ interceptor drones begins - The Guardian",
      "pubDate": "Sat, 15 Nov 2025 04:26:00 GMT"
    },
    {
      "title": "Russia downs 33 Ukrainian drones overnight, defence ministry says - Reuters",
      "pubDate": "Fri, 21 Nov 2025 05:34:35 GMT"
    },
    {
      "title": "Netherlands opens fire on suspicious drones near air base housing US nuclear weapons - The Kyiv Independent",
      "pubDate": "Sat, 22 Nov 2025 21:09:24 GMT"
    },
    {
      "title": "U.S. Launches One-Way-Attack Drone Force in the Middle East > U.S. Central Command > Press Release View - centcom.mil",
      "pubDate": "Wed, 03 Dec 2025 14:07:20 GMT"
    },
    {
      "title": "Pentagon seeks to acquire, rapidly field over 300,000 small drones - Defense News",
      "pubDate": "Wed, 03 Dec 2025 20:55:29 GMT"
    }
  ],
  "Federal Reserve": [
    {
      "title": "The Fed faces deep divides at a fraught moment - Axios",
      "pubDate": "Fri, 14 Nov 2025 17:00:35 GMT"
    },
    {
      "title": "New York Fed chief raises expectations of a rate cut - Axios",
      "pubDate": "Sat, 22 Nov 2025 04:27:26 GMT"
    },
    {
      "title": "Fed's Waller: December cut appropriate, but January action more uncertain - Fox Business - Reuters",
      "pubDate": "Mon, 24 Nov 2025 15:18:22 GMT"
    },
    {
      "title": "Economists double down on December Fed cut despite policymaker divide: Reuters poll - Reuters",
      "pubDate": "Thu, 04 Dec 2025 13:40:42 GMT"
    }
  ],
  "Department of Homeland Security": [
    {
      "title": "Shots fired at federal immigration agents in Chicago, says Department of Homeland Security - NBC News",
      "pubDate": "Sun, 09 Nov 2025 00:23:53 GMT"
    },
    {
      "title": "ICE Arrests Fugitive Murderer Released into American Neighborhoods by the Biden Administration - Homeland Security (.gov)",
      "pubDate": "Tue, 11 Nov 2025 19:01:07 GMT"
    },
    {
      "title": "Homeland Security Department Shifts Its Focus to Immigration Crackdown - The New York Times",
      "pubDate": "Sun, 16 Nov 2025 10:00:22 GMT"
    },
    {
      "title": "Social Security Data Is Openly Being Shared With DHS to Target Immigrants - WIRED",
      "pubDate": "Tue, 18 Nov 2025 11:00:00 GMT"
    },
    {
      "title": "'Unprecedented' number of Chinese ships in the Arctic: DHS - ABC News",
      "pubDate": "Tue, 25 Nov 2025 22:49:58 GMT"
    },
    {
      "title": "DHS: Tiktok user suggested he was building bomb targeting Fort Worth - FOX 4 News Dallas-Fort Worth",
      "pubDate": "Sat, 29 Nov 2025 18:02:43 GMT"
    },
    {
      "title": "ICE Arrests Criminal Illegal Aliens from Afghanistan Released Into Our Country by the Biden Administration - Homeland Security (.gov)",
      "pubDate": "Thu, 04 Dec 2025 20:40:33 GMT"
    }
  ],
  "Microsoft": [
    {
      "title": "Patch Now: Microsoft Flags Zero-Day & Critical Zero-Click Bugs - Dark Reading | Security",
      "pubDate": "Tue, 11 Nov 2025 21:22:12 GMT"
    }
  ],
  "European Union": [
    {
      "title": "Ukraine’s Cash Is Running Low, and Europe Has No Good Plan B - The New York Times",
      "pubDate": "Mon, 17 Nov 2025 16:08:55 GMT"
    },
    {
      "title": "The EU indicates it won't accept the U.S.'s Russia-Ukraine peace deal - NPR",
      "pubDate": "Thu, 20 Nov 2025 21:52:10 GMT"
    },
    {
      "title": "Why Europe and the U.S. Are Still Haggling on Trade - The New York Times",
      "pubDate": "Mon, 24 Nov 2025 15:00:06 GMT"
    },
    {
      "title": "Europeans sketch out plan B in race to raid Russian assets for Ukraine - politico.eu",
      "pubDate": "Wed, 26 Nov 2025 03:12:00 GMT"
    },
    {
      "title": "Belgium criticises EU proposal to use Russian frozen assets for Ukraine before its unveiling - Reuters",
      "pubDate": "Wed, 03 Dec 2025 09:32:53 GMT"
    }
  ],
  "Recession": [
    {
      "title": "Bessent says US housing market in 'recession' due to Federal Reserve interest rate policies - Forex Factory",
      "pubDate": "Wed, 05 Nov 2025 03:10:00 GMT"
    },
    {
      "title": "Bessent says shut down impact getting worse for economy, Hasset says recession possible - investingLive",
      "pubDate": "Sun, 09 Nov 2025 21:41:25 GMT"
    },
    {
      "title": "Shocking jobs data resets recession bets - Yahoo Finance",
      "pubDate": "Sun, 09 Nov 2025 18:47:00 GMT"
    },
    {
      "title": "A recession is ALREADY here for 23 states - laying bare the cracks in the US economy - Daily Mail",
      "pubDate": "Sat, 15 Nov 2025 20:18:24 GMT"
    },
    {
      "title": "The US isn't in a recession, but hiring is looking a lot like after the Great Recession - Business Insider",
      "pubDate": "Mon, 17 Nov 2025 09:30:00 GMT"
    },
    {
      "title": "All the signs that America may be teetering on the brink of recession - The Telegraph",
      "pubDate": "Fri, 21 Nov 2025 07:00:00 GMT"
    },
    {
      "title": "Mexico Economy Dipped Last Quarter, Fueling Recession Fears - Bloomberg.com",
      "pubDate": "Fri, 21 Nov 2025 15:14:53 GMT"
    },
    {
      "title": "China's fixed asset investment recession could be the start of a sea change, says expert - MSN",
      "pubDate": "Wed, 26 Nov 2025 09:12:54 GMT"
    },
    {
      "title": "US bankruptcies surge to 15-year high — Recession alarms flash as filings outpace 2020 crisis - The Economic Times",
      "pubDate": "Wed, 03 Dec 2025 19:18:45 GMT"
    }
  ],
  "Social Media": [
    {
      "title": "Denmark’s government aims to ban access to social media for children under 15 - AP News",
      "pubDate": "Fri, 07 Nov 2025 19:21:00 GMT"
    },
    {
      "title": "‘We’re basically pushers’: Court filing alleges staff at social media giants compared their platforms to drugs - Politico",
      "pubDate": "Sun, 23 Nov 2025 04:26:57 GMT"
    },
    {
      "title": "Australia says the world will follow social media ban as Meta starts blocking teens - Reuters",
      "pubDate": "Thu, 04 Dec 2025 04:42:44 GMT"
    },
    {
      "title": "Meta starts kicking Australian children off Instagram and Facebook - BBC",
      "pubDate": "Thu, 04 Dec 2025 06:00:44 GMT"
    }
  ],
  "Global Health": [
    {
      "title": "New COP30 report urges urgent action to protect health in a warming world - News-Medical",
      "pubDate": "Sat, 15 Nov 2025 02:39:00 GMT"
    },
    {
      "title": "Health Advisory for Tourists: Wild Polio Virus Found in Hamburg, Germany – A Wake-Up Call for Travelers to Germany, Afghanistan, and Pakistan - Travel And Tour World",
      "pubDate": "Sat, 15 Nov 2025 06:25:19 GMT"
    },
    {
      "title": "Marburg Virus Outbreak in Southern Ethiopia Sparks Global Health Response - Букви",
      "pubDate": "Sun, 16 Nov 2025 14:16:34 GMT"
    }
  ],
  "Astronomy": [
    {
      "title": "The James Webb Space Telescope may have finally found the 1st stars in the universe - Space",
      "pubDate": "Tue, 18 Nov 2025 20:00:00 GMT"
    },
    {
      "title": "Scientists Claim to Detect Dark Matter for the First Time Ever - Futurism",
      "pubDate": "Sat, 29 Nov 2025 11:00:00 GMT"
    }
  ],
  "Terrorism": [
    {
      "title": "Feds expand terrorism charges in July shooting at Texas immigration detention center - WRAL",
      "pubDate": "Sat, 15 Nov 2025 17:44:40 GMT"
    },
    {
      "title": "Terror plot arrests reveal ‘more dangerous’ online pathway to ISIS radicalization in America - CNN",
      "pubDate": "Sun, 16 Nov 2025 10:00:02 GMT"
    },
    {
      "title": "State Department to designate Venezuelan cartel as a foreign terrorist organization - CNN",
      "pubDate": "Mon, 17 Nov 2025 02:06:00 GMT"
    },
    {
      "title": "Man accused of setting woman on fire on Chicago train faces federal terrorism charge - NBC News",
      "pubDate": "Fri, 21 Nov 2025 02:43:00 GMT"
    },
    {
      "title": "AI Apps Like ChatGPT Have Created ‘New Era of Terrorism,’ Study Reveals - Algemeiner.com",
      "pubDate": "Tue, 25 Nov 2025 22:35:00 GMT"
    }
  ],
  "Investment": [
    {
      "title": "China’s Investment Crash Puzzles Economists and Threatens Growth - Bloomberg.com",
      "pubDate": "Sat, 15 Nov 2025 06:16:00 GMT"
    }
  ],
  "India": [
    {
      "title": "India Investigates Deadly Blast as Terrorism - The Wall Street Journal",
      "pubDate": "Tue, 11 Nov 2025 11:08:00 GMT"
    }
  ],
  "Energy Storage": [
    {
      "title": "EBRD Grants €22.3m To Power One To Build 36.8 MW Gas-Piston Plants And 31.5 MW Battery Storage To Boost Ukraine’s Energy Security Amid War Damage - SolarQuarter",
      "pubDate": "Mon, 17 Nov 2025 05:40:21 GMT"
    }
  ],
  "Amazon": [
    {
      "title": "Amazon recall: Threat-to-life warning issued, items pulled nationwide - AL.com",
      "pubDate": "Sat, 22 Nov 2025 19:32:00 GMT"
    }
  ],
  "US Senate": [
    {
      "title": "Senate holds rare Saturday session aimed at ending government shutdown, will reconvene Sunday - CBS News",
      "pubDate": "Sun, 09 Nov 2025 05:07:14 GMT"
    },
    {
      "title": "Democrats' bill would strip provision from funding bill that allowed senators to sue over phone records - abcnews.go.com",
      "pubDate": "Tue, 18 Nov 2025 10:22:09 GMT"
    }
  ],
  "Central Intelligence Agency": [
    {
      "title": "Colombian President says CIA wants to oust him - MercoPress",
      "pubDate": "Wed, 26 Nov 2025 09:27:00 GMT"
    },
    {
      "title": "D.C. Shooting Suspect Worked With CIA in Afghanistan - The Wall Street Journal",
      "pubDate": "Thu, 27 Nov 2025 21:46:00 GMT"
    }
  ],
  "Defense Intelligence Agency": [
    {
      "title": "Defense Intelligence Agency Warns of Imminent Nuclear Test - 조선일보",
      "pubDate": "Wed, 05 Nov 2025 05:15:00 GMT"
    },
    {
      "title": "Ukraine Defense Intelligence Exposes Japan, China, Taiwan Machines in Russian Weapons Production - UNITED24 Media",
      "pubDate": "Mon, 17 Nov 2025 10:38:04 GMT"
    }
  ],
  "United States": [
    {
      "title": "Last nuclear treaty between US and Russia nears expiration as Trump and Putin trade testing threats - CNN",
      "pubDate": "Sun, 16 Nov 2025 10:00:01 GMT"
    }
  ],
  "Vladimir Putin": [
    {
      "title": "Putin orders nuclear testing preparations after Trump's surprise shift - Axios",
      "pubDate": "Thu, 06 Nov 2025 08:20:31 GMT"
    },
    {
      "title": "Vladimir Putin did not order nuclear test, Russia reiterates - The Times of India",
      "pubDate": "Sun, 09 Nov 2025 16:02:00 GMT"
    },
    {
      "title": "Russia readies nuclear-capable Burevestnik missile, NATO sounds alarm - Euronews.com",
      "pubDate": "Sun, 16 Nov 2025 11:34:50 GMT"
    },
    {
      "title": "Putin ally Viktor Orban claims Ukraine has ‘no chance’ of winning war - The Independent",
      "pubDate": "Mon, 17 Nov 2025 10:53:00 GMT"
    }
  ],
  "GPUs": [
    {
      "title": "Tech war: Huawei bets on AI tech to squeeze more performance from GPUs - South China Morning Post",
      "pubDate": "Mon, 17 Nov 2025 06:00:15 GMT"
    },
    {
      "title": "Trump considers opening up exports of NVIDIA H200 GPUs to China, lawmakers say security risks to big - Cybernews",
      "pubDate": "Sat, 22 Nov 2025 00:45:00 GMT"
    }
  ],
  "Democracy": [
    {
      "title": "Biden says Trump has ‘taken a wrecking ball’ to democracy in sharp criticism - CNN",
      "pubDate": "Sat, 08 Nov 2025 05:28:13 GMT"
    }
  ],
  "Effects of Global Warming": [
    {
      "title": "Survey finds 40% of women without children hesitant to have kids due to climate crisis - Women's Agenda",
      "pubDate": "Mon, 10 Nov 2025 00:03:24 GMT"
    },
    {
      "title": "Climate Change Could Slash Global Income by 19% in 26 Years - Букви",
      "pubDate": "Thu, 04 Dec 2025 19:30:43 GMT"
    }
  ],
  "Earth's Magnetic Field": [
    {
      "title": "Something strange is happening to Earth’s magnetic field and it could spell doom for satellites, scientists warn - Yahoo",
      "pubDate": "Tue, 11 Nov 2025 09:56:44 GMT"
    }
  ],
  "US Politics & Government": [
    {
      "title": "Trump signs bill ending longest government shutdown in US history - Politico",
      "pubDate": "Thu, 13 Nov 2025 03:39:24 GMT"
    }
  ],
  "Global Energy & Environment": [
    {
      "title": "Iceland Labels Atlantic Current Collapse a National Security Threat - tovima.com",
      "pubDate": "Thu, 13 Nov 2025 11:03:45 GMT"
    }
  ],
  "Cybersecurity & National Security": [
    {
      "title": "CISA Flags Critical WatchGuard Fireware Flaw Exposing 54,000 Fireboxes to No-Login Attacks - The Hacker News",
      "pubDate": "Thu, 13 Nov 2025 07:23:00 GMT"
    }
  ],
  "Financial Markets & Economy": [
    {
      "title": "How markets could topple the global economy - The Economist",
      "pubDate": "Thu, 13 Nov 2025 11:35:17 GMT"
    }
  ],
  "United Nations Security Council": [
    {
      "title": "US draft at UN Security Council Includes 'Palestinian State' leading to Smotrich attack on Netanyahu - Ynetnews",
      "pubDate": "Sun, 16 Nov 2025 00:51:24 GMT"
    }
  ],
  "Net Zero Emissions": [
    {
      "title": "The climate crisis is expensive: net zero is cheaper for Australia than not doing more - The Guardian",
      "pubDate": "Sun, 16 Nov 2025 21:57:00 GMT"
    }
  ],
  "Political Corruption": [
    {
      "title": "Mexico City Joins Michoacan, Puebla, Sinaloa, Jalisco, Oaxaca and More in Escalating Protests Against Government Corruption and Public Insecurity Significantly Impacting Tourists and Shaking Mexico’s Travel Industry - Travel And Tour World",
      "pubDate": "Mon, 17 Nov 2025 04:55:30 GMT"
    }
  ],
  "Privacy": [
    {
      "title": "Senators’ surveillance payday exposes flawed privacy laws - The Hill",
      "pubDate": "Sun, 16 Nov 2025 19:00:00 GMT"
    },
    {
      "title": "EU's \"Chat Control\" Moves Forward Despite Privacy Concerns: What 450 Million Europeans Need to Know - Brave New Coin",
      "pubDate": "Thu, 27 Nov 2025 22:09:23 GMT"
    }
  ],
  "Rain Forests": [
    {
      "title": "Australia's rainforests releasing more CO2 than they absorb: Study | This could worsen global warming significantly | Inshorts - Inshorts",
      "pubDate": "Mon, 17 Nov 2025 05:13:53 GMT"
    }
  ],
  "Mars": [
    {
      "title": "Scientist Say They’ve Found Caves on Mars That May Contain Life - Futurism",
      "pubDate": "Mon, 17 Nov 2025 14:26:05 GMT"
    }
  ],
  "Space Exploration": [
    {
      "title": "Secretive SpaceX satellites operated by US government are shooting disruptive radio signals into space, astronomer accidentally discovers - Live Science",
      "pubDate": "Tue, 18 Nov 2025 16:30:01 GMT"
    }
  ],
  "Google": [
    {
      "title": "Google launches Gemini 3, embeds AI model into search immediately - Reuters",
      "pubDate": "Tue, 18 Nov 2025 18:21:12 GMT"
    },
    {
      "title": "How Google Finally Leapfrogged Rivals With New Gemini Rollout - The Wall Street Journal",
      "pubDate": "Sat, 22 Nov 2025 10:30:00 GMT"
    }
  ],
  "Democratic Party": [
    {
      "title": "Democratic Lawmakers Tell Military to Refuse Illegal Orders - The New York Times",
      "pubDate": "Wed, 19 Nov 2025 01:14:50 GMT"
    }
  ],
  "Finance": [
    {
      "title": "'Bond King' Jeffrey Gundlach warns of the next financial crisis: 'It has the same trappings as subprime mortgage repackaging in 2006' - Fortune",
      "pubDate": "Tue, 18 Nov 2025 20:18:00 GMT"
    }
  ],
  "Mark Zuckerberg": [
    {
      "title": "Mark Zuckerberg's hate-speech gamble fuels Gen Z radicalization on Instagram as millions watch Hitler speeches and Holocaust denial - Fortune",
      "pubDate": "Thu, 20 Nov 2025 11:00:00 GMT"
    }
  ],
  "Cryptocurrency": [
    {
      "title": "Cryptocurrency backed by Farage donor is used for Russian war effort, investigators say - The Guardian",
      "pubDate": "Fri, 21 Nov 2025 05:00:00 GMT"
    }
  ],
  "Intelligence Agencies": [
    {
      "title": "Mossad–European intelligence operation launches sweeping crackdown on Hamas global terror network - wfiwradio.com",
      "pubDate": "Fri, 21 Nov 2025 01:12:40 GMT"
    }
  ],
  "Republican Party": [
    {
      "title": "Marjorie Taylor Greene to quit Congress after Trump feud - BBC",
      "pubDate": "Sat, 22 Nov 2025 04:12:35 GMT"
    }
  ],
  "Outer Space": [
    {
      "title": "Space junk strike on China's astronaut capsule highlights need for a space rescue service, experts say - Space",
      "pubDate": "Sat, 22 Nov 2025 14:00:00 GMT"
    }
  ],
  "Planetary Defense": [
    {
      "title": "🚨🇯🇵 THE NEXT FRONTIER OF PLANETARY DEFENSE: AN 11-METER ASTEROID SPINNING LIKE A FRISBEE Japan's Hayabusa2 just got a 2031 mission upgrade - straight into a sci-fi nightmare. New data from ESO's VLT shows its final target, asteroid 19 - x.com",
      "pubDate": "Sun, 23 Nov 2025 00:10:00 GMT"
    }
  ],
  "Machine Learning": [
    {
      "title": "AI quake tools forecast aftershock risk in seconds, study shows - Phys.org",
      "pubDate": "Tue, 25 Nov 2025 04:00:05 GMT"
    }
  ],
  "Computers": [
    {
      "title": "Argonne partnering with Nvidia, Oracle to create super AI computer - CBS News",
      "pubDate": "Wed, 26 Nov 2025 00:35:00 GMT"
    }
  ],
  "Violence": [
    {
      "title": "Violence Is Driving Catastrophic Hunger in Nigeria, U.N. Report Says - The New York Times",
      "pubDate": "Wed, 26 Nov 2025 09:00:00 GMT"
    }
  ],
  "Physics": [
    {
      "title": "Physicists Observe a Nuclear “Memory” Thought Impossible - SciTechDaily",
      "pubDate": "Wed, 26 Nov 2025 00:10:19 GMT"
    }
  ],
  "Income Tax in the United States": [
    {
      "title": "Trump says he may cut income tax 'completely' because of tariff income - Reuters",
      "pubDate": "Fri, 28 Nov 2025 04:33:00 GMT"
    }
  ],
  "Software": [
    {
      "title": "Solar flare vulnerability in A320 software forces emergency action by airlines - The Air Current",
      "pubDate": "Fri, 28 Nov 2025 18:45:07 GMT"
    }
  ],
  "NASA": [
    {
      "title": "Newly Found Organics in Enceladus’ Plumes - NASA (.gov)",
      "pubDate": "Fri, 28 Nov 2025 18:25:01 GMT"
    }
  ],
  "SpaceX": [
    {
      "title": "SPACEX HIT 512,440 KG TO ORBIT: 83% OF THE ENTIRE WORLD'S LAUNCH MASS The Q3 2025 launch report is out and it's a bloodbath. SpaceX alone launched 512 tons to orbit. That's more than the next 15 providers COMBINED. U.S. share: 97% Space - x.com",
      "pubDate": "Sat, 29 Nov 2025 03:45:00 GMT"
    }
  ],
  "World Economy": [
    {
      "title": "America’s Tariffs Jolted the Global Economy. Its AI Spending Is Helping Save It. - The Wall Street Journal",
      "pubDate": "Mon, 01 Dec 2025 04:00:00 GMT"
    }
  ],
  "Infrastructure": [
    {
      "title": "Ukraine carries out record attacks on Russian energy infrastructure - https-//www.semafor.com",
      "pubDate": "Tue, 02 Dec 2025 13:23:00 GMT"
    }
  ],
  "United Nations": [
    {
      "title": "AI threatens to widen inequality among states: UN - Al Jazeera",
      "pubDate": "Tue, 02 Dec 2025 13:18:45 GMT"
    }
  ],
  "Apple": [
    {
      "title": "Exclusive: Apple to resist India order to preload state-run app as political outcry builds - Reuters",
      "pubDate": "Tue, 02 Dec 2025 15:28:08 GMT"
    }
  ],
  "Renewable Energy": [
    {
      "title": "‘Renewable’ No More: The Trump Administration Renames the National Renewable Energy Laboratory - Inside Climate News",
      "pubDate": "Tue, 02 Dec 2025 13:21:45 GMT"
    }
  ],
  "Supply Chain": [
    {
      "title": "The AI frenzy is driving a new global supply chain crisis - Yahoo Finance",
      "pubDate": "Wed, 03 Dec 2025 02:01:00 GMT"
    }
  ],
  "Human Brain": [
    {
      "title": "While AI revolutionizes the world, the human brain rots - Genetic Literacy Project",
      "pubDate": "Wed, 03 Dec 2025 05:11:09 GMT"
    }
  ],
  "Quantum Computing": [
    {
      "title": "Nobel Winner Warns China Is ‘Nanoseconds’ Behind in Quantum Race - Bloomberg.com",
      "pubDate": "Wed, 03 Dec 2025 11:34:49 GMT"
    }
  ],
  "Nuclear Power": [
    {
      "title": "South Korea Says the U.S. Agreed to Help It Secure Fuel for Its Reactors - The New York Times",
      "pubDate": "Wed, 03 Dec 2025 13:06:40 GMT"
    }
  ],
  "Climate Engineering": [
    {
      "title": "Private companies have raised millions to block the sun. What could go wrong? - The Washington Post",
      "pubDate": "Wed, 03 Dec 2025 18:00:11 GMT"
    }
  ],
  "Nuclear Fission": [
    {
      "title": "Kansas will get the world’s first mile-deep nuclear reactor and the groundbreaking is next week - KCUR",
      "pubDate": "Thu, 04 Dec 2025 12:03:59 GMT"
    }
  ]
}