{
  "Artificial Intelligence": [
    {
      "title": "Are we in an AI bubble? What 40 tech leaders and analysts are saying, in one chart - CNBC",
      "pubDate": "Sat, 10 Jan 2026 13:00:01 GMT"
    },
    {
      "title": "New Mexico should lead on artificial intelligence — the stakes are too high - Santa Fe New Mexican",
      "pubDate": "Sun, 11 Jan 2026 04:00:00 GMT"
    },
    {
      "title": "How artificial intelligence is reshaping the future of war - The Hill",
      "pubDate": "Sun, 11 Jan 2026 12:10:00 GMT"
    },
    {
      "title": "Trump Administration Wants to Achieve ‘Pax Silica’ Through AI. Here’s What That Means - Gizmodo",
      "pubDate": "Sun, 11 Jan 2026 22:14:40 GMT"
    },
    {
      "title": "Apple Teams Up With Google for A.I. in Its Products - The New York Times",
      "pubDate": "Mon, 12 Jan 2026 20:09:59 GMT"
    },
    {
      "title": "Microsoft warns that China is winning AI race outside the west - Financial Times",
      "pubDate": "Tue, 13 Jan 2026 05:00:19 GMT"
    },
    {
      "title": "Pentagon rolls out major reforms of R&D, AI - Breaking Defense",
      "pubDate": "Tue, 13 Jan 2026 18:40:36 GMT"
    },
    {
      "title": "West Midlands police chief apologises after AI error used to justify Maccabi Tel Aviv ban - The Guardian",
      "pubDate": "Wed, 14 Jan 2026 09:56:00 GMT"
    },
    {
      "title": "Artificial intelligence: Council paves the way for the creation of AI gigafactories - consilium.europa.eu",
      "pubDate": "Fri, 16 Jan 2026 12:06:42 GMT"
    },
    {
      "title": "‘We could hit a wall’: why trillions of dollars of risk is no guarantee of AI reward - The Guardian",
      "pubDate": "Sat, 17 Jan 2026 12:02:00 GMT"
    },
    {
      "title": "AI raises average wages by 21% and substantially reduces' wage inequality, researchers find - Fox Business",
      "pubDate": "Sat, 17 Jan 2026 18:02:00 GMT"
    },
    {
      "title": "EPA pokes Musk over using unpermitted turbines for AI - Politico",
      "pubDate": "Thu, 22 Jan 2026 17:00:00 GMT"
    },
    {
      "title": "AI is already writing almost one-third of new software code - EurekAlert!",
      "pubDate": "Thu, 22 Jan 2026 19:13:45 GMT"
    },
    {
      "title": "Government by AI? Trump Administration Plans to Write Regulations Using Artificial Intelligence - ProPublica",
      "pubDate": "Mon, 26 Jan 2026 10:30:00 GMT"
    },
    {
      "title": "European Union opens investigation into Elon Musk's AI chatbot Grok over sexual deepfakes - CBS News",
      "pubDate": "Mon, 26 Jan 2026 22:51:00 GMT"
    },
    {
      "title": "Microsoft Pledged to Save Water. In the A.I. Era, It Expects Water Use to Soar. - The New York Times",
      "pubDate": "Tue, 27 Jan 2026 16:29:55 GMT"
    },
    {
      "title": "Artificial intelligence will cost jobs, admits Liz Kendall - The Guardian",
      "pubDate": "Wed, 28 Jan 2026 18:33:00 GMT"
    },
    {
      "title": "Exclusive: China conditionally approves DeepSeek to buy Nvidia's H200 chips - sources - Reuters",
      "pubDate": "Fri, 30 Jan 2026 06:51:00 GMT"
    },
    {
      "title": "Trump’s AI push exposes a divide in the MAGA movement - CNN",
      "pubDate": "Mon, 02 Feb 2026 10:00:46 GMT"
    },
    {
      "title": "Elon Musk Merges SpaceX With His A.I. Start-Up xAI - The New York Times",
      "pubDate": "Mon, 02 Feb 2026 21:52:06 GMT"
    },
    {
      "title": "Opinion | Where Is A.I. Taking Us? Eight Leading Thinkers Share Their Visions. - The New York Times",
      "pubDate": "Tue, 03 Feb 2026 11:33:01 GMT"
    },
    {
      "title": "More companies are pointing to AI as they lay off employees - CBS News",
      "pubDate": "Tue, 03 Feb 2026 22:44:00 GMT"
    },
    {
      "title": "Global software stocks hit by Anthropic wake-up call on AI disruption - Reuters",
      "pubDate": "Wed, 04 Feb 2026 09:56:02 GMT"
    },
    {
      "title": "Google parent beats on revenue, projects significant AI spending increase - CNBC",
      "pubDate": "Wed, 04 Feb 2026 17:00:01 GMT"
    },
    {
      "title": "Labor unions urge Gov. Gavin Newsom, California lawmakers to rein in artificial intelligence - Yahoo",
      "pubDate": "Thu, 05 Feb 2026 02:21:00 GMT"
    },
    {
      "title": "China warns of security risks linked to OpenClaw open-source AI agent - Reuters",
      "pubDate": "Thu, 05 Feb 2026 09:43:07 GMT"
    },
    {
      "title": "Artificial Intelligence Task Force to guide responsible use of emerging technology - Marquette Today",
      "pubDate": "Thu, 05 Feb 2026 20:21:40 GMT"
    },
    {
      "title": "Kaiser workers launch war against AI, protesting potential job losses and patient harm - latimes.com",
      "pubDate": "Fri, 06 Feb 2026 11:00:00 GMT"
    },
    {
      "title": "Big Tech's $600 billion spending plans exacerbate investors' AI headache - Reuters",
      "pubDate": "Fri, 06 Feb 2026 10:49:48 GMT"
    },
    {
      "title": "The AI boom is so huge it’s causing shortages everywhere else - The Washington Post",
      "pubDate": "Sat, 07 Feb 2026 18:00:00 GMT"
    },
    {
      "title": "US companies accused of ‘AI washing’ in citing artificial intelligence for job losses - The Guardian",
      "pubDate": "Sun, 08 Feb 2026 16:03:00 GMT"
    }
  ],
  "Israel": [
    {
      "title": "IDF has demolished over 2,500 buildings in Gaza since start of ceasefire – report - The Times of Israel",
      "pubDate": "Mon, 12 Jan 2026 22:03:10 GMT"
    },
    {
      "title": "Israel far-right ministers reject US-backed postwar Gaza panel - The Guardian",
      "pubDate": "Sun, 18 Jan 2026 15:17:00 GMT"
    },
    {
      "title": "Israel to ban MSF from working in Gaza over refusal to provide staff list - BBC",
      "pubDate": "Sun, 01 Feb 2026 13:20:38 GMT"
    }
  ],
  "Ukraine": [
    {
      "title": "Russia hits Ukraine with Oreshnik hypersonic missile: Why it matters - Al Jazeera",
      "pubDate": "Sat, 10 Jan 2026 12:52:33 GMT"
    },
    {
      "title": "Inside Ukraine’s Quest to Build a Missile to Strike Deep in Russian Territory - The Wall Street Journal",
      "pubDate": "Sun, 11 Jan 2026 03:00:00 GMT"
    },
    {
      "title": "US slams Russia’s ‘dangerous escalation’ in Ukraine amid new deadly strikes - Al Jazeera",
      "pubDate": "Tue, 13 Jan 2026 04:19:20 GMT"
    },
    {
      "title": "A Russian city gets a taste of the cold devastation to Ukraine’s power grid - The Washington Post",
      "pubDate": "Wed, 14 Jan 2026 11:32:09 GMT"
    },
    {
      "title": "Ukraine’s new defense chief reveals 200,000 soldiers have gone AWOL and 2 million are dodging draft - CNN",
      "pubDate": "Wed, 14 Jan 2026 16:39:52 GMT"
    },
    {
      "title": "Zelensky declares state of emergency in Ukraine's energy sector - BBC",
      "pubDate": "Thu, 15 Jan 2026 03:35:12 GMT"
    },
    {
      "title": "Ukrainian battlefield success denies Russia a key city as a bargaining chip - The Washington Post",
      "pubDate": "Mon, 19 Jan 2026 17:31:57 GMT"
    },
    {
      "title": "Ukraine peace deal hinges on territory, Kremlin says after US talks - Euronews.com",
      "pubDate": "Fri, 23 Jan 2026 04:45:03 GMT"
    },
    {
      "title": "Document reveals EU-US pitch for $800B postwar Ukraine ‘prosperity’ plan - politico.eu",
      "pubDate": "Fri, 23 Jan 2026 13:39:00 GMT"
    },
    {
      "title": "US security agreement for Ukraine is ‘100% ready’ to be signed, Zelenskyy says - AP News",
      "pubDate": "Sun, 25 Jan 2026 17:16:00 GMT"
    },
    {
      "title": "Ukraine Says It Attacked Small Oil Refinery in Southern Russia - Bloomberg",
      "pubDate": "Mon, 26 Jan 2026 11:37:55 GMT"
    },
    {
      "title": "US links security guarantees for Ukraine to peace deal ceding territory - Financial Times",
      "pubDate": "Tue, 27 Jan 2026 05:00:17 GMT"
    },
    {
      "title": "Russian drones kill 1 and injure children in Ukraine as Zelenskyy urges speedier diplomacy - ABC News",
      "pubDate": "Tue, 27 Jan 2026 13:10:18 GMT"
    },
    {
      "title": "Russian air attack kills two in Kyiv region, Ukraine says - Reuters",
      "pubDate": "Wed, 28 Jan 2026 07:45:00 GMT"
    },
    {
      "title": "Russia says it's ready for Zelensky-Putin meeting — but only if Ukraine's president travels to Moscow - kyivindependent.com",
      "pubDate": "Wed, 28 Jan 2026 13:47:03 GMT"
    },
    {
      "title": "Confusion in Kyiv and Moscow after Trump says Putin agreed to pause attacks for a week - NBC News",
      "pubDate": "Fri, 30 Jan 2026 17:02:05 GMT"
    },
    {
      "title": "Twelve miners killed by Russian strike in Ukraine, officials say - BBC",
      "pubDate": "Mon, 02 Feb 2026 07:00:55 GMT"
    },
    {
      "title": "Kenyan job seekers were lured to Russia, then sent to die in Ukraine - The Washington Post",
      "pubDate": "Mon, 02 Feb 2026 18:00:34 GMT"
    },
    {
      "title": "Thousands without heating on icy night in Ukraine as Russia attacks before talks - The Guardian",
      "pubDate": "Tue, 03 Feb 2026 11:32:00 GMT"
    },
    {
      "title": "Russia-Ukraine Peace Talks Stretch Into a Second Day - The New York Times",
      "pubDate": "Thu, 05 Feb 2026 09:10:22 GMT"
    },
    {
      "title": "At Ukraine’s Request, Starlink Denies Internet Access to Russian Troops - The New York Times",
      "pubDate": "Thu, 05 Feb 2026 21:55:26 GMT"
    }
  ],
  "Russia": [
    {
      "title": "Russia Says It Used Nuclear-Capable Missile to Strike Western Ukraine - The New York Times",
      "pubDate": "Fri, 09 Jan 2026 19:59:00 GMT"
    },
    {
      "title": "Governor of Russia's Belgorod region says 600,000 without power, heat, or water after Ukrainian strike - Reuters",
      "pubDate": "Sat, 10 Jan 2026 10:07:35 GMT"
    },
    {
      "title": "A Russian Videographer Reveals How Putin Shapes the Next Generation - The New York Times",
      "pubDate": "Sun, 11 Jan 2026 10:01:06 GMT"
    },
    {
      "title": "Russian Missiles Failed in Venezuela During U.S. Attack - The New York Times",
      "pubDate": "Mon, 12 Jan 2026 10:02:25 GMT"
    },
    {
      "title": "Russia's 'massive' losses in Ukraine have it heading toward a breaking point, NATO's top official says - Business Insider",
      "pubDate": "Wed, 14 Jan 2026 15:11:00 GMT"
    },
    {
      "title": "Russia Knocks Out the Heat in Ukraine - The New York Times",
      "pubDate": "Thu, 15 Jan 2026 10:28:22 GMT"
    },
    {
      "title": "Ukrainian delegation arrives in US for peace talks as Russia hammers energy sites - ABC News",
      "pubDate": "Sat, 17 Jan 2026 12:17:39 GMT"
    },
    {
      "title": "Russia hits energy system in several regions of Ukraine, Kyiv says - Reuters",
      "pubDate": "Mon, 19 Jan 2026 15:50:11 GMT"
    },
    {
      "title": "Updates: First day of trilateral talks on Russia-Ukraine war ends in UAE - Al Jazeera",
      "pubDate": "Fri, 23 Jan 2026 21:11:15 GMT"
    },
    {
      "title": "Russia using Interpol's wanted list to target critics abroad, leak reveals - BBC",
      "pubDate": "Mon, 26 Jan 2026 00:15:03 GMT"
    },
    {
      "title": "Troop Casualties in Ukraine War Near 2 Million, Study Finds - The New York Times",
      "pubDate": "Tue, 27 Jan 2026 17:54:11 GMT"
    },
    {
      "title": "Al-Sharaa meets Putin as Russia seeks to secure military bases in Syria - Al Jazeera",
      "pubDate": "Wed, 28 Jan 2026 16:30:13 GMT"
    },
    {
      "title": "15 Ukrainian miners killed in Russian drone strike on bus - CNN",
      "pubDate": "Sun, 01 Feb 2026 16:46:35 GMT"
    },
    {
      "title": "Russian hits Ukraine energy sites in 'most powerful blow\" so far this year - BBC",
      "pubDate": "Tue, 03 Feb 2026 13:17:53 GMT"
    },
    {
      "title": "Russia: Crackdown on Dissent Escalates - Human Rights Watch",
      "pubDate": "Wed, 04 Feb 2026 05:01:00 GMT"
    },
    {
      "title": "Sanctions having ‘significant impact’ on Russian economy, says EU special envoy - The Guardian",
      "pubDate": "Thu, 05 Feb 2026 05:00:00 GMT"
    },
    {
      "title": "As West goes after Russia’s oil fleet, Moscow fears for its war funding - The Washington Post",
      "pubDate": "Thu, 05 Feb 2026 11:32:09 GMT"
    },
    {
      "title": "Scoop: U.S. and Russia agree to observe New START nuclear pact after expiration - Axios",
      "pubDate": "Thu, 05 Feb 2026 18:45:00 GMT"
    },
    {
      "title": "US wants Russia and Ukraine to end war by June, says Zelensky - BBC",
      "pubDate": "Sat, 07 Feb 2026 14:05:01 GMT"
    }
  ],
  "Donald Trump": [
    {
      "title": "Trump says US will 'do something on Greenland whether they like it or not' - NBC News",
      "pubDate": "Fri, 09 Jan 2026 23:15:54 GMT"
    },
    {
      "title": "Smithsonian removes Trump impeachment text as it swaps his portrait - The Washington Post",
      "pubDate": "Sun, 11 Jan 2026 06:26:11 GMT"
    },
    {
      "title": "Trump weighs potential military intervention in Iran - CNN",
      "pubDate": "Sun, 11 Jan 2026 15:46:29 GMT"
    },
    {
      "title": "Live updates: More than 2,400 protesters killed in Iran as Trump warns against executions - CNN",
      "pubDate": "Thu, 15 Jan 2026 05:20:00 GMT"
    },
    {
      "title": "Trump would want military action in Iran to be swift and decisive, sources say - NBC News",
      "pubDate": "Thu, 15 Jan 2026 00:49:00 GMT"
    },
    {
      "title": "Trump Live Updates: U.S. Seizes 6th Oil Tanker Tied to Venezuela - The New York Times",
      "pubDate": "Thu, 15 Jan 2026 17:50:19 GMT"
    },
    {
      "title": "Trump Moves to Make Tech Giants Pay for Surging Power Costs - Bloomberg.com",
      "pubDate": "Fri, 16 Jan 2026 02:33:00 GMT"
    },
    {
      "title": "Trump threatens to invoke Insurrection Act to quell anti-ICE protests in Minnesota - BBC",
      "pubDate": "Fri, 16 Jan 2026 01:32:41 GMT"
    },
    {
      "title": "Trump announces 10% tariff on eight European countries until there is a deal to buy Greenland - NBC News",
      "pubDate": "Sat, 17 Jan 2026 20:23:55 GMT"
    },
    {
      "title": "After U.S. Reignites a Trade War Over Greenland, Europe Weighs Going All-Out - The New York Times",
      "pubDate": "Sun, 18 Jan 2026 11:08:12 GMT"
    },
    {
      "title": "January 18, 2026 — Trump administration news, EU ambassadors hold emergency meeting over Greenland - CNN",
      "pubDate": "Mon, 19 Jan 2026 01:34:00 GMT"
    },
    {
      "title": "Trump Is Pushing the U.S.-Europe Alliance to the Brink Over Greenland - The New York Times",
      "pubDate": "Mon, 19 Jan 2026 18:38:32 GMT"
    },
    {
      "title": "Trump sues JPMorgan Chase and CEO Jamie Dimon for $5B over alleged 'political' debanking - Fox Business",
      "pubDate": "Thu, 22 Jan 2026 16:49:00 GMT"
    },
    {
      "title": "Live updates: Trump meets with Zelensky after unveiling ‘Board of Peace’ in Davos | CNN Politics - CNN",
      "pubDate": "Fri, 23 Jan 2026 05:04:00 GMT"
    },
    {
      "title": "Justice Department investigating a growing number of Trump political foes - NBC News",
      "pubDate": "Sat, 24 Jan 2026 10:23:00 GMT"
    },
    {
      "title": "Trump says government will 'de-escalate' in Minnesota following Pretti shooting - BBC",
      "pubDate": "Wed, 28 Jan 2026 05:38:48 GMT"
    },
    {
      "title": "Trump Live Updates: Rubio Testifies on Venezuela, President Threatens Iran - The New York Times",
      "pubDate": "Wed, 28 Jan 2026 23:40:10 GMT"
    },
    {
      "title": "Updates: Trump doubles down on Iran threats as US puts more sanctions - Al Jazeera",
      "pubDate": "Fri, 30 Jan 2026 20:32:18 GMT"
    },
    {
      "title": "Trump taps Fed critic Kevin Warsh to succeed Jerome Powell as chairman - The Washington Post",
      "pubDate": "Sat, 31 Jan 2026 00:51:40 GMT"
    },
    {
      "title": "After Republicans push Clintons to testify on Epstein, Democrats warn they'll haul in Trump - NBC News",
      "pubDate": "Tue, 03 Feb 2026 21:05:00 GMT"
    },
    {
      "title": "Trump says America should move on from Epstein - it may not be that easy - BBC",
      "pubDate": "Thu, 05 Feb 2026 03:27:44 GMT"
    },
    {
      "title": "Revealed: private jet owned by Trump friend used by ICE to deport Palestinians to West Bank - The Guardian",
      "pubDate": "Thu, 05 Feb 2026 17:32:00 GMT"
    },
    {
      "title": "Trump imposes tariffs on countries that import from Iran as nuclear talks resume - The Times of Israel",
      "pubDate": "Fri, 06 Feb 2026 23:13:00 GMT"
    },
    {
      "title": "‘I Didn’t Make a Mistake’: Trump Declines to Apologize for Racist Video of Obamas - The New York Times",
      "pubDate": "Sat, 07 Feb 2026 16:23:00 GMT"
    }
  ],
  "China": [
    {
      "title": "China is closing in on US technology lead despite constraints, AI researchers say - Reuters",
      "pubDate": "Sat, 10 Jan 2026 15:43:28 GMT"
    },
    {
      "title": "How China and Russia are using Maduro’s capture to sway U.S. discourse - The Washington Post",
      "pubDate": "Sat, 10 Jan 2026 18:00:38 GMT"
    },
    {
      "title": "With Venezuela raid, US tells China to keep away from the Americas - Reuters",
      "pubDate": "Sun, 11 Jan 2026 13:08:56 GMT"
    },
    {
      "title": "Foreign investment: China overtakes the United States - Table.Briefings",
      "pubDate": "Mon, 12 Jan 2026 21:58:05 GMT"
    },
    {
      "title": "China Announces Record Trade Surplus as Its Exports Flood World Markets - The New York Times",
      "pubDate": "Wed, 14 Jan 2026 05:57:14 GMT"
    },
    {
      "title": "Trump administration clears way for Nvidia H200 chip sales to China with a 25% surcharge - CNBC",
      "pubDate": "Wed, 14 Jan 2026 21:38:01 GMT"
    },
    {
      "title": "Canada Strikes Tariffs Deal With China, as Carney Looks to Diversify From U.S. - The New York Times",
      "pubDate": "Fri, 16 Jan 2026 15:26:56 GMT"
    },
    {
      "title": "China flies drone into Taiwan’s airspace for first time - Financial Times",
      "pubDate": "Sat, 17 Jan 2026 14:58:46 GMT"
    },
    {
      "title": "China Tells Alibaba, Tech Firms to Ready Nvidia H200 Orders - Bloomberg",
      "pubDate": "Fri, 23 Jan 2026 14:40:52 GMT"
    },
    {
      "title": "Exclusive | China’s Top General Accused of Giving Nuclear Secrets to U.S. - The Wall Street Journal",
      "pubDate": "Sun, 25 Jan 2026 17:05:00 GMT"
    },
    {
      "title": "Exclusive: China gives nod to ByteDance, Alibaba and Tencent to buy Nvidia's H200 chips - sources - Reuters",
      "pubDate": "Wed, 28 Jan 2026 08:46:26 GMT"
    },
    {
      "title": "Trump’s Embrace of Weaker Dollar Gives China an Opening - Bloomberg.com",
      "pubDate": "Mon, 02 Feb 2026 10:59:02 GMT"
    },
    {
      "title": "Trump to Launch $12 Billion Critical Mineral Stockpile to Blunt Reliance on China - Bloomberg",
      "pubDate": "Mon, 02 Feb 2026 13:16:27 GMT"
    },
    {
      "title": "U.S. accuses China of secret nuclear testing as it calls for broad new arms treaty after New START - NBC News",
      "pubDate": "Fri, 06 Feb 2026 14:21:45 GMT"
    }
  ],
  "AI Safety": [
    {
      "title": "OpenAI and Common Sense Media Partner on New Kids AI Safety Ballot Measure - KQED",
      "pubDate": "Sat, 10 Jan 2026 00:36:03 GMT"
    },
    {
      "title": "UK to investigate Elon Musk’s Grok over ‘deeply concerning’ deepfakes - Al Jazeera",
      "pubDate": "Mon, 12 Jan 2026 18:38:46 GMT"
    },
    {
      "title": "White House holds back on national AI framework specifics - Roll Call",
      "pubDate": "Wed, 14 Jan 2026 21:04:12 GMT"
    },
    {
      "title": "FDA’s AI Policy Shift Highlights Urgent Need for AI Safety Research - filmogaz.com",
      "pubDate": "Fri, 16 Jan 2026 13:20:45 GMT"
    },
    {
      "title": "Teen Dies from Overdose After ChatGPT Drug Advice, Sparking AI Regulation Calls - WebProNews",
      "pubDate": "Sun, 18 Jan 2026 12:10:30 GMT"
    },
    {
      "title": "Korea sets AI safety rules, first in world - koreaherald.com",
      "pubDate": "Wed, 21 Jan 2026 03:00:00 GMT"
    },
    {
      "title": "Meta tightens teens access to AI characters amid safety concerns - The News International",
      "pubDate": "Sat, 24 Jan 2026 08:20:00 GMT"
    },
    {
      "title": "AI 'Swarms' Could Escalate Online Misinformation and Manipulation, Researchers Warn - Decrypt",
      "pubDate": "Sun, 25 Jan 2026 20:01:02 GMT"
    },
    {
      "title": "South Korea Enacts Global Milestone Of AI Safety Laws Including Covering Mental Health Impacts - Forbes",
      "pubDate": "Fri, 30 Jan 2026 08:15:00 GMT"
    },
    {
      "title": "NIOSH Issues Guidance on Managing AI Safety Risks in the Workplace - Lab Manager",
      "pubDate": "Fri, 30 Jan 2026 13:01:06 GMT"
    },
    {
      "title": "AI Chatbots Named Top Health Tech Danger for 2026, Safety Group Warns - MyChesCo",
      "pubDate": "Sat, 31 Jan 2026 01:00:00 GMT"
    },
    {
      "title": "U.S. Withholds Support From Global AI Safety Report - AOL.com",
      "pubDate": "Tue, 03 Feb 2026 05:30:19 GMT"
    },
    {
      "title": "AI Safety Tests Are Failing: 210 Benchmarks Reveal Critical Flaws - Quantum Zeitgeist",
      "pubDate": "Thu, 05 Feb 2026 00:40:25 GMT"
    },
    {
      "title": "New York Enacts RAISE Act, Setting Nation-Leading Rules for Frontier AI Safety - CDO Magazine",
      "pubDate": "Fri, 06 Feb 2026 13:28:00 GMT"
    },
    {
      "title": "California ballot proposal looking to create AI Safety Commission cleared for signature gathering - ABC10",
      "pubDate": "Fri, 06 Feb 2026 20:41:00 GMT"
    },
    {
      "title": "New York CEO Dan Herbatschek of Ramsey Theory Capital Delivers New Real-Time Governance for Enterprise AI Systems as AI Safety Laws Accelerate - The Manila Times",
      "pubDate": "Sat, 07 Feb 2026 16:51:05 GMT"
    }
  ],
  "Data Breach": [
    {
      "title": "Second health provider, Canopy Health, hit in major cyber attack - RNZ",
      "pubDate": "Mon, 12 Jan 2026 00:25:04 GMT"
    },
    {
      "title": "Kaiser Permanente to pay $46 million in privacy data breach settlement. Here's how to file a claim. - CBS News",
      "pubDate": "Mon, 12 Jan 2026 23:20:00 GMT"
    },
    {
      "title": "Personal Details of Thousands of Border Patrol and ICE Goons Allegedly Leaked in Huge Data Breach - The Daily Beast",
      "pubDate": "Tue, 13 Jan 2026 18:25:00 GMT"
    },
    {
      "title": "149 million passwords for Gmail, Facebook, Instagram and other popular services exposed online — how to stay safe after this major leak - Tom's Guide",
      "pubDate": "Sat, 24 Jan 2026 02:32:26 GMT"
    },
    {
      "title": "Massive Chinese data breach allegedly spills 8.7 billion records - here's what we know - TechRadar",
      "pubDate": "Wed, 04 Feb 2026 19:35:00 GMT"
    },
    {
      "title": "SoundCloud data breach exposes 29.8 million user accounts - foxnews.com",
      "pubDate": "Sun, 08 Feb 2026 14:01:15 GMT"
    }
  ],
  "Cybersecurity": [
    {
      "title": "House Hearing to Focus on Bills to Bolster Energy Sector Cybersecurity (Jan 9, 2026) - VitalLaw.com",
      "pubDate": "Sat, 10 Jan 2026 02:32:18 GMT"
    },
    {
      "title": "An Instagram data breach reportedly exposed the personal info of 17.5 million users - Engadget",
      "pubDate": "Sat, 10 Jan 2026 19:21:05 GMT"
    },
    {
      "title": "Exclusive: Beijing tells Chinese firms to stop using US and Israeli cybersecurity software, sources say - Reuters",
      "pubDate": "Wed, 14 Jan 2026 11:09:45 GMT"
    },
    {
      "title": "CrashFix Chrome Extension Delivers ModeloRAT Using ClickFix-Style Browser Crash Lures - The Hacker News",
      "pubDate": "Mon, 19 Jan 2026 09:09:00 GMT"
    },
    {
      "title": "Google Gemini Prompt Injection Flaw Exposed Private Calendar Data via Malicious Invites - The Hacker News",
      "pubDate": "Mon, 19 Jan 2026 17:21:00 GMT"
    },
    {
      "title": "EU plans cybersecurity overhaul to block foreign high-risk suppliers - BleepingComputer",
      "pubDate": "Tue, 20 Jan 2026 18:54:38 GMT"
    },
    {
      "title": "AI-driven cyber war is near, Israel cyber chief warns - jpost.com",
      "pubDate": "Tue, 27 Jan 2026 09:50:30 GMT"
    },
    {
      "title": "Trump’s acting cyber chief uploaded sensitive files into a public version of ChatGPT - Politico",
      "pubDate": "Tue, 27 Jan 2026 20:30:00 GMT"
    },
    {
      "title": "Notepad++ says Chinese government hackers hijacked its software updates for months - TechCrunch",
      "pubDate": "Mon, 02 Feb 2026 18:09:34 GMT"
    },
    {
      "title": "The Social Security data breach is a national-security disaster that could hurt Americans for the rest of their lives: whistleblower - MarketWatch",
      "pubDate": "Wed, 04 Feb 2026 17:42:00 GMT"
    },
    {
      "title": "Cybersecurity experts warn Android users about malicious apps on Google Play - KUTV",
      "pubDate": "Thu, 05 Feb 2026 04:07:18 GMT"
    },
    {
      "title": "Claude Opus 4.6 Finds 500+ High-Severity Flaws Across Major Open-Source Libraries - The Hacker News",
      "pubDate": "Fri, 06 Feb 2026 05:49:00 GMT"
    }
  ],
  "US Economy": [
    {
      "title": "Job Gains Cooled in December, Capping Year of Weak Hiring - WSJ - The Wall Street Journal",
      "pubDate": "Sat, 10 Jan 2026 19:00:29 GMT"
    },
    {
      "title": "'Some form of crisis is almost inevitable': The $38 trillion national debt will soon be growing faster than the U.S. economy itself, watchdog warns - Fortune",
      "pubDate": "Thu, 22 Jan 2026 18:08:00 GMT"
    },
    {
      "title": "Fed, Signaling Little Urgency, Prepares to Pause on Rate Cuts - The New York Times",
      "pubDate": "Tue, 27 Jan 2026 14:55:58 GMT"
    },
    {
      "title": "U.S. Economy Shed Nearly 1 Million Job Openings Last Year - The Wall Street Journal",
      "pubDate": "Thu, 05 Feb 2026 15:41:00 GMT"
    }
  ],
  "Earthquakes": [
    {
      "title": "4.7 magnitude earthquake rattles Wyoming and parts of Utah early Thursday morning - fox13now.com",
      "pubDate": "Thu, 22 Jan 2026 14:58:59 GMT"
    }
  ],
  "Fusion Power": [
    {
      "title": "US lab sees first dual-view shockwave to unlock stable nuclear fusion - Interesting Engineering",
      "pubDate": "Sun, 11 Jan 2026 10:49:00 GMT"
    }
  ],
  "OpenAI": [
    {
      "title": "Exclusive: OpenAI aims to debut first device in 2026 - Axios",
      "pubDate": "Mon, 19 Jan 2026 18:20:21 GMT"
    },
    {
      "title": "OpenAI Plans to Take a Cut of Customers’ AI-Aided Discoveries - The Information",
      "pubDate": "Thu, 22 Jan 2026 18:30:00 GMT"
    },
    {
      "title": "Nvidia, OpenAI appear stalled on their mega deal. But the AI giants still need each other - CNBC",
      "pubDate": "Tue, 03 Feb 2026 22:22:05 GMT"
    }
  ],
  "Gaza": [
    {
      "title": "Israel and Hamas Get Ready to Go Back to War in Gaza - The Wall Street Journal",
      "pubDate": "Sat, 10 Jan 2026 08:33:00 GMT"
    },
    {
      "title": "Extreme cold kills another infant in Gaza as Israel blocks vital aid - Al Jazeera",
      "pubDate": "Sat, 10 Jan 2026 12:56:53 GMT"
    },
    {
      "title": "Israel planning new Gaza City offensive in March, but will need green-light from Trump — officials - The Times of Israel",
      "pubDate": "Sat, 10 Jan 2026 20:06:18 GMT"
    },
    {
      "title": "Hamas tells its Gaza agencies to prepare to cede power as part of truce plan - The Times of Israel",
      "pubDate": "Sun, 11 Jan 2026 23:30:00 GMT"
    },
    {
      "title": "U.S. to Name Palestinian Committee to Run Gaza - The New York Times",
      "pubDate": "Wed, 14 Jan 2026 00:35:53 GMT"
    },
    {
      "title": "White House announces \"phase two\" of Gaza ceasefire deal - Axios",
      "pubDate": "Thu, 15 Jan 2026 03:55:00 GMT"
    },
    {
      "title": "Trump plans to charge $1 billion for permanent seat on ‘Board of Peace’ - The Washington Post",
      "pubDate": "Mon, 19 Jan 2026 05:16:42 GMT"
    },
    {
      "title": "Live: Israel launches strikes as Netanyahu joins Gaza ‘board of peace’ - Al Jazeera",
      "pubDate": "Wed, 21 Jan 2026 11:37:30 GMT"
    },
    {
      "title": "Israeli fire kills 11, including journalists and children, Gaza medics say - Reuters",
      "pubDate": "Wed, 21 Jan 2026 15:37:58 GMT"
    },
    {
      "title": "Israel Says It Will Reopen Gaza-Egypt Border, a Palestinian Lifeline, in Days - The New York Times",
      "pubDate": "Mon, 26 Jan 2026 13:02:49 GMT"
    },
    {
      "title": "Updates: Gaza under Israel fire as ‘desperate’ Palestinians seek supplies - Al Jazeera",
      "pubDate": "Wed, 28 Jan 2026 13:20:44 GMT"
    },
    {
      "title": "Updates: Israel kills 31, including children, in Gaza ceasefire violation - Al Jazeera",
      "pubDate": "Sat, 31 Jan 2026 20:01:29 GMT"
    },
    {
      "title": "Updates: Gaza struggles for clean water, Hamas says ceasefire ‘meaningless’ - Al Jazeera",
      "pubDate": "Sat, 07 Feb 2026 19:36:35 GMT"
    }
  ],
  "Climate Change": [
    {
      "title": "Trump pulls US out of another major UN climate treaty - Chemical & Engineering News",
      "pubDate": "Fri, 09 Jan 2026 19:12:56 GMT"
    },
    {
      "title": "Climate Change Threatens Way of Life for Native American Tribes in Pacific Northwest - The New York Times",
      "pubDate": "Sat, 10 Jan 2026 10:01:04 GMT"
    },
    {
      "title": "Climate change has now shrunk US salaries by 12%. And worse is to come - BBC Science Focus Magazine",
      "pubDate": "Sun, 11 Jan 2026 10:00:00 GMT"
    },
    {
      "title": "Nigeria and South Africa plan to boost fossil fuel production, risking their climate change pledges - The Conversation",
      "pubDate": "Sun, 11 Jan 2026 08:20:28 GMT"
    },
    {
      "title": "The Scientists Making Antacids for the Sea to Help Counter Global Warming - The New York Times",
      "pubDate": "Sun, 11 Jan 2026 19:36:00 GMT"
    },
    {
      "title": "Global ocean heat hit its highest level on record in 2025 - Earth.com",
      "pubDate": "Mon, 12 Jan 2026 19:26:48 GMT"
    },
    {
      "title": "Climate change presses on: Devastating wildfires and intense thunderstorms exacerbate losses for insurers - munichre.com",
      "pubDate": "Tue, 13 Jan 2026 07:05:05 GMT"
    },
    {
      "title": "Earth to breach 1.5C warming a decade early, scientists say - Financial Times",
      "pubDate": "Wed, 14 Jan 2026 05:00:49 GMT"
    },
    {
      "title": "Many Climate Risks Have Been Underestimated By Policymakers, Study Finds - Forbes",
      "pubDate": "Wed, 14 Jan 2026 10:59:30 GMT"
    },
    {
      "title": "Damage to the ocean nearly doubles economic cost of climate change, new study finds - ABC News",
      "pubDate": "Thu, 15 Jan 2026 10:07:30 GMT"
    },
    {
      "title": "CLIMATE MATTERS: Research links climate change to income drop - KVOA",
      "pubDate": "Fri, 16 Jan 2026 00:56:00 GMT"
    },
    {
      "title": "Subsurface map of Antarctica reveals hidden terrain with the secrets to climate change - MSN",
      "pubDate": "Sat, 17 Jan 2026 18:55:50 GMT"
    },
    {
      "title": "Why Climate Change Blind Spots Are Becoming Balance Sheet Liabilities - Forbes",
      "pubDate": "Sun, 18 Jan 2026 17:34:33 GMT"
    },
    {
      "title": "How Wall Street Turned Its Back on Climate Change - The New York Times",
      "pubDate": "Sun, 18 Jan 2026 21:16:00 GMT"
    },
    {
      "title": "Heat inequality: Study measures the toll of climate change in Rio de Janeiro favelas - Reuters",
      "pubDate": "Mon, 19 Jan 2026 15:27:07 GMT"
    },
    {
      "title": "Earth's Moving Surface Plays Bigger Role In Climate Change Than We Knew - NDTV",
      "pubDate": "Wed, 21 Jan 2026 09:09:29 GMT"
    },
    {
      "title": "At Davos, Talk of Climate Change Retreats to the Sidelines - The New York Times",
      "pubDate": "Thu, 22 Jan 2026 20:22:38 GMT"
    },
    {
      "title": "Climate Change Threatening Future of Winter Olympics - RealClearEnergy",
      "pubDate": "Mon, 26 Jan 2026 05:26:36 GMT"
    },
    {
      "title": "Termination shock could make the cost of climate damage even higher - New Scientist",
      "pubDate": "Mon, 26 Jan 2026 12:01:14 GMT"
    },
    {
      "title": "How Does Climate Change Affect Winter Storms? - The New York Times",
      "pubDate": "Mon, 26 Jan 2026 23:12:42 GMT"
    },
    {
      "title": "California's iconic Highway 1 is fighting a losing battle against climate change. Can it survive? - latimes.com",
      "pubDate": "Tue, 27 Jan 2026 11:00:00 GMT"
    },
    {
      "title": "Trump officially pulls US out of landmark Paris climate agreement for second time - The Independent",
      "pubDate": "Tue, 27 Jan 2026 15:52:00 GMT"
    },
    {
      "title": "Dutch Court Orders Netherlands to Protect Bonaire From Climate Change - The New York Times",
      "pubDate": "Wed, 28 Jan 2026 20:34:47 GMT"
    },
    {
      "title": "Climate Litigation Updates (January 30, 2026) - Sabin Center for Climate Change Law",
      "pubDate": "Fri, 30 Jan 2026 03:13:47 GMT"
    },
    {
      "title": "Fossil fuel firms may have to pay for climate damage under proposed UN tax - The Guardian",
      "pubDate": "Sun, 01 Feb 2026 12:02:00 GMT"
    },
    {
      "title": "A Trump ‘Blockade’ Is Stalling Hundreds of Wind and Solar Projects Nationwide - The New York Times",
      "pubDate": "Wed, 04 Feb 2026 17:12:54 GMT"
    },
    {
      "title": "*Climate Change and Wildlife: Advancing Research and On-the-Ground Solutions - The Wildlife Society",
      "pubDate": "Thu, 05 Feb 2026 15:35:25 GMT"
    },
    {
      "title": "Icy weather highlights open questions about climate change effects - USA Today",
      "pubDate": "Sat, 07 Feb 2026 19:29:00 GMT"
    }
  ],
  "National Security": [
    {
      "title": "Lithium Has Become a National Security Priority for the United States - Crude Oil Prices Today | OilPrice.com",
      "pubDate": "Sat, 10 Jan 2026 16:00:00 GMT"
    },
    {
      "title": "Pentagon readies 1,500 soldiers to possibly deploy to Minnesota, officials say - The Washington Post",
      "pubDate": "Mon, 19 Jan 2026 01:28:55 GMT"
    },
    {
      "title": "Nature loss is a national security risk, intelligence group warns - BBC",
      "pubDate": "Wed, 21 Jan 2026 15:08:27 GMT"
    },
    {
      "title": "National security experts argue U.S. TikTok deal falls short - PBS",
      "pubDate": "Fri, 23 Jan 2026 23:35:29 GMT"
    },
    {
      "title": "Trump’s UAE Chip Deal Is a National Security Risk - Bloomberg",
      "pubDate": "Mon, 02 Feb 2026 10:00:26 GMT"
    }
  ],
  "North Korea": [
    {
      "title": "North Korea vows response as it accuses the South of flying drones across the border - abcnews.go.com",
      "pubDate": "Sat, 10 Jan 2026 05:15:24 GMT"
    },
    {
      "title": "North Korea says latest missile tests involve hypersonic weapons system - The North State Journal",
      "pubDate": "Sun, 11 Jan 2026 16:58:31 GMT"
    },
    {
      "title": "U.S. to Allow Aid to North Korea to Resume, While Outreach Stalls - The Wall Street Journal",
      "pubDate": "Fri, 06 Feb 2026 08:25:00 GMT"
    }
  ],
  "Iran": [
    {
      "title": "Live updates: Anti-government protests spread in Iran as authorities cut communications - CNN",
      "pubDate": "Fri, 09 Jan 2026 23:08:00 GMT"
    },
    {
      "title": "Death toll in Iran protest crackdown passes 100 as Trump said ‘seriously considering’ strike - The Times of Israel",
      "pubDate": "Sun, 11 Jan 2026 04:41:23 GMT"
    },
    {
      "title": "Iran warns it will retaliate if US attacks, as hundreds killed in protests - BBC",
      "pubDate": "Sun, 11 Jan 2026 20:32:27 GMT"
    },
    {
      "title": "Live updates: Iran ‘prepared’ for war but open to US talks as more than 500 reported killed in protests - CNN",
      "pubDate": "Tue, 13 Jan 2026 03:28:00 GMT"
    },
    {
      "title": "Iran warns of retaliation if Trump strikes, US withdraws some personnel from bases - Reuters",
      "pubDate": "Wed, 14 Jan 2026 17:28:53 GMT"
    },
    {
      "title": "Live updates: Iran closes its airspace without explanation - AP News",
      "pubDate": "Wed, 14 Jan 2026 23:34:34 GMT"
    },
    {
      "title": "At least 5,000 dead in Iran unrest, official says, as judiciary hints at executions - Reuters",
      "pubDate": "Sun, 18 Jan 2026 14:01:03 GMT"
    },
    {
      "title": "Iran warns against any US strike as judiciary hints at unrest-linked executions - Reuters",
      "pubDate": "Sun, 18 Jan 2026 20:40:08 GMT"
    },
    {
      "title": "Commander of Iran’s Revolutionary Guards warns Israel and US of ‘finger on trigger’ - timesofisrael.com",
      "pubDate": "Thu, 22 Jan 2026 17:10:18 GMT"
    },
    {
      "title": "Iran opposition outlet says regime killed over 36,000 people on January 8-9 - timesofisrael.com",
      "pubDate": "Sun, 25 Jan 2026 19:00:23 GMT"
    },
    {
      "title": "Northern Command chief: IDF ready on all fronts if US attack on Iran sparks retaliation - timesofisrael.com",
      "pubDate": "Sun, 25 Jan 2026 22:18:45 GMT"
    },
    {
      "title": "Trump warns Iran 'time is running out' for nuclear deal as US military builds up in Gulf - BBC",
      "pubDate": "Wed, 28 Jan 2026 18:58:42 GMT"
    },
    {
      "title": "Iran threatens to hit ‘heart of Tel Aviv’ in response to any US attack - timesofisrael.com",
      "pubDate": "Wed, 28 Jan 2026 21:18:00 GMT"
    },
    {
      "title": "Updates: Iran announces naval drills near US warships amid tension - Al Jazeera",
      "pubDate": "Sat, 31 Jan 2026 06:36:12 GMT"
    },
    {
      "title": "Exclusive: Iran fears US strike may reignite protests, imperil rule, sources say - Reuters",
      "pubDate": "Mon, 02 Feb 2026 17:33:33 GMT"
    },
    {
      "title": "Iran’s Revolutionary Guards seize 2 foreign-crewed oil tankers in Gulf - The Times of Israel",
      "pubDate": "Thu, 05 Feb 2026 11:21:40 GMT"
    },
    {
      "title": "US-Iran updates: FM Araghchi says latest round of talks ‘a good start’ - Al Jazeera",
      "pubDate": "Fri, 06 Feb 2026 15:07:01 GMT"
    }
  ],
  "US Supreme Court": [
    {
      "title": "US Supreme Court's Next Transgender Rights Battle Could Affect More Than Sports - U.S. News & World Report",
      "pubDate": "Sat, 10 Jan 2026 11:13:44 GMT"
    },
    {
      "title": "Supreme Court to Consider Landmark Case on FCC’s Authority to Issue Fines - TVTechnology",
      "pubDate": "Sat, 10 Jan 2026 20:28:45 GMT"
    }
  ],
  "Climate": [
    {
      "title": "Scientists call another near-record hot year a 'warning shot' from a shifting climate - NPR",
      "pubDate": "Wed, 14 Jan 2026 18:38:36 GMT"
    },
    {
      "title": "Climate threats lead to huge jumps in Colorado home insurance rates, and the state is seeking solutions - Colorado Public Radio",
      "pubDate": "Thu, 15 Jan 2026 11:02:16 GMT"
    },
    {
      "title": "Post-COP 30 Modeling Shows World Is Far Off Track for Climate Goals - Inside Climate News",
      "pubDate": "Sat, 24 Jan 2026 09:45:00 GMT"
    },
    {
      "title": "Flawed economic models mean climate crisis could crash global economy, experts warn - The Guardian",
      "pubDate": "Thu, 05 Feb 2026 00:03:00 GMT"
    },
    {
      "title": "Climate ‘Superfund’ Bills Spread Nationwide, Despite Legal Battles - The New York Times",
      "pubDate": "Fri, 06 Feb 2026 16:03:19 GMT"
    }
  ],
  "Cybersecurity and Infrastructure Security Agency": [
    {
      "title": "10 emergency directives retired as CISA declares them redundant - TechRadar",
      "pubDate": "Fri, 09 Jan 2026 19:10:00 GMT"
    },
    {
      "title": "Federal agencies ordered to patch Microsoft Desktop Windows Manager bug - The Record from Recorded Future News",
      "pubDate": "Wed, 14 Jan 2026 13:32:03 GMT"
    },
    {
      "title": "China remains most persistent cyber threat to American civilian infrastructure - Social News XYZ",
      "pubDate": "Sat, 24 Jan 2026 05:54:26 GMT"
    },
    {
      "title": "CISA Warns of Actively Exploited Critical VMware vCenter RCE Vulnerability - Cyber Press",
      "pubDate": "Mon, 26 Jan 2026 07:25:55 GMT"
    }
  ],
  "Hacking": [
    {
      "title": "China Accuses U.S. Of Hacking $15B Bitcoin From Alleged Scam Kingpin Chen Zhi - Yellow.com",
      "pubDate": "Mon, 12 Jan 2026 04:00:45 GMT"
    },
    {
      "title": "Hacking hub BreachForums hit by data breach - 324,000 accounts exposed - TechRadar",
      "pubDate": "Mon, 12 Jan 2026 17:10:00 GMT"
    },
    {
      "title": "Researchers say Russian government hackers were behind attempted Poland power outage - TechRadar",
      "pubDate": "Mon, 26 Jan 2026 11:20:00 GMT"
    },
    {
      "title": "China hacked Downing Street phones for years - The Telegraph",
      "pubDate": "Mon, 26 Jan 2026 19:17:00 GMT"
    }
  ],
  "Drones": [
    {
      "title": "Ukrainian drones set fire to Russian oil depot after Moscow launches new hypersonic missile - abcnews.go.com",
      "pubDate": "Sat, 10 Jan 2026 12:28:30 GMT"
    },
    {
      "title": "Ukraine war briefing: Czechs offer drone-hunting jets as Zelenskyy flags air defence shortages - The Guardian",
      "pubDate": "Sun, 18 Jan 2026 04:18:00 GMT"
    },
    {
      "title": "Ukraine is paying $20,000 to drone firms who can destroy a Russian Shahed, defense minister says - Business Insider",
      "pubDate": "Wed, 21 Jan 2026 06:03:00 GMT"
    },
    {
      "title": "A Winter Lull in the Fighting? Not in the Age of Drone Warfare. - The New York Times",
      "pubDate": "Mon, 26 Jan 2026 10:00:27 GMT"
    },
    {
      "title": "Russian drones injure Ukrainian children and a pregnant woman as Zelenskyy urges swifter diplomacy - The Hill",
      "pubDate": "Tue, 27 Jan 2026 10:32:00 GMT"
    },
    {
      "title": "Poland Inks $4.3 Billion Deal for ‘Drone Wall’ to Deter Russia - Bloomberg.com",
      "pubDate": "Fri, 30 Jan 2026 09:49:13 GMT"
    },
    {
      "title": "US fighter jet shoots down Iranian drone approaching US aircraft carrier - ABC News",
      "pubDate": "Tue, 03 Feb 2026 18:56:15 GMT"
    }
  ],
  "Federal Reserve": [
    {
      "title": "Will the Supreme Court let Trump take control of the Fed? - USA Today",
      "pubDate": "Sun, 18 Jan 2026 08:01:00 GMT"
    },
    {
      "title": "Supreme Court considers whether Trump can fire Federal Reserve officials - fox5dc.com",
      "pubDate": "Thu, 22 Jan 2026 22:23:00 GMT"
    },
    {
      "title": "The Fed is expected to stand pat this week. The big question is for how long? - MarketWatch",
      "pubDate": "Sun, 25 Jan 2026 20:13:00 GMT"
    },
    {
      "title": "Japan Bond Crash Unleashes a $7 Trillion Risk for Global Markets - Bloomberg.com",
      "pubDate": "Sun, 25 Jan 2026 22:00:31 GMT"
    },
    {
      "title": "Federal Reserve may keep rates unchanged for months as economy shows signs of health - clickondetroit.com",
      "pubDate": "Wed, 28 Jan 2026 11:51:07 GMT"
    },
    {
      "title": "Trump nominates Kevin Warsh as new Federal Reserve chair - BBC",
      "pubDate": "Fri, 30 Jan 2026 15:22:30 GMT"
    },
    {
      "title": "Most want Supreme Court to rule against Trump on tariffs, Federal Reserve removal: Polling - The Hill",
      "pubDate": "Thu, 05 Feb 2026 17:09:00 GMT"
    }
  ],
  "Department of Homeland Security": [
    {
      "title": "DHS restricts congressional visits to ICE facilities in Minneapolis with new policy - NPR",
      "pubDate": "Sun, 11 Jan 2026 18:18:04 GMT"
    },
    {
      "title": "DHS seeking to deport two men who said fellow ICE detainee was killed - The Washington Post",
      "pubDate": "Sat, 17 Jan 2026 23:46:36 GMT"
    },
    {
      "title": "Partial government shutdown more likely over DHS funding fight after Alex Pretti killing - CNBC",
      "pubDate": "Sun, 25 Jan 2026 14:31:41 GMT"
    },
    {
      "title": "Impeachment, hearings, shutdown: DHS and ICE are under siege by Congress like never before - Axios",
      "pubDate": "Mon, 26 Jan 2026 02:50:28 GMT"
    },
    {
      "title": "Funding deal begins to unravel as Senate Democrats vow to oppose DHS bill over Alex Pretti shooting in Minnesota - PBS",
      "pubDate": "Mon, 26 Jan 2026 14:53:37 GMT"
    },
    {
      "title": "Border Patrol agents involved in shooting of Alex Pretti were wearing body cameras, DHS says - kstp.com",
      "pubDate": "Tue, 27 Jan 2026 05:07:30 GMT"
    },
    {
      "title": "Trump orders DHS to stay away from protests in Democratic-led cities unless federal help sought - Reuters",
      "pubDate": "Sat, 31 Jan 2026 21:13:47 GMT"
    },
    {
      "title": "Senators Clash Over Immigration Enforcement, Risking a D.H.S. Shutdown - The New York Times",
      "pubDate": "Thu, 05 Feb 2026 22:44:47 GMT"
    },
    {
      "title": "DHS warned its independent watchdog that Noem can kill its investigations, senator says - NBC News",
      "pubDate": "Fri, 06 Feb 2026 23:42:05 GMT"
    }
  ],
  "Microsoft": [
    {
      "title": "Microsoft issues emergency OS update for Windows 11 to address major bugs - Windows Central",
      "pubDate": "Sun, 18 Jan 2026 13:12:05 GMT"
    }
  ],
  "Recession": [
    {
      "title": "US labor share of income falls to lowest on record; 2025 jobs figures weakest outside of official recession since 2003 - World Socialist Web Site",
      "pubDate": "Sat, 10 Jan 2026 06:05:20 GMT"
    },
    {
      "title": "Federal Reserve rate cuts aimed at preventing full economic recession amid rising jobless claims - MSN",
      "pubDate": "Mon, 12 Jan 2026 12:52:42 GMT"
    },
    {
      "title": "State of the Dream 2026: From Regression to Signs of a Black Recession - Joint Center",
      "pubDate": "Wed, 14 Jan 2026 18:48:12 GMT"
    },
    {
      "title": "Capital One CEO Says Capping Card Rates Threatens Recession - Bloomberg.com",
      "pubDate": "Thu, 22 Jan 2026 23:22:25 GMT"
    }
  ],
  "Global Health": [
    {
      "title": "How 1,000 days of war pushed Sudan’s health system to the brink of collapse - arabnews.jp",
      "pubDate": "Thu, 15 Jan 2026 01:01:13 GMT"
    },
    {
      "title": "Baby wraps treated with insecticide could help slash malaria cases, say researchers - The Telegraph",
      "pubDate": "Fri, 16 Jan 2026 14:04:00 GMT"
    },
    {
      "title": "The near death — and last-minute reprieve — of a trial for an HIV vaccine - NPR",
      "pubDate": "Sat, 17 Jan 2026 12:54:13 GMT"
    },
    {
      "title": "Cholera is surging in Africa. A new generation of vaccines could slow it - The Telegraph",
      "pubDate": "Wed, 21 Jan 2026 16:03:00 GMT"
    },
    {
      "title": "US set to quit World Health Organization - Reuters",
      "pubDate": "Thu, 22 Jan 2026 15:12:44 GMT"
    }
  ],
  "Terrorism": [
    {
      "title": "U.S. airstrikes hit ISIS targets in Syria, officials say - CBS News",
      "pubDate": "Sat, 10 Jan 2026 21:29:00 GMT"
    },
    {
      "title": "Itamar Ben-Gvir switches terrorism death penalty method to hanging - The Jerusalem Post",
      "pubDate": "Wed, 14 Jan 2026 18:38:00 GMT"
    },
    {
      "title": "Russia strikes civilian train in Ukraine, killing five, in an attack Zelensky calls ‘terrorism’ - CNN",
      "pubDate": "Wed, 28 Jan 2026 10:34:23 GMT"
    },
    {
      "title": "Westminster man pleads guilty to federal terrorism charge - The Denver Post",
      "pubDate": "Fri, 06 Feb 2026 20:41:24 GMT"
    }
  ],
  "Privacy": [
    {
      "title": "New York’s governor vetoes popular health data privacy bill - Healthcare Brew",
      "pubDate": "Mon, 12 Jan 2026 16:40:55 GMT"
    },
    {
      "title": "Protecting the right to privacy in the age of surveillance - Cape Gazette",
      "pubDate": "Tue, 03 Feb 2026 10:08:25 GMT"
    }
  ],
  "United Nations": [
    {
      "title": "UN International Court of Justice to hear 1st genocide case in over a decade - NPR",
      "pubDate": "Tue, 13 Jan 2026 11:50:52 GMT"
    },
    {
      "title": "UN risks 'imminent financial collapse', secretary general warns - BBC",
      "pubDate": "Fri, 30 Jan 2026 16:24:18 GMT"
    }
  ],
  "Renewable Energy": [
    {
      "title": "Eight million panels, 100 GW — China starts assembling its ‘Great Wall of Energy’ in the desert - Energies Media",
      "pubDate": "Sun, 18 Jan 2026 11:09:27 GMT"
    },
    {
      "title": "Energy Dept. Says It Is Canceling $30 Billion in Clean Energy Loans - The New York Times",
      "pubDate": "Thu, 22 Jan 2026 22:41:50 GMT"
    }
  ],
  "Nuclear Power": [
    {
      "title": "Hochul ratchets up nuclear plans, aims to lead U.S. in building new power reactors - Syracuse.com",
      "pubDate": "Mon, 12 Jan 2026 13:17:00 GMT"
    },
    {
      "title": "China and Russia dominate nuclear power push with 90% of new reactors - Nikkei Asia",
      "pubDate": "Sat, 17 Jan 2026 20:01:00 GMT"
    },
    {
      "title": "Ukraine war briefing: Russia readying strikes on nuclear power system, Zelenskyy warns - The Guardian",
      "pubDate": "Sun, 18 Jan 2026 02:14:00 GMT"
    },
    {
      "title": "Russia To Wipe Out Ukraine Nuclear Power Plants? Zelensky's Big Alarm, SOS To European Allies - Times of India",
      "pubDate": "Sun, 18 Jan 2026 18:09:59 GMT"
    },
    {
      "title": "Japan suspends world's largest nuclear plant hours after restart - BBC",
      "pubDate": "Thu, 22 Jan 2026 13:13:24 GMT"
    },
    {
      "title": "US Government Seeking Volunteers to Store Nuclear Sludge - Futurism",
      "pubDate": "Sun, 08 Feb 2026 14:45:00 GMT"
    }
  ],
  "BRICS": [
    {
      "title": "Exclusive: India's central bank proposes linking BRICS' digital currencies, sources say - Reuters",
      "pubDate": "Mon, 19 Jan 2026 10:56:45 GMT"
    },
    {
      "title": "Why is South Africa upset about Iran joining BRICS naval drills? - Al Jazeera",
      "pubDate": "Fri, 23 Jan 2026 05:55:29 GMT"
    },
    {
      "title": "Berliner Zeitung: BRICS will launch its payment system — sanctions will become useless - EADaily",
      "pubDate": "Mon, 26 Jan 2026 08:15:00 GMT"
    },
    {
      "title": "BRICS Payment Settlement: The Quest and Implications - Modern Diplomacy",
      "pubDate": "Wed, 28 Jan 2026 23:00:52 GMT"
    }
  ],
  "Corruption": [
    {
      "title": "Thousands rally in Serbia as students continue fight against corruption - Al Jazeera",
      "pubDate": "Sun, 18 Jan 2026 06:37:32 GMT"
    },
    {
      "title": "China launches corruption probe into top military commanders - Defence Blog",
      "pubDate": "Sun, 25 Jan 2026 21:17:14 GMT"
    },
    {
      "title": "Senior PEA officials exposed in crypto mining corruption scandal - Bangkok Post",
      "pubDate": "Tue, 27 Jan 2026 06:34:00 GMT"
    }
  ],
  "Public Health": [
    {
      "title": "GOP Cuts Will Cripple Medicaid Enrollment, Warns CEO of Largest Public Health Plan - KFF Health News",
      "pubDate": "Thu, 15 Jan 2026 10:00:00 GMT"
    },
    {
      "title": "Pediatricians are disregarding the new vaccination schedule - The Washington Post",
      "pubDate": "Mon, 19 Jan 2026 18:00:30 GMT"
    },
    {
      "title": "In one South Carolina county, measles starts to feel like next pandemic - BBC",
      "pubDate": "Fri, 30 Jan 2026 11:32:26 GMT"
    }
  ],
  "Military and Defense": [
    {
      "title": "NATO allies launch Arctic drills as Trump eyes Greenland - Axios",
      "pubDate": "Fri, 16 Jan 2026 06:44:06 GMT"
    }
  ],
  "NVIDIA": [
    {
      "title": "China blocks Nvidia H200 AI chips that US government cleared for export – report - The Guardian",
      "pubDate": "Sun, 18 Jan 2026 04:18:00 GMT"
    },
    {
      "title": "Nvidia’s Huang Plans to Visit China as He Works to Reopen Market - Bloomberg.com",
      "pubDate": "Wed, 21 Jan 2026 02:10:00 GMT"
    },
    {
      "title": "Nvidia, Microsoft, Amazon in talks to invest up to $60 billion in OpenAI, The Information reports - Reuters",
      "pubDate": "Thu, 29 Jan 2026 03:49:00 GMT"
    }
  ],
  "The Pentagon": [
    {
      "title": "Pentagon moves to cut U.S. participation in some NATO groups - The Washington Post",
      "pubDate": "Wed, 21 Jan 2026 04:29:05 GMT"
    },
    {
      "title": "Pentagon contractor indicted over alleged leak tied to raided Washington Post reporter - The Guardian",
      "pubDate": "Fri, 23 Jan 2026 16:46:00 GMT"
    }
  ],
  "US Treasury": [
    {
      "title": "'Rats fleeing the ship': US treasury secretary says Iran's leaders moving funds out of the country - The Times of Israel",
      "pubDate": "Thu, 15 Jan 2026 04:48:50 GMT"
    }
  ],
  "Health Care": [
    {
      "title": "Nearly 15,000 Nurses Go on Strike at Major New York City Hospitals - The New York Times",
      "pubDate": "Mon, 12 Jan 2026 11:23:01 GMT"
    }
  ],
  "Democracy": [
    {
      "title": "A Tale of Two Meetings: Trump Chooses Oil Over Democracy - The New York Times",
      "pubDate": "Fri, 16 Jan 2026 08:02:31 GMT"
    }
  ],
  "War and Unrest": [
    {
      "title": "Iran puts 'missile cities' on highest alert since war as regime moves to quash protests - Ynetnews",
      "pubDate": "Sat, 10 Jan 2026 14:42:16 GMT"
    },
    {
      "title": "The death toll from a crackdown on protests in Iran jumps to at least 2,571, activists say - AP News",
      "pubDate": "Wed, 14 Jan 2026 03:16:00 GMT"
    }
  ],
  "New York City": [
    {
      "title": "Winter Storm Fern live: three people found dead in New York City as tens of thousands go without power across US - The Guardian",
      "pubDate": "Sat, 24 Jan 2026 15:37:00 GMT"
    }
  ],
  "Democratic Party": [
    {
      "title": "These Are the 12 States Vying to Kick Off Democrats’ 2028 Contest - The New York Times",
      "pubDate": "Sun, 18 Jan 2026 03:43:35 GMT"
    },
    {
      "title": "A Pro-Israel Group’s Move Backfires as Gaza Tensions Flare in Midterms - The New York Times",
      "pubDate": "Fri, 06 Feb 2026 17:24:21 GMT"
    }
  ],
  "Protest": [
    {
      "title": "Leaked photos show hundreds killed in Iran's brutal crackdown - BBC",
      "pubDate": "Wed, 21 Jan 2026 05:56:20 GMT"
    },
    {
      "title": "Businesses close, Minnesotans to stay home Friday in protest of ICE - Star Tribune",
      "pubDate": "Thu, 22 Jan 2026 19:30:00 GMT"
    }
  ],
  "Environment": [
    {
      "title": "E.P.A. to Stop Considering Lives Saved by Limiting Air Pollution - The New York Times",
      "pubDate": "Mon, 12 Jan 2026 16:43:41 GMT"
    }
  ],
  "Kim Jong Un": [
    {
      "title": "North Korea’s Kim fires vice premier, calls him ‘a goat yoked to pull an ox cart’ - CNN",
      "pubDate": "Wed, 21 Jan 2026 01:07:00 GMT"
    }
  ],
  "Google": [
    {
      "title": "‘Dangerous and alarming’: Google removes some of its AI summaries after users’ health put at risk - The Guardian",
      "pubDate": "Mon, 12 Jan 2026 02:30:00 GMT"
    }
  ],
  "World Economy": [
    {
      "title": "Exclusive: IMF's growth forecasts to show resilience to global trade shocks, Georgieva says - Reuters",
      "pubDate": "Fri, 16 Jan 2026 00:26:00 GMT"
    },
    {
      "title": "World Economic Outlook Update, January 2026: Global Economy: Steady amid Divergent Forces - International Monetary Fund | IMF",
      "pubDate": "Tue, 20 Jan 2026 01:42:44 GMT"
    }
  ],
  "US Politics": [
    {
      "title": "A ‘Ticklish Subject’: Trump’s Words on Immigration Often Collide and Contradict - The New York Times",
      "pubDate": "Sat, 10 Jan 2026 15:07:33 GMT"
    },
    {
      "title": "Federal Prosecutors Open Investigation Into Fed Chair Powell - The New York Times",
      "pubDate": "Mon, 12 Jan 2026 14:18:00 GMT"
    },
    {
      "title": "Powell pushes back as Trump’s DOJ launches unprecedented investigation into Fed - PBS",
      "pubDate": "Mon, 12 Jan 2026 23:55:25 GMT"
    },
    {
      "title": "A major development in Trump's Fed feud is set to happen next week in the Supreme Court - CNBC",
      "pubDate": "Tue, 13 Jan 2026 20:05:49 GMT"
    },
    {
      "title": "Trump Heads to Davos Amid Deep Worries About U.S.-European Alliance - The New York Times",
      "pubDate": "Wed, 21 Jan 2026 05:00:05 GMT"
    },
    {
      "title": "Jack Smith testifies in tense House hearing about Trump investigations – US politics live - The Guardian",
      "pubDate": "Thu, 22 Jan 2026 11:49:00 GMT"
    },
    {
      "title": "Marco Rubio personally signed off on arrests of pro-Palestine students, documents show - The Independent",
      "pubDate": "Fri, 23 Jan 2026 17:05:00 GMT"
    },
    {
      "title": "HUD Demands Public Housing Officials Check for Undocumented Immigrants - nytimes.com",
      "pubDate": "Fri, 23 Jan 2026 23:55:04 GMT"
    },
    {
      "title": "Democrats vow to oppose homeland security funds after Minnesota shooting as shutdown risk grows - ABC News",
      "pubDate": "Mon, 26 Jan 2026 08:14:44 GMT"
    },
    {
      "title": "Democrats Vow Not to Fund ICE After Shooting, Imperiling Spending Deal - The New York Times",
      "pubDate": "Tue, 27 Jan 2026 15:59:57 GMT"
    },
    {
      "title": "Trump and Schumer Move Toward Possible Deal to Avert a Shutdown - The New York Times",
      "pubDate": "Thu, 29 Jan 2026 04:19:22 GMT"
    },
    {
      "title": "Senate passes $1.2T government funding deal — but a brief shutdown is certain - Politico",
      "pubDate": "Sat, 31 Jan 2026 00:28:38 GMT"
    },
    {
      "title": "Donald Trump signs bill to end partial US government shutdown - Financial Times",
      "pubDate": "Tue, 03 Feb 2026 20:31:34 GMT"
    },
    {
      "title": "House Democrats help Mike Johnson end government shutdown, fund DHS and ICE - Axios",
      "pubDate": "Wed, 04 Feb 2026 05:51:26 GMT"
    },
    {
      "title": "Supreme Court allows California to use new voting map boosting Democrats - BBC",
      "pubDate": "Wed, 04 Feb 2026 20:20:30 GMT"
    }
  ],
  "Nuclear Fusion": [
    {
      "title": "China accelerates nuclear fusion engineering, targeting power generation demonstration by 2030 - Xinhua",
      "pubDate": "Fri, 16 Jan 2026 15:54:15 GMT"
    },
    {
      "title": "Chinese scientists make groundbreaking discovery in pursuit of limitless energy: 'A practical and scalable pathway' - The Cool Down",
      "pubDate": "Sun, 25 Jan 2026 17:00:00 GMT"
    },
    {
      "title": "Controllable Nuclear Fusion Secures Another 500 Million Yuan in Financing - 36 Kr",
      "pubDate": "Wed, 04 Feb 2026 03:13:08 GMT"
    }
  ],
  "Quantum Computing": [
    {
      "title": "Are quantum computers finally becoming useful? - Financial Times",
      "pubDate": "Sun, 11 Jan 2026 05:00:25 GMT"
    },
    {
      "title": "New Discovery In Laser Technology Could Change Everything For Quantum Computing - bgr.com",
      "pubDate": "Sun, 01 Feb 2026 11:17:00 GMT"
    },
    {
      "title": "Record-breaking quantum simulator could unlock new materials - New Scientist",
      "pubDate": "Wed, 04 Feb 2026 16:01:35 GMT"
    }
  ],
  "Geopolitics": [
    {
      "title": "Oil Rises in Asia; Geopolitical Tensions in Focus - The Wall Street Journal",
      "pubDate": "Tue, 20 Jan 2026 01:30:00 GMT"
    },
    {
      "title": "As U.S. Warships Get Closer, Iran Ramps Up Threats to Retaliate - The New York Times",
      "pubDate": "Mon, 26 Jan 2026 17:28:06 GMT"
    },
    {
      "title": "North Korea test-launches 2 ballistic missiles toward sea, Japan and South Korea say - ABC News",
      "pubDate": "Tue, 27 Jan 2026 11:44:53 GMT"
    },
    {
      "title": "China’s Xi and Russia’s Putin hold talks by video - AP News",
      "pubDate": "Wed, 04 Feb 2026 10:02:00 GMT"
    }
  ],
  "United States": [
    {
      "title": "US senators introduce bill to stop Trump seizing Greenland - Al Jazeera",
      "pubDate": "Wed, 14 Jan 2026 03:22:30 GMT"
    }
  ],
  "AI Ethics": [
    {
      "title": "Businesses are embracing AI, but ethical blind spots are major operational risks - The Media Online",
      "pubDate": "Fri, 16 Jan 2026 05:30:23 GMT"
    },
    {
      "title": "AI Ethics And Regulation: How OpenAI Is Addressing Safety, Children And Global Standards | BT Davos - Business Today",
      "pubDate": "Mon, 19 Jan 2026 15:18:15 GMT"
    },
    {
      "title": "Before AI Summit, an ethics checklist - The Indian Express",
      "pubDate": "Wed, 21 Jan 2026 02:08:00 GMT"
    },
    {
      "title": "Anthropic revises Claude's AI rules to strengthen ethics, user safety - NewsBytes",
      "pubDate": "Thu, 22 Jan 2026 06:23:52 GMT"
    },
    {
      "title": "Deepfake ‘Nudify’ Technology Is Getting Darker—and More Dangerous - WIRED",
      "pubDate": "Mon, 26 Jan 2026 11:30:00 GMT"
    },
    {
      "title": "Key Discovery Points: Understanding the Ethics of AI for the Rest of Us - JD Supra",
      "pubDate": "Fri, 30 Jan 2026 23:32:20 GMT"
    },
    {
      "title": "Google helped Israeli military contractor with AI, whistleblower alleges - The Washington Post",
      "pubDate": "Sun, 01 Feb 2026 17:31:50 GMT"
    },
    {
      "title": "Inside Project Panama: 2 million books scanned and destroyed by Anthropic AI to train machines - Times of India",
      "pubDate": "Mon, 02 Feb 2026 21:42:00 GMT"
    },
    {
      "title": "When Guardrails Collapse: What the Grok Controversy Reveals About the Future of AI Ethics - Australian Institute of International Affairs",
      "pubDate": "Thu, 05 Feb 2026 02:51:54 GMT"
    },
    {
      "title": "Mexico Unveils National Declaration on Ethical AI to Guide Public Policy and Protect Human Rights - BABL AI",
      "pubDate": "Thu, 05 Feb 2026 13:00:29 GMT"
    }
  ],
  "Space Exploration": [
    {
      "title": "Scientists Have Discovered a Fascinating New Way Jupiter's Moon Europa Could Support Life - The Debrief",
      "pubDate": "Mon, 26 Jan 2026 13:30:08 GMT"
    },
    {
      "title": "NASA delays the first Artemis moonshot with astronauts because of extreme cold at the launch site - ABC News",
      "pubDate": "Sat, 31 Jan 2026 08:46:59 GMT"
    },
    {
      "title": "Artemis II astronaut Christina Koch will see Earth like no human has before - Axios",
      "pubDate": "Tue, 03 Feb 2026 11:02:38 GMT"
    },
    {
      "title": "Artificial Intelligence just drove NASA's robotic rover on Mars for the first time - BBC Sky at Night Magazine",
      "pubDate": "Wed, 04 Feb 2026 09:51:09 GMT"
    }
  ],
  "Financial Markets": [
    {
      "title": "Bitcoin-Led Crypto Rout Erases Nearly $500 Billion in a Week - Bloomberg.com",
      "pubDate": "Wed, 04 Feb 2026 15:18:24 GMT"
    }
  ],
  "International Relations": [
    {
      "title": "Trump tariffs live updates: EU, India seal trade deal in rebuff to Trump as he threatens S. Korea tariff boost - Yahoo Finance",
      "pubDate": "Tue, 27 Jan 2026 16:42:00 GMT"
    }
  ],
  "Internet": [
    {
      "title": "Live updates: Dozens reported killed during Iran protests as internet blackout persists - CNN",
      "pubDate": "Sat, 10 Jan 2026 23:31:00 GMT"
    }
  ],
  "Investment": [
    {
      "title": "US to invest $1.6bn into rare earths group in bid to shore up key minerals - Financial Times",
      "pubDate": "Sat, 24 Jan 2026 23:29:49 GMT"
    },
    {
      "title": "Nvidia CEO Huang denies he is unhappy with OpenAI, says 'huge' investment planned at 'trillion-dollar dinner' - CNBC",
      "pubDate": "Sat, 31 Jan 2026 14:36:51 GMT"
    }
  ],
  "US Senate": [
    {
      "title": "Senate advances war powers resolution to rein in Trump on Venezuela - abcnews.go.com",
      "pubDate": "Fri, 09 Jan 2026 22:50:03 GMT"
    }
  ],
  "Elon Musk": [
    {
      "title": "Indonesia becomes the first country to suspend Elon Musk's Grok for generating 'non-consensual sexual deepfakes' - Business Insider",
      "pubDate": "Sat, 10 Jan 2026 20:06:00 GMT"
    },
    {
      "title": "Iran uses kill switch to jam Starlink as protests rage on. Did China or Russia help? - India Today",
      "pubDate": "Mon, 12 Jan 2026 08:29:57 GMT"
    },
    {
      "title": "Musk Seeks Up to $134 Billion Damages From OpenAI, Microsoft - Bloomberg",
      "pubDate": "Sat, 17 Jan 2026 16:36:44 GMT"
    },
    {
      "title": "Paris prosecutors summon Elon Musk after raid on X's French offices - NBC News",
      "pubDate": "Tue, 03 Feb 2026 20:46:47 GMT"
    }
  ],
  "AI Alignment": [
    {
      "title": "OpenAI training its next-gen AI models on real-world tasks by contractors: Report - The Indian Express",
      "pubDate": "Sun, 11 Jan 2026 07:11:08 GMT"
    },
    {
      "title": "Microsoft AI chief warns world risks losing control in AGI race - Communications Today",
      "pubDate": "Mon, 12 Jan 2026 11:03:35 GMT"
    },
    {
      "title": "Governance Framework Achieves Distributional AGI Safety, Addressing 3 Structural Problems - Quantum Zeitgeist",
      "pubDate": "Mon, 19 Jan 2026 18:03:36 GMT"
    },
    {
      "title": "Rational but wrong: How AI misinterprets choices and quietly skews decisions - Devdiscourse",
      "pubDate": "Fri, 06 Feb 2026 05:52:33 GMT"
    }
  ],
  "Electric Vehicle": [
    {
      "title": "BYD overtakes Tesla as the world’s largest EV manufacturer - New Atlas",
      "pubDate": "Sun, 11 Jan 2026 03:05:36 GMT"
    },
    {
      "title": "Europe and China Take Step to Resolve Dispute on Electric Vehicles - The New York Times",
      "pubDate": "Mon, 12 Jan 2026 12:31:19 GMT"
    },
    {
      "title": "Tesla agrees to mediation that could resolve US agency's racism lawsuit - Reuters",
      "pubDate": "Wed, 14 Jan 2026 02:39:00 GMT"
    }
  ],
  "Cancer": [
    {
      "title": "Injection turns sleeping tumor immune cells into cancer fighters - ScienceDaily",
      "pubDate": "Sun, 11 Jan 2026 11:13:44 GMT"
    },
    {
      "title": "What science says about how weight-loss drugs affect cancer risk - The Washington Post",
      "pubDate": "Sat, 17 Jan 2026 18:00:00 GMT"
    }
  ],
  "NASA": [
    {
      "title": "NASA won’t bring back Mars sample - Yahoo",
      "pubDate": "Sun, 11 Jan 2026 22:19:29 GMT"
    },
    {
      "title": "NASA, Department of Energy to Develop Lunar Surface Reactor by 2030 - NASA (.gov)",
      "pubDate": "Tue, 13 Jan 2026 21:01:41 GMT"
    },
    {
      "title": "Artemis 2 rocket rollout latest news: NASA ready to move giant moon rocket - Space",
      "pubDate": "Fri, 16 Jan 2026 16:36:57 GMT"
    },
    {
      "title": "Nasa's mega Moon rocket arrives at launch pad for Artemis II mission - BBC",
      "pubDate": "Sun, 18 Jan 2026 01:22:46 GMT"
    }
  ],
  "Alexandria Ocasio-Cortez": [
    {
      "title": "Mamdani, AOC denounce pro-Hamas chants outside Queens synagogue, with mayor using ‘terrorist’ label for first time - Jewish Telegraphic Agency",
      "pubDate": "Mon, 12 Jan 2026 11:28:28 GMT"
    }
  ],
  "Apple": [
    {
      "title": "Gemini will power Apple's Siri - Axios",
      "pubDate": "Tue, 13 Jan 2026 03:10:33 GMT"
    }
  ],
  "Defense Intelligence Agency": [
    {
      "title": "US strikes may delay Iran nuclear program by months, sources reveal - The Sun Malaysia",
      "pubDate": "Tue, 13 Jan 2026 10:11:06 GMT"
    }
  ],
  "World Politics": [
    {
      "title": "Iran's Currency Hits 1.47 Million Per Dollar As Economic Crisis Fuels Uprising - International Business Times UK",
      "pubDate": "Tue, 13 Jan 2026 06:11:00 GMT"
    }
  ],
  "United States Constitution": [
    {
      "title": "Tariffs, AI, and the Golden Age of Executive Power - The Daily Economy",
      "pubDate": "Tue, 13 Jan 2026 11:40:00 GMT"
    }
  ],
  "European Union": [
    {
      "title": "European Defense Companies in Line to Benefit From Bulk of EU’s $105 Billion Ukraine Loan - The Wall Street Journal",
      "pubDate": "Wed, 14 Jan 2026 13:18:00 GMT"
    }
  ],
  "Quantum": [
    {
      "title": "Chinese military says it is developing over 10 quantum warfare weapons - South China Morning Post",
      "pubDate": "Thu, 15 Jan 2026 04:00:09 GMT"
    }
  ],
  "Energy Transition": [
    {
      "title": "Global emissions rise 9% since 2015 as energy transition slows - pv magazine USA",
      "pubDate": "Thu, 15 Jan 2026 15:48:32 GMT"
    },
    {
      "title": "U.S. government cuts $83 billion in loans, reversing energy transition funding - pv magazine International",
      "pubDate": "Fri, 23 Jan 2026 14:47:18 GMT"
    }
  ],
  "Health": [
    {
      "title": "US health officials reverse course and reinstate $1.9bn to mental health and substance use - The Guardian",
      "pubDate": "Thu, 15 Jan 2026 14:04:00 GMT"
    }
  ],
  "Affordability": [
    {
      "title": "Trump unveils health care affordability plan - The Hill",
      "pubDate": "Thu, 15 Jan 2026 17:13:00 GMT"
    }
  ],
  "Bitcoin": [
    {
      "title": "Jefferies’ Wood Drops Bitcoin on Threat From Quantum Computing - Bloomberg.com",
      "pubDate": "Fri, 16 Jan 2026 09:04:33 GMT"
    },
    {
      "title": "Bitcoin price news: BTC stuck at $89,000 as gold surges to fresh record - CoinDesk",
      "pubDate": "Wed, 28 Jan 2026 21:39:19 GMT"
    }
  ],
  "Oceans": [
    {
      "title": "World's first legally binding treaty to protect oceans takes effect - Australian Broadcasting Corporation",
      "pubDate": "Sun, 18 Jan 2026 04:13:54 GMT"
    }
  ],
  "Large Language Models": [
    {
      "title": "MIT Recursive Language Models Shatter the LLM Context Window Limit - StartupHub.ai",
      "pubDate": "Sat, 17 Jan 2026 19:54:04 GMT"
    },
    {
      "title": "New Research Shows LLMs Face A Big Copyright Risk - Forbes",
      "pubDate": "Sun, 18 Jan 2026 06:40:45 GMT"
    },
    {
      "title": "New research decodes hidden bias in health care LLMs - Northeastern Global News",
      "pubDate": "Tue, 20 Jan 2026 20:50:47 GMT"
    }
  ],
  "Artificial General Intelligence": [
    {
      "title": "The superintelligence unveiled by Mark Zuckerberg has deeply unsettled experts - Futura, Le média qui explore le monde",
      "pubDate": "Sun, 18 Jan 2026 12:30:00 GMT"
    },
    {
      "title": "Trump Just Reversed an AI Chip Ban for China—and a Key Tech Leader Says It's Like 'Selling Nuclear Weapons' - inc.com",
      "pubDate": "Wed, 21 Jan 2026 16:30:17 GMT"
    },
    {
      "title": "Google DeepMind co-founder hints AI as smart as humans is almost here, says it will change economy - India Today",
      "pubDate": "Fri, 23 Jan 2026 12:43:54 GMT"
    },
    {
      "title": "The Great AGI Divide: AI’s Top Minds Clash in Davos Over Tech’s Final Frontier - WebProNews",
      "pubDate": "Sun, 25 Jan 2026 21:24:06 GMT"
    },
    {
      "title": "How China Caught Up on AI—and May Now Win the Future - Time Magazine",
      "pubDate": "Tue, 27 Jan 2026 16:16:05 GMT"
    },
    {
      "title": "Forget AGI, business leaders are still trying to figure out how to make AI work - Computer Weekly",
      "pubDate": "Thu, 05 Feb 2026 10:24:55 GMT"
    },
    {
      "title": "Claude Opus 4.6 Raises Eyebrows by Suggesting It Might Be Conscious - The Hans India",
      "pubDate": "Fri, 06 Feb 2026 11:18:05 GMT"
    }
  ],
  "Electric Power Transmission": [
    {
      "title": "Global power grids emerge as strategic choke points in AI and industrial competition race - digitimes",
      "pubDate": "Mon, 19 Jan 2026 04:34:41 GMT"
    }
  ],
  "Violence": [
    {
      "title": "Guatemala Declares State of Emergency to Address Gang Violence - The New York Times",
      "pubDate": "Mon, 19 Jan 2026 13:56:00 GMT"
    }
  ],
  "Central Intelligence Agency": [
    {
      "title": "A covert CIA team is said to have helped the U.S. military’s raid to seize Venezuela’s president, reflecting the agency’s new focus on the region. - facebook.com",
      "pubDate": "Wed, 21 Jan 2026 05:58:27 GMT"
    },
    {
      "title": "Senator, who has repeatedly warned about secret US government surveillance, sounds new alarm over ‘CIA activities’ - Yahoo",
      "pubDate": "Fri, 06 Feb 2026 18:02:44 GMT"
    }
  ],
  "Nuclear Fission": [
    {
      "title": "TEPCO restarts 1st nuclear reactor since Fukushima under close scrutiny - english.kyodonews.net",
      "pubDate": "Wed, 21 Jan 2026 14:04:51 GMT"
    }
  ],
  "Finland": [
    {
      "title": "Finland Invests in Defense, Ready to Mobilize 280,000 Troops Against Russian Aggression - UNITED24 Media",
      "pubDate": "Wed, 21 Jan 2026 13:47:35 GMT"
    }
  ],
  "Business": [
    {
      "title": "White House and China finalize deal to sell control of U.S. TikTok business to investors backed by Trump administration - NBC News",
      "pubDate": "Thu, 22 Jan 2026 23:25:00 GMT"
    }
  ],
  "Self-Driving Cars": [
    {
      "title": "Tesla Launches Robotaxi Rides Without a Human Chaperone in Austin - Business Insider",
      "pubDate": "Thu, 22 Jan 2026 19:51:00 GMT"
    }
  ],
  "Outer Space": [
    {
      "title": "2.8 Days to Disaster: Low Earth Orbit Could Collapse Without Warning - SciTechDaily",
      "pubDate": "Mon, 26 Jan 2026 03:01:21 GMT"
    }
  ],
  "Cyberattack": [
    {
      "title": "Enviro-Hub suffers from cyberattack - The Edge Singapore",
      "pubDate": "Mon, 26 Jan 2026 09:50:34 GMT"
    },
    {
      "title": "Nike Cyberattack: Company Probes Alleged 1.4TB Leak - The Cyber Express",
      "pubDate": "Tue, 27 Jan 2026 07:30:55 GMT"
    },
    {
      "title": "EU Discloses January Cyberattack That Exposed Some Staff Data - bloomberg.com",
      "pubDate": "Fri, 06 Feb 2026 21:34:08 GMT"
    }
  ],
  "Blockchain": [
    {
      "title": "Konni Hackers Deploy AI-Generated PowerShell Backdoor Against Blockchain Developers - The Hacker News",
      "pubDate": "Mon, 26 Jan 2026 08:54:00 GMT"
    }
  ],
  "Social Media": [
    {
      "title": "French MPs take first step to ban social media for under-15s - BBC",
      "pubDate": "Mon, 26 Jan 2026 21:46:41 GMT"
    },
    {
      "title": "Social Media Giants Face Landmark Legal Tests on Child Safety - The New York Times",
      "pubDate": "Tue, 27 Jan 2026 16:58:47 GMT"
    },
    {
      "title": "Elon Musk calls Spanish PM a ‘tyrant’ over plan to ban under-16s from social media and curb hateful content - The Guardian",
      "pubDate": "Wed, 04 Feb 2026 01:13:00 GMT"
    }
  ],
  "Immigration and Customs Enforcement": [
    {
      "title": "US to send ICE agents to Winter Olympics, prompting Italian anger - BBC",
      "pubDate": "Tue, 27 Jan 2026 19:13:55 GMT"
    }
  ],
  "Power Grid": [
    {
      "title": "The Race Against the Clock to Fix a Power Grid Meltdown - WSJ - The Wall Street Journal",
      "pubDate": "Tue, 27 Jan 2026 17:00:00 GMT"
    }
  ],
  "Mark Zuckerberg": [
    {
      "title": "Meta CEO Zuckerberg blocked curbs on sex-talking chatbots for minors, court filing alleges - Reuters",
      "pubDate": "Wed, 28 Jan 2026 03:14:00 GMT"
    }
  ],
  "United Nations Security Council": [
    {
      "title": "Somalia chairs U.N. Security Council for first time since 1972 - hiiraan.com",
      "pubDate": "Wed, 28 Jan 2026 20:27:26 GMT"
    }
  ],
  "James Webb Space Telescope": [
    {
      "title": "Dark matter shown in newest images from James Webb Space Telescope - USA Today",
      "pubDate": "Thu, 29 Jan 2026 02:35:00 GMT"
    }
  ],
  "Government Shutdown": [
    {
      "title": "Live updates: Democrats and White House reach deal to avert shutdown and fund Homeland Security for now - AP News",
      "pubDate": "Thu, 29 Jan 2026 23:37:00 GMT"
    },
    {
      "title": "Government Shutdown Update: Here’s When It Could End, According To House Leaders - Forbes",
      "pubDate": "Sun, 01 Feb 2026 15:54:13 GMT"
    },
    {
      "title": "Speaker Johnson is moving to end the shutdown by Tuesday — without Democratic support - Axios",
      "pubDate": "Mon, 02 Feb 2026 04:24:29 GMT"
    },
    {
      "title": "Government shutdown nears possible end as funding fight turns to the House - CBS News",
      "pubDate": "Tue, 03 Feb 2026 04:18:08 GMT"
    },
    {
      "title": "Congress ends shutdown, approves $1.2T in funding — and sets up DHS cliff - Politico",
      "pubDate": "Tue, 03 Feb 2026 19:27:29 GMT"
    }
  ],
  "Taiwan": [
    {
      "title": "Xi’s Military Purge May Set Back His Taiwan Ambitions - The New York Times",
      "pubDate": "Fri, 30 Jan 2026 08:40:00 GMT"
    },
    {
      "title": "US must be prudent when supplying arms to Taiwan, Xi tells Trump - BBC",
      "pubDate": "Thu, 05 Feb 2026 08:36:16 GMT"
    }
  ],
  "Automation": [
    {
      "title": "Physical AI becomes central to LG’s robotics and automation ambitions - Digital Watch Observatory",
      "pubDate": "Fri, 30 Jan 2026 08:35:00 GMT"
    }
  ],
  "Department of Justice": [
    {
      "title": "Justice Dept. Opens Civil Rights Investigation Into ICE Killing of Alex Pretti: Minnesota Live Updates - The New York Times",
      "pubDate": "Fri, 30 Jan 2026 17:44:45 GMT"
    },
    {
      "title": "DOJ releases tranche of Epstein files, says it has met its legal obligations - NPR",
      "pubDate": "Fri, 30 Jan 2026 22:32:13 GMT"
    },
    {
      "title": "January 30, 2026 — DOJ releases millions of pages of documents in Epstein investigation - CNN",
      "pubDate": "Sat, 31 Jan 2026 04:15:03 GMT"
    },
    {
      "title": "Epstein victims' lawyers ask court to order DOJ to take down Epstein files website - ABC News",
      "pubDate": "Mon, 02 Feb 2026 02:48:45 GMT"
    },
    {
      "title": "Key participant in 2012 Benghazi attack has been brought to U.S. to face charges, DOJ says - NBC News",
      "pubDate": "Fri, 06 Feb 2026 19:20:51 GMT"
    }
  ],
  "Trade War": [
    {
      "title": "Bombardier stock dives on Trump threats of 50% tariff on Canadian planes - Al Jazeera",
      "pubDate": "Fri, 30 Jan 2026 17:31:42 GMT"
    }
  ],
  "Space Debris": [
    {
      "title": "Out-of-control Chinese rocket crashes in ocean after UK prepped emergency alert - The Sun",
      "pubDate": "Fri, 30 Jan 2026 12:25:00 GMT"
    }
  ],
  "Epstein Files": [
    {
      "title": "Slovakia PM's national security adviser resigns over Epstein links - BBC",
      "pubDate": "Sun, 01 Feb 2026 08:37:23 GMT"
    },
    {
      "title": "Why are we not talking about Donald Trump in the Epstein files? | Trump100 - Sky News",
      "pubDate": "Tue, 03 Feb 2026 11:14:55 GMT"
    },
    {
      "title": "Melinda French Gates says Bill Gates 'has to answer' for being in the Epstein files - NBC News",
      "pubDate": "Tue, 03 Feb 2026 20:43:40 GMT"
    },
    {
      "title": "Jeffrey Epstein’s Money Mingled With Silicon Valley Start-Ups - The New York Times",
      "pubDate": "Thu, 05 Feb 2026 05:00:11 GMT"
    },
    {
      "title": "Latest Jeffrey Epstein file disclosures rock the rich and powerful: Top takeaways - NBC News",
      "pubDate": "Thu, 05 Feb 2026 17:41:00 GMT"
    },
    {
      "title": "Epstein built ties to Russians and sought to meet Putin, files show - The Washington Post",
      "pubDate": "Fri, 06 Feb 2026 11:32:02 GMT"
    },
    {
      "title": "What the Epstein Files Tell Us – And Don't Tell Us — About His Ties to Russia - The Moscow Times",
      "pubDate": "Fri, 06 Feb 2026 16:49:51 GMT"
    },
    {
      "title": "Members of Congress will be able to view unredacted Epstein files next week - NBC News",
      "pubDate": "Fri, 06 Feb 2026 22:58:06 GMT"
    },
    {
      "title": "How Epstein lured his victims: the women behind the black boxes - The Times",
      "pubDate": "Sat, 07 Feb 2026 22:15:00 GMT"
    }
  ],
  "Energy Storage": [
    {
      "title": "Tesla energy storage deployments jumped in ‘crucial AI transformation year'; company expects margin compression in 2026 - Energy-Storage.News",
      "pubDate": "Mon, 02 Feb 2026 09:27:08 GMT"
    },
    {
      "title": "Energy company develops massive 'bubble battery' that could revolutionize power grid: 'This is incredible' - The Cool Down",
      "pubDate": "Tue, 03 Feb 2026 05:40:00 GMT"
    }
  ],
  "Elections": [
    {
      "title": "Trump, in an Escalation, Calls for Republicans to ‘Nationalize’ Elections - The New York Times",
      "pubDate": "Mon, 02 Feb 2026 22:21:49 GMT"
    }
  ],
  "India": [
    {
      "title": "Trump Announces Initial Trade Deal With India, Cutting Tariffs to 18% - The New York Times",
      "pubDate": "Tue, 03 Feb 2026 00:37:12 GMT"
    }
  ],
  "Artemis Program": [
    {
      "title": "NASA rocket that will return astronauts to the moon hit by fuel leak during practice countdown - PBS",
      "pubDate": "Mon, 02 Feb 2026 21:44:21 GMT"
    }
  ],
  "Middle East": [
    {
      "title": "Seif al-Islam el-Qaddafi, Son of Libyan Dictator, Is Killed in Attack, Lawyer Says - The New York Times",
      "pubDate": "Tue, 03 Feb 2026 23:24:40 GMT"
    },
    {
      "title": "LIVE: Israeli attacks across Gaza kill 21 Palestinians since dawn - Al Jazeera",
      "pubDate": "Wed, 04 Feb 2026 10:57:12 GMT"
    }
  ],
  "US Foreign Policy": [
    {
      "title": "U.S.-Iran nuclear talks back on after Arab leaders lobby White House - Axios",
      "pubDate": "Wed, 04 Feb 2026 20:50:08 GMT"
    }
  ],
  "Anthropic": [
    {
      "title": "Anthropic's newest AI model uncovered 500 zero-day software flaws in testing - Axios",
      "pubDate": "Thu, 05 Feb 2026 17:45:12 GMT"
    }
  ],
  "Semiconductors": [
    {
      "title": "TSMC to make advanced AI semiconductors in Japan in boost for its chipmaking ambitions - The Tribune-Democrat",
      "pubDate": "Thu, 05 Feb 2026 10:41:00 GMT"
    }
  ],
  "Economic": [
    {
      "title": "January Layoffs Surge Across US, Jobs Report Says - Forbes",
      "pubDate": "Thu, 05 Feb 2026 15:38:54 GMT"
    }
  ],
  "Military Intelligence": [
    {
      "title": "Ukraine War, Day 1,443: Russia's Deputy Director of Military Intelligence Critically Wounded in Moscow Shooting - EA WorldView",
      "pubDate": "Fri, 06 Feb 2026 16:25:53 GMT"
    },
    {
      "title": "Russia detains suspect in shooting of top military intelligence officer in Moscow - TRT World",
      "pubDate": "Sun, 08 Feb 2026 11:37:43 GMT"
    }
  ],
  "Europe": [
    {
      "title": "Europe Accuses TikTok of ‘Addictive Design’ and Pushes for Change - The New York Times",
      "pubDate": "Fri, 06 Feb 2026 12:06:58 GMT"
    }
  ],
  "Drone Warfare": [
    {
      "title": "Deadly attacks hit Kordofan as scrutiny grows over drone warfare in Sudan - Radio Dabanga",
      "pubDate": "Fri, 06 Feb 2026 19:37:18 GMT"
    }
  ],
  "Universe": [
    {
      "title": "'Invisible scaffolding of the universe' revealed in ambitious new James Webb telescope images - Live Science",
      "pubDate": "Fri, 06 Feb 2026 22:04:42 GMT"
    }
  ],
  "Economics": [
    {
      "title": "Dow surges 1,200 points for first close above 50,000 in sharp rebound from tech rout: Live updates - CNBC",
      "pubDate": "Fri, 06 Feb 2026 19:49:36 GMT"
    }
  ],
  "Autonomous Vehicles": [
    {
      "title": "Waymo Reveals Its Driverless Cars Are \"Guided\" By Remote Workers In Philippines: \"Phone-A-Friend\" - NDTV",
      "pubDate": "Sun, 08 Feb 2026 13:47:19 GMT"
    }
  ],
  "Japan": [
    {
      "title": "Japan's governing party on course for landslide election win - BBC",
      "pubDate": "Sun, 08 Feb 2026 16:52:15 GMT"
    }
  ]
}