{
  "donald_trump": [
    {
      "title": "Musk says he regrets some posts he made about Trump - Reuters",
      "pubDate": "Wed, 11 Jun 2025 07:25:26 GMT"
    },
    {
      "title": "Live updates: Trump announces finalized trade deal with China, says tariffs on Chinese goods go to 55% - AP News",
      "pubDate": "Wed, 11 Jun 2025 15:48:00 GMT"
    },
    {
      "title": "Trump is under water on some of his top issues — including immigration, poll shows - Politico",
      "pubDate": "Wed, 11 Jun 2025 19:53:53 GMT"
    },
    {
      "title": "White House accuses Newsom and Bass of fanning flames, siding with criminals - The Washington Post",
      "pubDate": "Thu, 12 Jun 2025 03:19:45 GMT"
    },
    {
      "title": "Musk backtracks on Trump criticism after White House outreach - Reuters",
      "pubDate": "Thu, 12 Jun 2025 00:24:00 GMT"
    },
    {
      "title": "Majorities in key U.S. allies have no confidence in Trump's global leadership - NPR",
      "pubDate": "Thu, 12 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Prices for common baby items are rising due to Trump's tariffs, congressional analysis says - CNBC",
      "pubDate": "Thu, 12 Jun 2025 19:44:35 GMT"
    },
    {
      "title": "Trump vows changes to immigration crackdown to protect migrant farmers, hotel workers - USA Today",
      "pubDate": "Thu, 12 Jun 2025 16:41:16 GMT"
    },
    {
      "title": "Trump promises immigration order soon on farm and leisure workers - Reuters",
      "pubDate": "Thu, 12 Jun 2025 21:34:12 GMT"
    },
    {
      "title": "Trump urges Iran to reach nuclear deal 'before there is nothing left' - CNBC",
      "pubDate": "Fri, 13 Jun 2025 10:29:45 GMT"
    },
    {
      "title": "Judge rules Trump’s firings at federal product safety agency illegal - The Hill",
      "pubDate": "Fri, 13 Jun 2025 18:16:00 GMT"
    },
    {
      "title": "Trump Live Updates: Latest News on Tariffs, Voter ID and More - The New York Times",
      "pubDate": "Sat, 14 Jun 2025 03:25:00 GMT"
    },
    {
      "title": "Trump's financial disclosures reveal tens of millions in income from guitars, bibles and watches with his name on them - NBC News",
      "pubDate": "Fri, 13 Jun 2025 22:48:00 GMT"
    },
    {
      "title": "Democrats engage in ‘treacherous’ fight with Trump on immigration, protests - The Washington Post",
      "pubDate": "Sat, 14 Jun 2025 14:32:10 GMT"
    },
    {
      "title": "‘This moment was thrust upon him’: Gavin Newsom steps up to parry Trump’s ‘wrecking ball’ attacks on American democracy - The Guardian",
      "pubDate": "Sat, 14 Jun 2025 15:34:00 GMT"
    },
    {
      "title": "Anti-Trump protests held across US as president attends military parade - CNN",
      "pubDate": "Sun, 15 Jun 2025 03:20:00 GMT"
    },
    {
      "title": "D.C. onlookers line streets for Trump military parade; 'No Kings' protests unfold nationwide - NBC News",
      "pubDate": "Sun, 15 Jun 2025 04:46:00 GMT"
    },
    {
      "title": "Poll: Americans disapprove of Trump's performance, as Republicans manage splits over spending plans - NBC News",
      "pubDate": "Sun, 15 Jun 2025 13:00:00 GMT"
    },
    {
      "title": "Trump coveted a military spectacle but his parade proved underwhelming: ‘Just kind of lame’ - The Guardian",
      "pubDate": "Sun, 15 Jun 2025 14:44:00 GMT"
    },
    {
      "title": "Trump administration weighs adding 36 countries to travel ban, memo says - Reuters",
      "pubDate": "Sun, 15 Jun 2025 21:00:47 GMT"
    },
    {
      "title": "Trump orders ICE to ramp up deportations in Democratic stronghold cities - France 24",
      "pubDate": "Mon, 16 Jun 2025 02:22:38 GMT"
    },
    {
      "title": "‘Extremely disturbing and unethical’: new rules allow VA doctors to refuse to treat Democrats, unmarried veterans - The Guardian",
      "pubDate": "Mon, 16 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Trump Organization enters mobile phone business - BBC",
      "pubDate": "Mon, 16 Jun 2025 20:10:33 GMT"
    },
    {
      "title": "Trump team proposes Iran talks this week on nuclear deal, ceasefire - Axios",
      "pubDate": "Tue, 17 Jun 2025 02:51:18 GMT"
    },
    {
      "title": "Israel-Iran live updates: Trump heads to Situation Room as Middle East tensions escalate, sources say - ABC News",
      "pubDate": "Tue, 17 Jun 2025 08:25:53 GMT"
    },
    {
      "title": "Israel and Iran strikes continue into fifth day as Trump demands ‘complete give-up’ by Tehran – latest updates - The Guardian",
      "pubDate": "Tue, 17 Jun 2025 15:44:41 GMT"
    },
    {
      "title": "Live updates: Trump says the US knows where Iran's leader is hiding but won't kill him — 'for now' - AP News",
      "pubDate": "Tue, 17 Jun 2025 20:48:00 GMT"
    },
    {
      "title": "LIVE: Israel-Iran attacks continue; Trump demands unconditional surrender - Al Jazeera",
      "pubDate": "Wed, 18 Jun 2025 07:22:28 GMT"
    },
    {
      "title": "Trump's Latest Statement On India-Pak Ceasefire, Hours After PM Call - NDTV",
      "pubDate": "Wed, 18 Jun 2025 15:29:44 GMT"
    },
    {
      "title": "Israel, Iran Trade New Strikes As US Prepares For Possible Attack On Tehran: 10 Points - NDTV",
      "pubDate": "Thu, 19 Jun 2025 02:25:43 GMT"
    },
    {
      "title": "Trump faces uproar from MAGA base over possible Iran strike - Reuters",
      "pubDate": "Thu, 19 Jun 2025 01:09:00 GMT"
    },
    {
      "title": "Trump rips into 'too late' Jerome Powell after Fed holds rates steady - CNBC",
      "pubDate": "Thu, 19 Jun 2025 15:04:14 GMT"
    },
    {
      "title": "How Trump, a self-proclaimed \"peacemaker,\" embraced Israel's campaign against Iran - Reuters",
      "pubDate": "Thu, 19 Jun 2025 18:12:21 GMT"
    },
    {
      "title": "Juneteenth Goes Uncelebrated at White House as Trump Complains About ‘Too Many’ Holidays - The New York Times",
      "pubDate": "Fri, 20 Jun 2025 02:40:03 GMT"
    },
    {
      "title": "Trump’s new two-week negotiating window sets off scramble to restart stalled Iran talks - CNN",
      "pubDate": "Thu, 19 Jun 2025 23:19:00 GMT"
    },
    {
      "title": "Trump Isn’t Engaging In “Strategic Ambiguity” on Iran. It’s Something Much More Dangerous. - Slate Magazine",
      "pubDate": "Fri, 20 Jun 2025 15:00:00 GMT"
    },
    {
      "title": "A judge sided with Trump. Behind the scenes, he was lobbying for a nomination. - Politico",
      "pubDate": "Fri, 20 Jun 2025 20:23:21 GMT"
    },
    {
      "title": "As Trump floats special prosecutor on 2020, he should be careful what he wishes for - MSNBC News",
      "pubDate": "Fri, 20 Jun 2025 16:12:03 GMT"
    },
    {
      "title": "From ‘evacuate Tehran’ to ‘two weeks’: Behind Trump’s shift on Iran - The Washington Post",
      "pubDate": "Sat, 21 Jun 2025 06:11:05 GMT"
    },
    {
      "title": "Trump wants one thing from the NATO summit. Europe is going to give it to him. - Politico",
      "pubDate": "Sat, 21 Jun 2025 11:00:00 GMT"
    }
  ],
  "ukraine": [
    {
      "title": "Ukraine launches major drone attack on Russian bombers, security official says - The Guardian",
      "pubDate": "Sun, 01 Jun 2025 14:01:00 GMT"
    },
    {
      "title": "Ukraine’s drone attack the latest in a series of daring David versus Goliath hits against Russian targets - CNN",
      "pubDate": "Mon, 02 Jun 2025 08:25:00 GMT"
    },
    {
      "title": "Ukraine says it has struck bridge connecting Russia to Crimea with underwater explosives - The Hill",
      "pubDate": "Tue, 03 Jun 2025 14:43:00 GMT"
    },
    {
      "title": "Ukraine's massive drone attack deep inside Russia highlights how both have changed battlefield tactics - NBC News",
      "pubDate": "Tue, 03 Jun 2025 20:30:33 GMT"
    },
    {
      "title": "A drone strike devastated Russia’s air force. The U.S. is vulnerable, too. - The Washington Post",
      "pubDate": "Wed, 04 Jun 2025 14:58:27 GMT"
    },
    {
      "title": "China helps Russia pull ahead in lethal drone war race with Ukraine - politico.eu",
      "pubDate": "Thu, 05 Jun 2025 02:26:02 GMT"
    },
    {
      "title": "Ukraine war live: Putin launches glide bomb strike on key city after revenge warning - The Independent",
      "pubDate": "Thu, 05 Jun 2025 09:27:27 GMT"
    },
    {
      "title": "Ukraine claims to have damaged Russian fighter jets in night-time raid - The Guardian",
      "pubDate": "Mon, 09 Jun 2025 09:42:00 GMT"
    },
    {
      "title": "Russia fires record 479 drones at Ukraine overnight, Kyiv says - France 24",
      "pubDate": "Mon, 09 Jun 2025 10:14:12 GMT"
    },
    {
      "title": "Ukraine drone attack on Russia’s Tatarstan region leaves at least 1 dead, 13 injured - The Washington Post",
      "pubDate": "Sun, 15 Jun 2025 15:37:13 GMT"
    }
  ],
  "recession": [
    {
      "title": "Most CEOs aren't expecting a recession anytime soon, survey finds - CBS News",
      "pubDate": "Tue, 10 Jun 2025 15:10:12 GMT"
    },
    {
      "title": "How a U.S. recession could upend the travel industry - TheStreet",
      "pubDate": "Tue, 10 Jun 2025 14:13:04 GMT"
    },
    {
      "title": "Goldman Sachs Predicts Stock Market Rally, Says Recession ‘Not in the Base Case’ – Here’s Why - The Daily Hodl",
      "pubDate": "Tue, 10 Jun 2025 18:42:13 GMT"
    },
    {
      "title": "U.S. economy to avoid recession even after tariff hike - Wells Fargo (SP500:S&P Complete Indices) - Seeking Alpha",
      "pubDate": "Wed, 11 Jun 2025 08:40:00 GMT"
    },
    {
      "title": "US-China relations improve, yet industrial recession remains likely - Oxford Economics",
      "pubDate": "Wed, 11 Jun 2025 09:37:42 GMT"
    },
    {
      "title": "Unemployment Claims and the CLF as a Recession Indicator: May 2025 - Advisor Perspectives",
      "pubDate": "Wed, 11 Jun 2025 18:10:43 GMT"
    },
    {
      "title": "JPMorgan CEO Warns of Potential U.S. Economic Recession Risks - GuruFocus",
      "pubDate": "Thu, 12 Jun 2025 00:10:21 GMT"
    },
    {
      "title": "Recession not imminent in Eurozone, big four: Oxford Economics - Fibre2Fashion",
      "pubDate": "Thu, 12 Jun 2025 02:50:07 GMT"
    },
    {
      "title": "Goldman Sachs trims 12-month US recession probability to 30% - MSN",
      "pubDate": "Thu, 12 Jun 2025 15:10:43 GMT"
    },
    {
      "title": "WA agencies see largest wave of layoffs since Great Recession - The Seattle Times",
      "pubDate": "Thu, 12 Jun 2025 13:00:00 GMT"
    },
    {
      "title": "US Recession Fears Are Finally Cooling Off: Risk Drops to Just 25% - The Tradable",
      "pubDate": "Thu, 12 Jun 2025 19:56:02 GMT"
    },
    {
      "title": "Podcast: US Recession Threat Is Back—and Maybe Something Worse - Bloomberg",
      "pubDate": "Fri, 13 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "Recession already underway, market still asleep, Rosenberg warns - KITCO",
      "pubDate": "Fri, 13 Jun 2025 09:57:00 GMT"
    },
    {
      "title": "Steve Hanke Forecasts US Recession and Urges Policy Shift – Here’s Why - BeInCrypto",
      "pubDate": "Fri, 13 Jun 2025 16:09:25 GMT"
    },
    {
      "title": "Some Basic Math on Why I Think the Recession Likelihood Is Greater than 30% - Econbrowser",
      "pubDate": "Fri, 13 Jun 2025 22:23:21 GMT"
    },
    {
      "title": "'Bigger risk of recession': Expert says 'White House should be worried' about Middle East - MSN",
      "pubDate": "Fri, 13 Jun 2025 21:24:41 GMT"
    },
    {
      "title": "The optimism recession: Why American workforce is worried now more than ever despite stable jobs - Times of India",
      "pubDate": "Sat, 14 Jun 2025 11:00:00 GMT"
    },
    {
      "title": "Hair Stylists Are Bracing For A Recession — And Noticing A Hot New Trend With Clients - HuffPost",
      "pubDate": "Sat, 14 Jun 2025 11:00:17 GMT"
    },
    {
      "title": "Economist's View: Hard data versus soft and what to watch going forward - Pittsburgh Post-Gazette",
      "pubDate": "Sun, 15 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "MOScout Sunday6: Partisan Views of Discrimination - Stable Americans - Slow Down, but no Recession and more… - Missouri Scout",
      "pubDate": "Sun, 15 Jun 2025 11:53:50 GMT"
    },
    {
      "title": "Ex-Fed Adviser Flags Israel-Iran Tensions As ‘Wild Card,’ Says Recession Odds Ticking Up - MSN",
      "pubDate": "Mon, 16 Jun 2025 05:49:57 GMT"
    },
    {
      "title": "Why Stock Investors Shouldn't Bet On A Recession - Seeking Alpha",
      "pubDate": "Mon, 16 Jun 2025 14:06:00 GMT"
    },
    {
      "title": "‘Worse than a recession’: Billionaire investor Ray Dalio sounds alarm on Trump’s economic agenda - MSN",
      "pubDate": "Mon, 16 Jun 2025 17:41:19 GMT"
    },
    {
      "title": "'Devastated:' Cheap tacos, H-E-B products lamented as 'recession indicators' - MySA",
      "pubDate": "Tue, 17 Jun 2025 01:05:51 GMT"
    },
    {
      "title": "U.S. Treasury yields slide after retail sales tumbled in May, raising recession fear - CNBC",
      "pubDate": "Tue, 17 Jun 2025 08:13:21 GMT"
    },
    {
      "title": "Expert dismisses recession fears: ‘I don’t see anything like that’ - Fox Business",
      "pubDate": "Tue, 17 Jun 2025 16:36:53 GMT"
    },
    {
      "title": "Japan’s exports drop raises recession risks as U.S. tariffs bite - The Japan Times",
      "pubDate": "Wed, 18 Jun 2025 02:19:00 GMT"
    },
    {
      "title": "Managers bullish as fears about trade war, recession abate — BofA survey - Pensions & Investments",
      "pubDate": "Tue, 17 Jun 2025 21:30:56 GMT"
    },
    {
      "title": "Food, Water, And Recession: What Developing Countries Worry About The Most - 24/7 Wall St.",
      "pubDate": "Wed, 18 Jun 2025 10:43:52 GMT"
    },
    {
      "title": "'Big Short' investor warns the precarious tariff environment reminds him of WWI—and a trade war would send the U.S. into a recession - Fortune",
      "pubDate": "Wed, 18 Jun 2025 18:22:52 GMT"
    },
    {
      "title": "Americans Are Side Hustling Like We’re in a Recession - WSJ",
      "pubDate": "Thu, 19 Jun 2025 01:00:00 GMT"
    },
    {
      "title": "New Zealand’s Economic Recovery Gathers Pace as Exports Jump - Bloomberg.com",
      "pubDate": "Wed, 18 Jun 2025 23:11:16 GMT"
    },
    {
      "title": "Russia needs monetary policy changes to avert a recession, says economy minister - Reuters",
      "pubDate": "Thu, 19 Jun 2025 10:28:04 GMT"
    },
    {
      "title": "Russia 'on the verge' of recession, Kremlin economy minister warns - The Kyiv Independent",
      "pubDate": "Thu, 19 Jun 2025 09:35:12 GMT"
    },
    {
      "title": "Russian economic minister acknowledges nation is ‘on the brink’ of ‘recession’ - Washington Examiner",
      "pubDate": "Thu, 19 Jun 2025 16:52:16 GMT"
    },
    {
      "title": "Russia's economy minister: Country on brink of recession - timesdaily.com",
      "pubDate": "Fri, 20 Jun 2025 05:00:00 GMT"
    },
    {
      "title": "US leading indicators slip in May, triggering recession signal, Conference Board says - TradingView",
      "pubDate": "Fri, 20 Jun 2025 14:23:21 GMT"
    },
    {
      "title": "Putin says he won’t allow Russia to fall into recession amid warnings - The Washington Post",
      "pubDate": "Fri, 20 Jun 2025 20:41:42 GMT"
    },
    {
      "title": "Stock Market News Review: SPY, QQQ Slip as Recession Signal Flashes, Fed Officials Split on Rate Cuts - TipRanks",
      "pubDate": "Fri, 20 Jun 2025 20:45:39 GMT"
    },
    {
      "title": "Ray Dalio’s ‘worse than a recession’ caution has some edgy — here’s his ‘Holy Grail’ of strategies in a crisis - Yahoo Finance",
      "pubDate": "Sat, 21 Jun 2025 11:17:00 GMT"
    }
  ],
  "russia": [
    {
      "title": "Russia says U.S. Golden Dome project undermines strategic stability - Reuters",
      "pubDate": "Tue, 27 May 2025 09:23:13 GMT"
    },
    {
      "title": "Russia launches deadly drone and missile strikes days after Ukraine’s audacious attack on bomber fleet - CNN",
      "pubDate": "Fri, 06 Jun 2025 08:52:00 GMT"
    },
    {
      "title": "White House Quietly Pressures Senate to Water Down Russia Sanctions - WSJ",
      "pubDate": "Fri, 06 Jun 2025 16:31:00 GMT"
    },
    {
      "title": "Germany plans rapid bunker expansion amid fears of Russian attack - The Guardian",
      "pubDate": "Sat, 07 Jun 2025 15:00:00 GMT"
    },
    {
      "title": "Russia shoots down 10 Ukrainian drones targeting Moscow - Al Jazeera",
      "pubDate": "Sun, 08 Jun 2025 09:13:42 GMT"
    },
    {
      "title": "Russian forces claim new advance deeper into Ukraine, amid dispute over dead soldiers - CNN",
      "pubDate": "Sun, 08 Jun 2025 23:18:00 GMT"
    },
    {
      "title": "Russian Offensive Campaign Assessment, June 8, 2025 - Institute for the Study of War",
      "pubDate": "Sun, 08 Jun 2025 22:43:39 GMT"
    },
    {
      "title": "Europe heaps harsh sanctions on Russia, saying ‘strength is the only language’ Moscow understands - CNN",
      "pubDate": "Tue, 10 Jun 2025 18:51:00 GMT"
    },
    {
      "title": "Russia says it's ready to remove highly enriched uranium from Iran - Reuters",
      "pubDate": "Wed, 11 Jun 2025 11:52:59 GMT"
    },
    {
      "title": "Ukraine war: 1,212 soldiers' bodies repatriated in latest swap with Russia - BBC",
      "pubDate": "Wed, 11 Jun 2025 16:50:02 GMT"
    },
    {
      "title": "Russia is shifting tactics again, assaulting Ukrainian cities with swarms of killer drones - CNN",
      "pubDate": "Sun, 15 Jun 2025 04:01:00 GMT"
    },
    {
      "title": "Russian strike hit Boeing office in Kyiv in deliberate attack on US business, FT reports - The Kyiv Independent",
      "pubDate": "Sun, 15 Jun 2025 14:16:23 GMT"
    },
    {
      "title": "G7 needs to raise pressure on Russia, von der Leyen says - Reuters",
      "pubDate": "Mon, 16 Jun 2025 02:54:25 GMT"
    },
    {
      "title": "EU leaders call for tougher sanctions on Russia at G7 summit - The Kyiv Independent",
      "pubDate": "Mon, 16 Jun 2025 06:56:15 GMT"
    },
    {
      "title": "The Kerch Bridge is ‘doomed’ - Al Jazeera",
      "pubDate": "Mon, 16 Jun 2025 09:34:12 GMT"
    },
    {
      "title": "Russia's deadliest attack on Kyiv for months kills 15 and wounds dozens - BBC",
      "pubDate": "Tue, 17 Jun 2025 10:31:00 GMT"
    },
    {
      "title": "EU's top diplomat warns that Russia has a plan for long-term aggression against Europe - ABC News",
      "pubDate": "Wed, 18 Jun 2025 11:35:57 GMT"
    },
    {
      "title": "Russia tells US not to strike Iran, warns of nuclear catastrophe - Reuters",
      "pubDate": "Wed, 18 Jun 2025 13:33:56 GMT"
    }
  ],
  "inflation": [
    {
      "title": "The economic outlook is back to square one, despite months of upheaval - Axios",
      "pubDate": "Mon, 16 Jun 2025 16:20:55 GMT"
    },
    {
      "title": "Norwegian crown slides after surprise interest rate cut - Reuters",
      "pubDate": "Thu, 19 Jun 2025 08:11:03 GMT"
    }
  ],
  "cybersecurity": [
    {
      "title": "This cybersecurity play that’s up more than 40% in 2025 has room to run, managing partner says - CNBC",
      "pubDate": "Tue, 03 Jun 2025 19:51:26 GMT"
    },
    {
      "title": "Trump Signs Order Amending Parts of Biden, Obama Cybersecurity Orders - NTD News",
      "pubDate": "Sat, 07 Jun 2025 17:05:02 GMT"
    },
    {
      "title": "Amazon Whole Foods Distributor Breach Disrupts Deliveries - Bloomberg.com",
      "pubDate": "Mon, 09 Jun 2025 21:36:43 GMT"
    },
    {
      "title": "EU to ‘step up’ on cyber security as dependence on US laid bare - ft.com",
      "pubDate": "Tue, 10 Jun 2025 04:03:32 GMT"
    },
    {
      "title": "Cybersecurity Alert: 16 billion credentials leaked in largest-ever data breach - Deccan Herald",
      "pubDate": "Fri, 20 Jun 2025 08:10:19 GMT"
    }
  ],
  "artificial_intelligence": [
    {
      "title": "The rise of artificial intelligence can make college degrees 'out of date': Upskill in AI or fall behind, says expert - CNBC",
      "pubDate": "Wed, 11 Jun 2025 06:15:34 GMT"
    },
    {
      "title": "The war is on for Congress’ AI law ban - The Verge",
      "pubDate": "Wed, 11 Jun 2025 15:00:00 GMT"
    },
    {
      "title": "Nvidia CEO Rebuts Anthropic CEO’s Dire Prediction of AI Taking Jobs - PYMNTS.com",
      "pubDate": "Wed, 11 Jun 2025 20:25:53 GMT"
    },
    {
      "title": "‘This is coming for everyone’: A new kind of AI bot takes over the web - The Washington Post",
      "pubDate": "Thu, 12 Jun 2025 03:12:08 GMT"
    },
    {
      "title": "OpenAI’s Sam Altman: AI may already have surpassed human intelligence - MarketWatch",
      "pubDate": "Thu, 12 Jun 2025 08:41:00 GMT"
    },
    {
      "title": "Google DeepMind just changed hurricane forecasting forever with new AI model - VentureBeat",
      "pubDate": "Thu, 12 Jun 2025 15:00:00 GMT"
    },
    {
      "title": "Joint Commission teams with CHAI on artificial intelligence guidance for health systems - Healthcare IT News",
      "pubDate": "Thu, 12 Jun 2025 15:59:38 GMT"
    },
    {
      "title": "This Incredibly Cheap Artificial Intelligence (AI) Chip Stock Wants to Become the Next Broadcom - Yahoo Finance",
      "pubDate": "Fri, 13 Jun 2025 00:56:24 GMT"
    },
    {
      "title": "AI digital transformation: reshaping organizations, work, and our global future - imd.org",
      "pubDate": "Fri, 13 Jun 2025 07:34:03 GMT"
    },
    {
      "title": "Meta poaches 28-year-old Scale AI CEO after taking multibillion dollar stake in startup - Reuters",
      "pubDate": "Fri, 13 Jun 2025 11:53:25 GMT"
    },
    {
      "title": "New Hampshire jury acquits consultant behind AI robocalls mimicking Biden on all charges - CBS News",
      "pubDate": "Fri, 13 Jun 2025 20:05:40 GMT"
    },
    {
      "title": "The Deficit Narrative May Find Its Cure In Artificial Intelligence - Seeking Alpha",
      "pubDate": "Fri, 13 Jun 2025 18:00:00 GMT"
    },
    {
      "title": "TotalEnergies to Collaborate with Mistral AI to Increase the Application of Artificial Intelligence in its Multi-Energy Strategy - TotalEnergies.com",
      "pubDate": "Sat, 14 Jun 2025 05:11:38 GMT"
    },
    {
      "title": "How Artificial Intelligence Can Analyze Market Sentiment to Decrypt Public Opinion - Insider Monkey",
      "pubDate": "Sat, 14 Jun 2025 12:44:15 GMT"
    },
    {
      "title": "Artificial intelligence consumes massive amounts of energy. Here's why - Le Monde.fr",
      "pubDate": "Sat, 14 Jun 2025 18:30:05 GMT"
    },
    {
      "title": "Meet Goku, the Chinese quant fund with AI ambitions beyond finance - South China Morning Post",
      "pubDate": "Sun, 15 Jun 2025 01:00:18 GMT"
    },
    {
      "title": "AI and future of jobs: Here’s what top tech CEOs Sam Altman, Jensen Huang are saying - The Indian Express",
      "pubDate": "Sun, 15 Jun 2025 15:14:00 GMT"
    },
    {
      "title": "\"Summoning the demon\": Steve Bannon stokes fear of an AI \"apocalypse\" - Salon.com",
      "pubDate": "Sun, 15 Jun 2025 09:45:00 GMT"
    },
    {
      "title": "EU’s waffle on artificial intelligence law creates huge headache - politico.eu",
      "pubDate": "Mon, 16 Jun 2025 02:34:46 GMT"
    },
    {
      "title": "Workplace Artificial Intelligence Use Has Doubled in Two Years - Bloomberg Law News",
      "pubDate": "Mon, 16 Jun 2025 04:01:00 GMT"
    },
    {
      "title": "Alibaba launches new Qwen3 AI models for Apple's MLX architecture - Reuters",
      "pubDate": "Mon, 16 Jun 2025 14:36:15 GMT"
    },
    {
      "title": "AI Stocks Face 'Show Me' Moment: Meta, Nvidia, CoreWeave Flex Muscles - Investor's Business Daily",
      "pubDate": "Mon, 16 Jun 2025 11:25:00 GMT"
    },
    {
      "title": "OpenAI CFO Says ‘Secret’ Device to Usher in New Computing Era - PYMNTS.com",
      "pubDate": "Mon, 16 Jun 2025 18:44:58 GMT"
    },
    {
      "title": "Artificial intelligence-derived retinal age gap as a marker for reproductive aging in women - Nature",
      "pubDate": "Mon, 16 Jun 2025 23:01:01 GMT"
    },
    {
      "title": "Artificial intelligence may cause mass unemployment, says Geoffrey Hinton; 'Godfather of AI' reveals 'safe' jobs - Mint",
      "pubDate": "Tue, 17 Jun 2025 14:04:12 GMT"
    },
    {
      "title": "'Artificial intelligence is not a miracle cure': Nobel laureate raises questions about AI-generated image of black hole spinning at the heart of our galaxy - Live Science",
      "pubDate": "Tue, 17 Jun 2025 16:51:38 GMT"
    },
    {
      "title": "Amazon CEO tells employees that AI will shrink its workforce - The Washington Post",
      "pubDate": "Wed, 18 Jun 2025 03:16:53 GMT"
    },
    {
      "title": "Congress Should Not Block State Action on AI - Governing",
      "pubDate": "Wed, 18 Jun 2025 04:04:11 GMT"
    },
    {
      "title": "This artificial intelligence subcategory is undergoing a 'golden age,' says long-time tech analyst Dan Ives - CNBC",
      "pubDate": "Wed, 18 Jun 2025 12:43:32 GMT"
    },
    {
      "title": "‘It’s terrifying’: WhatsApp AI helper mistakenly shares user’s number - The Guardian",
      "pubDate": "Wed, 18 Jun 2025 17:56:00 GMT"
    },
    {
      "title": "Governments Want Artificial Intelligence, but Adoption Lags - GovTech",
      "pubDate": "Wed, 18 Jun 2025 21:36:34 GMT"
    },
    {
      "title": "Artificial Intelligence Market Size Worth USD 3,680.47 Bn By 2034 - GlobeNewswire",
      "pubDate": "Thu, 19 Jun 2025 15:43:12 GMT"
    },
    {
      "title": "I am an AI expert and here's why quantum artificial intelligence is the next big thing in tech - TechRadar",
      "pubDate": "Thu, 19 Jun 2025 08:58:26 GMT"
    },
    {
      "title": "UN says use of artificial intelligence must comply with international human rights - JURIST Legal News",
      "pubDate": "Thu, 19 Jun 2025 23:17:06 GMT"
    },
    {
      "title": "How Artificial Intelligence Is Changing Journalism: From Headlines to Deep Analysis - Modern Diplomacy",
      "pubDate": "Fri, 20 Jun 2025 08:39:54 GMT"
    },
    {
      "title": "Pope Leo XIV flags AI impact on kids' intellectual and spiritual development - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Fri, 20 Jun 2025 12:17:20 GMT"
    },
    {
      "title": "'It's crazy': Bay Area tech's hottest job market just hit an absurd intensity - SFGATE",
      "pubDate": "Fri, 20 Jun 2025 19:45:38 GMT"
    },
    {
      "title": "Apple Executives Have Held Internal Talks About Buying AI Startup Perplexity - Bloomberg",
      "pubDate": "Fri, 20 Jun 2025 22:35:57 GMT"
    },
    {
      "title": "Apple sued by shareholders for allegedly overstating AI progress - Reuters",
      "pubDate": "Fri, 20 Jun 2025 21:08:08 GMT"
    },
    {
      "title": "MAHA Initiative Analysis Highlights Role of Artificial Intelligence and Biomarkers in Drug Regulation - geneonline.com",
      "pubDate": "Sat, 21 Jun 2025 09:25:17 GMT"
    }
  ],
  "financial_markets": [
    {
      "title": "The U.S. dollar hasn't been this weak in 3 years. What that means for stock investors - CNBC",
      "pubDate": "Thu, 12 Jun 2025 20:00:02 GMT"
    },
    {
      "title": "Stock market today: Dow, S&P 500, Nasdaq futures sink, oil surges as Israel launches strike against Iran - Yahoo Finance",
      "pubDate": "Fri, 13 Jun 2025 00:56:44 GMT"
    },
    {
      "title": "Israel-Iran clash delivers a fresh shock to investors. History suggests this is the move to make. - MarketWatch",
      "pubDate": "Fri, 13 Jun 2025 10:30:00 GMT"
    },
    {
      "title": "Dow falls more than 700 points on Friday as attacks between Israel and Iran escalate: Live updates - CNBC",
      "pubDate": "Fri, 13 Jun 2025 20:24:00 GMT"
    },
    {
      "title": "Household loans continue to increase in June on heated housing, stock markets - Yonhap News Agency",
      "pubDate": "Sun, 15 Jun 2025 02:07:43 GMT"
    },
    {
      "title": "Financial Markets Daily Report 17 June 2025 - caixabankresearch.com",
      "pubDate": "Tue, 17 Jun 2025 07:10:21 GMT"
    },
    {
      "title": "The market's recovery to near-record high has been led by momentum stock 'freight train' - Yahoo Finance",
      "pubDate": "Tue, 17 Jun 2025 19:19:08 GMT"
    },
    {
      "title": "Oil Prices Rally, Stock Futures Fall in Holiday-Thinned Trading - WSJ",
      "pubDate": "Thu, 19 Jun 2025 16:26:00 GMT"
    },
    {
      "title": "Patience is key in markets as global uncertainties test new investors: Raamdeo Agrawal - The Economic Times",
      "pubDate": "Sat, 21 Jun 2025 08:29:31 GMT"
    }
  ],
  "us_foreign_policy": [
    {
      "title": "These historians oversee unbiased accounts of U.S. foreign policy. Trump fired them all. - The Washington Post",
      "pubDate": "Wed, 28 May 2025 15:28:06 GMT"
    },
    {
      "title": "Judge says US effort to deport Mahmoud Khalil on foreign policy grounds is likely unconstitutional - Decatur Daily",
      "pubDate": "Thu, 29 May 2025 17:32:00 GMT"
    },
    {
      "title": "International Hotel Giants Are Profiting Despite Genocide in Xinjiang - Foreign Policy",
      "pubDate": "Mon, 02 Jun 2025 19:37:46 GMT"
    },
    {
      "title": "Powering Diplomacy: How Energy Politics Shapes The Foreign Policy Of Great Powers – Analysis - Eurasia Review",
      "pubDate": "Mon, 02 Jun 2025 23:14:12 GMT"
    },
    {
      "title": "Turkey’s State Broadcaster TRT May Have Violated U.S. Foreign Agent Law - Middle East Forum",
      "pubDate": "Thu, 05 Jun 2025 21:36:20 GMT"
    },
    {
      "title": "Trump’s New Diplomacy: How Tariffs Can Reshape US Foreign Policy - Fair Observer",
      "pubDate": "Sat, 07 Jun 2025 10:09:00 GMT"
    },
    {
      "title": "The New Balance of Power in the Middle East: America, Iran, and the Emerging Arabian Axis - Foreign Affairs",
      "pubDate": "Tue, 10 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "US Ambassador: A Palestinian State No Longer a Goal of American Foreign Policy - وطن. يغرد خارج السرب",
      "pubDate": "Tue, 10 Jun 2025 16:47:11 GMT"
    },
    {
      "title": "America moves closer to the brink of maximum uncertainty at home and abroad - Middle East Institute",
      "pubDate": "Wed, 11 Jun 2025 19:09:01 GMT"
    },
    {
      "title": "Security for Resources: A New Era in Foreign Policy and Critical Mineral Diplomacy - Modern Diplomacy",
      "pubDate": "Sat, 14 Jun 2025 04:00:07 GMT"
    },
    {
      "title": "‘Not our war’: bipartisan US lawmakers back resolution to block involvement in Iran - The Guardian",
      "pubDate": "Tue, 17 Jun 2025 18:59:00 GMT"
    }
  ],
  "trade_war": [
    {
      "title": "Germany’s Merz Says US Tech Perks Could Be Target in Trade War - Bloomberg.com",
      "pubDate": "Mon, 26 May 2025 12:20:20 GMT"
    },
    {
      "title": "Trump rows back tariff threat to agree EU trade-talk extension - Al Jazeera",
      "pubDate": "Mon, 26 May 2025 10:10:25 GMT"
    },
    {
      "title": "Trump's trade war imperils Spanish hatmaker's business with US Orthodox Jews - Reuters",
      "pubDate": "Tue, 27 May 2025 11:42:07 GMT"
    },
    {
      "title": "Temu's Chinese owner sees profits plunge as tariff war bites - BBC",
      "pubDate": "Wed, 28 May 2025 03:17:34 GMT"
    },
    {
      "title": "Brussels ‘urgently’ asks EU companies about US exposure as trade war deadline nears - politico.eu",
      "pubDate": "Wed, 28 May 2025 12:10:00 GMT"
    },
    {
      "title": "Auto Trader boss says trade war could boost new car sales into UK - The Independent",
      "pubDate": "Thu, 29 May 2025 09:21:00 GMT"
    },
    {
      "title": "Trump’s tariff house of cards collapses — one court ruling just ended the trade wars - The Hill",
      "pubDate": "Thu, 29 May 2025 15:30:00 GMT"
    },
    {
      "title": "China already had a graduate jobs crisis. The trade war is making it worse - South China Morning Post",
      "pubDate": "Thu, 29 May 2025 22:00:13 GMT"
    },
    {
      "title": "GOP breathes secret sigh of relief as courts put brakes on Trump tariffs - The Hill",
      "pubDate": "Fri, 30 May 2025 09:30:00 GMT"
    },
    {
      "title": "Global airlines to address trade war, net-zero uncertainties at annual summit - Reuters",
      "pubDate": "Fri, 30 May 2025 05:28:00 GMT"
    },
    {
      "title": "China hits back after Trump claims it is 'violating' tariff truce - BBC",
      "pubDate": "Fri, 30 May 2025 16:28:26 GMT"
    },
    {
      "title": "China’s Factory Activity Contraction Eases After Trade War Truce - Bloomberg",
      "pubDate": "Sat, 31 May 2025 01:54:00 GMT"
    },
    {
      "title": "Trump’s 50 percent tariff bombshell sparks cross-border chaos, industry panic, and fears of a new trade war with Canada - The Economic Times",
      "pubDate": "Sat, 31 May 2025 19:32:13 GMT"
    },
    {
      "title": "The ‘revenge tax’ buried deep in the budget bill could turn a trade war into a ‘capital war,’ analyst says - MSN",
      "pubDate": "Sat, 31 May 2025 22:36:40 GMT"
    },
    {
      "title": "Kelly Ortberg: Boeing should not be an ‘unintended consequence’ of trade war - Financial Times",
      "pubDate": "Sun, 01 Jun 2025 04:00:58 GMT"
    },
    {
      "title": "Trump's new salvo about to upend world trade; 50% tariff on steel & aluminum to kick in on June 4 - The Economic Times",
      "pubDate": "Wed, 04 Jun 2025 01:58:15 GMT"
    },
    {
      "title": "Trump and Xi hold first talks since start of trade war to ease tensions - EL PAÍS English",
      "pubDate": "Thu, 05 Jun 2025 15:20:13 GMT"
    },
    {
      "title": "US Targets Niche Gas That China Can’t Replace as Trade War Chip - Bloomberg",
      "pubDate": "Fri, 06 Jun 2025 08:21:51 GMT"
    },
    {
      "title": "Trump announces second round of US trade talks with China next week - Al Jazeera",
      "pubDate": "Fri, 06 Jun 2025 21:13:57 GMT"
    },
    {
      "title": "The Deng doctrine: How China weaponises rare earths to gain leverage in trade war with the US - Firstpost",
      "pubDate": "Sat, 07 Jun 2025 14:19:46 GMT"
    },
    {
      "title": "Export Controls to Take Center Stage at U.S.-China Trade Talks - WSJ",
      "pubDate": "Sun, 08 Jun 2025 09:30:00 GMT"
    },
    {
      "title": "US, China reach deal to ease export curbs, keep tariff truce alive - Reuters",
      "pubDate": "Wed, 11 Jun 2025 07:12:04 GMT"
    },
    {
      "title": "Trump says ‘relationship is excellent’ with China after exports deal sealed - The Independent",
      "pubDate": "Wed, 11 Jun 2025 15:24:00 GMT"
    },
    {
      "title": "US-China trade truce leaves businesses still facing daunting tariffs - Nikkei Asia",
      "pubDate": "Thu, 12 Jun 2025 04:16:00 GMT"
    },
    {
      "title": "Metal casket maker ready for trade war to end after steel hit with 50% tariff - CBC",
      "pubDate": "Fri, 13 Jun 2025 08:00:00 GMT"
    },
    {
      "title": "San Diego businesses adapt to uncertain import prices as tariffs kick in, again - inewsource",
      "pubDate": "Fri, 13 Jun 2025 23:11:43 GMT"
    },
    {
      "title": "UK hoping for US tariff relief in days after deadline slips - politico.eu",
      "pubDate": "Sun, 15 Jun 2025 20:38:51 GMT"
    },
    {
      "title": "Investor Steve Eisman says we are headed for a global recession if Trump's tariffs spark a trade war - CNBC",
      "pubDate": "Tue, 17 Jun 2025 12:58:48 GMT"
    },
    {
      "title": "Trump's tariff war: Why Canada may be 'in the best position of any other country' - Yahoo",
      "pubDate": "Thu, 19 Jun 2025 11:00:54 GMT"
    },
    {
      "title": "Trump tariffs live updates: US talks with Canada, EU take focus as deadlines loom - Yahoo Finance",
      "pubDate": "Thu, 19 Jun 2025 19:01:13 GMT"
    },
    {
      "title": "Europe’s central banks are all cutting rates, even as tariffs tie the Fed’s hands - politico.eu",
      "pubDate": "Fri, 20 Jun 2025 03:22:00 GMT"
    }
  ],
  "china": [
    {
      "title": "China Expert Warns Of \"Something Worse\" Than Covid After US Fungus Smuggling Case - NDTV",
      "pubDate": "Sun, 08 Jun 2025 06:28:55 GMT"
    },
    {
      "title": "US and China set for trade talks in London on Monday - Reuters",
      "pubDate": "Sun, 08 Jun 2025 11:13:30 GMT"
    },
    {
      "title": "China consumer prices slump again, deepening deflation worries as demand stays weak - CNBC",
      "pubDate": "Mon, 09 Jun 2025 01:41:00 GMT"
    },
    {
      "title": "China's May exports slow, deflation deepens as tariffs bite - Reuters",
      "pubDate": "Mon, 09 Jun 2025 08:00:06 GMT"
    },
    {
      "title": "China’s Grip on an Obscure Rare Earth Metal Threatens the West’s Militaries - The New York Times",
      "pubDate": "Mon, 09 Jun 2025 15:49:34 GMT"
    },
    {
      "title": "US stocks drift and Chinese markets rise as trade talks start between the world's largest economies - AP News",
      "pubDate": "Mon, 09 Jun 2025 20:20:00 GMT"
    },
    {
      "title": "Stocks rise, dollar tentative ahead of US-China talks outcome - Reuters",
      "pubDate": "Tue, 10 Jun 2025 02:16:00 GMT"
    },
    {
      "title": "China’s rare-earth mineral squeeze puts defense giants in the crosshairs - CNBC",
      "pubDate": "Tue, 10 Jun 2025 07:56:35 GMT"
    },
    {
      "title": "China is arming its space station with ‘guard dogs.’ They have good reason for it - Fast Company",
      "pubDate": "Tue, 10 Jun 2025 09:11:27 GMT"
    },
    {
      "title": "Gen. Keane warns China conducting 'most comprehensive penetration' of US society in our 250-year history - Fox Business",
      "pubDate": "Tue, 10 Jun 2025 13:18:00 GMT"
    },
    {
      "title": "China, U.S. officials reach agreement for allowing rare-earth, tech trade. Now it's up to Trump and Xi - CNBC",
      "pubDate": "Wed, 11 Jun 2025 00:01:00 GMT"
    },
    {
      "title": "Trump’s latest trade ‘deal’ with China underscores key U.S. disadvantage - Politico",
      "pubDate": "Wed, 11 Jun 2025 17:43:29 GMT"
    },
    {
      "title": "China demands sensitive information for rare earth exports, companies warn - Financial Times",
      "pubDate": "Thu, 12 Jun 2025 04:00:52 GMT"
    },
    {
      "title": "Exclusive: China-backed militia secures control of new rare earth mines in Myanmar - Reuters",
      "pubDate": "Thu, 12 Jun 2025 10:48:59 GMT"
    },
    {
      "title": "China to remove tariffs on nearly all goods from Africa as both criticise US - South China Morning Post",
      "pubDate": "Thu, 12 Jun 2025 10:00:17 GMT"
    },
    {
      "title": "Pentagon review rattles submarine deal amid fears of China’s naval edge - The Washington Post",
      "pubDate": "Fri, 13 Jun 2025 20:41:01 GMT"
    },
    {
      "title": "China's UN envoy condemns Israeli strikes on Iran - state media - Reuters",
      "pubDate": "Sat, 14 Jun 2025 03:08:00 GMT"
    },
    {
      "title": "Chinese envoy urges Israel to halt ‘risky’ Iran attacks, warns of consequences - South China Morning Post",
      "pubDate": "Sat, 14 Jun 2025 03:57:36 GMT"
    },
    {
      "title": "China expresses backing for Tehran, opposition to Israeli strikes in separate calls with Araghchi, Sa'ar - The Times of Israel",
      "pubDate": "Sat, 14 Jun 2025 16:04:17 GMT"
    },
    {
      "title": "Why Chinese firms building foreign factories are no longer focused on US market - South China Morning Post",
      "pubDate": "Sun, 15 Jun 2025 03:00:11 GMT"
    },
    {
      "title": "Taiwan adds China's Huawei, SMIC to export control list - Reuters",
      "pubDate": "Sun, 15 Jun 2025 03:43:00 GMT"
    },
    {
      "title": "Corporate bond defaults disappear from China’s onshore market - Financial Times",
      "pubDate": "Sun, 15 Jun 2025 04:01:07 GMT"
    },
    {
      "title": "Exclusive: US-China trade truce leaves military-use rare earth issue unresolved, sources say - Reuters",
      "pubDate": "Sun, 15 Jun 2025 22:59:51 GMT"
    },
    {
      "title": "China's May factory output slows, retail sales surprisingly upbeat - Reuters",
      "pubDate": "Mon, 16 Jun 2025 02:08:35 GMT"
    },
    {
      "title": "China’s aircraft carriers send message in the open Pacific for the first time – and bigger and more powerful ships are coming - CNN",
      "pubDate": "Mon, 16 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "US pharma bets big on China to snap up potential blockbuster drugs - Reuters",
      "pubDate": "Mon, 16 Jun 2025 15:26:40 GMT"
    },
    {
      "title": "China's automakers aim for cars with 100% domestic chips from 2026 - Nikkei Asia",
      "pubDate": "Tue, 17 Jun 2025 02:00:00 GMT"
    },
    {
      "title": "China stockpiling nuclear warheads at fastest rate globally, new research shows - The Guardian",
      "pubDate": "Tue, 17 Jun 2025 05:11:00 GMT"
    },
    {
      "title": "If Iran’s Oil Is Cut Off, China Will Pay the Price - WSJ",
      "pubDate": "Tue, 17 Jun 2025 09:30:00 GMT"
    },
    {
      "title": "Partnership Short of Alliance: Military Cooperation Between Russia and China - Center for European Policy Analysis (CEPA)",
      "pubDate": "Wed, 18 Jun 2025 03:52:51 GMT"
    },
    {
      "title": "China’s central bank chief expects new global currency order - Financial Times",
      "pubDate": "Wed, 18 Jun 2025 07:37:34 GMT"
    },
    {
      "title": "Greetings from Shenyang, China, where workers sort AI data in 'Severance'-like ways - NPR",
      "pubDate": "Wed, 18 Jun 2025 14:51:30 GMT"
    },
    {
      "title": "China Copper Smelters Match Record as Foreign Rivals Falter - Bloomberg",
      "pubDate": "Thu, 19 Jun 2025 01:59:00 GMT"
    },
    {
      "title": "New Zealand halts funding for Cook Islands over China deals - BBC",
      "pubDate": "Thu, 19 Jun 2025 05:07:01 GMT"
    },
    {
      "title": "China has become the most important enabler of Russia’s war machine - The Economist",
      "pubDate": "Thu, 19 Jun 2025 12:57:40 GMT"
    },
    {
      "title": "US prepares action targeting allies’ chip plants in China, WSJ reports - Reuters",
      "pubDate": "Fri, 20 Jun 2025 15:17:32 GMT"
    },
    {
      "title": "China sends dozens of planes across central line in Taiwan Strait - Euronews.com",
      "pubDate": "Fri, 20 Jun 2025 09:58:11 GMT"
    },
    {
      "title": "China tightens internet controls with new centralized form of virtual ID - CNN",
      "pubDate": "Fri, 20 Jun 2025 22:00:00 GMT"
    },
    {
      "title": "Von der Leyen's return as China hawk ends talk of diplomatic reset - Euronews.com",
      "pubDate": "Sat, 21 Jun 2025 06:30:38 GMT"
    },
    {
      "title": "China warns of more floods as extreme storms hit world's No.2 economy - Reuters",
      "pubDate": "Sat, 21 Jun 2025 12:02:21 GMT"
    }
  ],
  "elon_musk": [
    {
      "title": "Trump takes aim at Musk's government contracts but says ex-pal can keep White House key - USA Today",
      "pubDate": "Sat, 07 Jun 2025 02:36:12 GMT"
    },
    {
      "title": "Elon Musk rips Trump personnel director Sergio Gor as ‘a snake’ - New York Post",
      "pubDate": "Thu, 19 Jun 2025 15:39:00 GMT"
    },
    {
      "title": "SpaceX Starship rocket explodes in setback to Musk's Mars mission - Reuters",
      "pubDate": "Fri, 20 Jun 2025 04:16:00 GMT"
    }
  ],
  "us_economy": [
    {
      "title": "Scott Galloway has bold prediction on Social Security, US economy - TheStreet",
      "pubDate": "Tue, 10 Jun 2025 01:31:19 GMT"
    },
    {
      "title": "A nuclear deal with Iran could generate billions for US economy - Responsible Statecraft",
      "pubDate": "Tue, 10 Jun 2025 04:09:03 GMT"
    },
    {
      "title": "Private equity’s positive impact on the US economy highlighted in new report - InvestmentNews",
      "pubDate": "Tue, 10 Jun 2025 09:46:44 GMT"
    },
    {
      "title": "World Bank Paints a Bleak Picture of the U.S. Economy—What It Means for Homebuyers and Sellers - Realtor.com",
      "pubDate": "Tue, 10 Jun 2025 22:12:56 GMT"
    },
    {
      "title": "World Bank slashes U.S. growth forecast over trade wars - Finance & Commerce",
      "pubDate": "Wed, 11 Jun 2025 03:53:49 GMT"
    },
    {
      "title": "JPMorgan's Jamie Dimon warns U.S. economy could soon 'deteriorate' - CNBC",
      "pubDate": "Wed, 11 Jun 2025 13:12:33 GMT"
    },
    {
      "title": "JPMorgan Chase CEO Jamie Dimon issues stark warning on economy: ‘Real chance numbers will deteriorate soon’ - New York Post",
      "pubDate": "Wed, 11 Jun 2025 16:56:00 GMT"
    },
    {
      "title": "Largest US Banker Warns US Economy Could 'Deteriorate' As Global Growth Forecast Dims - MSN",
      "pubDate": "Thu, 12 Jun 2025 02:05:46 GMT"
    },
    {
      "title": "New State Merger Review Laws Could Harm U.S. Economy - Forbes",
      "pubDate": "Wed, 11 Jun 2025 21:57:43 GMT"
    },
    {
      "title": "US Economy: Producer Prices Muted, Recurring Jobless Claims Jump - marketscreener.com",
      "pubDate": "Thu, 12 Jun 2025 13:28:52 GMT"
    },
    {
      "title": "US economy is 'frozen' due to a string of compounding uncertainties, strategist says - Fox Business",
      "pubDate": "Thu, 12 Jun 2025 19:29:22 GMT"
    },
    {
      "title": "Renewable energy: The key to strengthening U.S. energy security - SaportaReport",
      "pubDate": "Thu, 12 Jun 2025 20:08:19 GMT"
    },
    {
      "title": "Uncertainty Surge: Middle-Market Firms’ Product Chiefs React to ‘America First’ Policy - PYMNTS.com",
      "pubDate": "Fri, 13 Jun 2025 08:04:57 GMT"
    },
    {
      "title": "US Economy Shrinks for First Time in Three Years Amid Tariff Concerns - MSN",
      "pubDate": "Fri, 13 Jun 2025 13:31:34 GMT"
    },
    {
      "title": "There are risks that the U.S. economy will suffer collateral damage from Israel’s airstrikes in Iran - MarketWatch",
      "pubDate": "Fri, 13 Jun 2025 16:03:00 GMT"
    },
    {
      "title": "The Israel-Iran War Could Send a Shock Through the US Economy. Here’s How. - Barron's",
      "pubDate": "Fri, 13 Jun 2025 19:34:00 GMT"
    },
    {
      "title": "Map Shows US States With Best—And Worst—Economies - Newsweek",
      "pubDate": "Sat, 14 Jun 2025 09:00:01 GMT"
    },
    {
      "title": "Rising Unemployment May Be Warning Sign for the U.S. Economy - La Voce di New York",
      "pubDate": "Sat, 14 Jun 2025 11:29:05 GMT"
    },
    {
      "title": "Making America Backward Again - Rolling Stone",
      "pubDate": "Sun, 15 Jun 2025 09:01:35 GMT"
    },
    {
      "title": "Viewing China-US trade balance objectively reveals the path to win-win cooperation - Global Times",
      "pubDate": "Sun, 15 Jun 2025 12:48:00 GMT"
    },
    {
      "title": "U.S. could lose more immigrants than it gains for first time in 50 years - The Washington Post",
      "pubDate": "Sun, 15 Jun 2025 23:51:57 GMT"
    },
    {
      "title": "US Economy To Face 'Pretty Limited' Impact From Israel-Iran Airstrikes, With Only A 'Tiny Bit' Recession Risk, Say Economists - Benzinga",
      "pubDate": "Mon, 16 Jun 2025 08:32:41 GMT"
    },
    {
      "title": "The Monthly Preview: Potential Impact of the Revenge Tax - Natixis CIB | Natixis Corporate & Investment Banking",
      "pubDate": "Mon, 16 Jun 2025 15:25:57 GMT"
    },
    {
      "title": "Opinion | The worst thing Trump is doing to the economy isn’t tariffs - The Washington Post",
      "pubDate": "Mon, 16 Jun 2025 18:15:28 GMT"
    },
    {
      "title": "Though Government Policy Makes Headlines, Real Economic Muscle Continues to Power Growth - ETF Database",
      "pubDate": "Mon, 16 Jun 2025 17:40:07 GMT"
    },
    {
      "title": "US Fed Rate Decision: What to Expect on June 18 - Morningstar",
      "pubDate": "Tue, 17 Jun 2025 07:28:00 GMT"
    },
    {
      "title": "Shoppers cut spending at U.S. retailers in May as trade wars drag on the economy - MarketWatch",
      "pubDate": "Tue, 17 Jun 2025 12:40:00 GMT"
    },
    {
      "title": "JPMorgan Chase CEO Jamie Dimon makes key observations on US Economy. What we know so far - financialexpress.com",
      "pubDate": "Tue, 17 Jun 2025 15:31:32 GMT"
    },
    {
      "title": "McKinsey Chief Says Global Clients Are Rethinking US Market - Bloomberg.com",
      "pubDate": "Tue, 17 Jun 2025 20:33:16 GMT"
    },
    {
      "title": "Stalsworth: US economy better under Democrat control - Seguin Gazette",
      "pubDate": "Tue, 17 Jun 2025 22:30:00 GMT"
    },
    {
      "title": "U.S. unemployment claims dip to 245,000, hovering at historically low levels - PBS",
      "pubDate": "Wed, 18 Jun 2025 13:54:18 GMT"
    },
    {
      "title": "Tariffs hit US economy forecast but the Fed unmoved by latest Trump threats with no change to interest rates - Sky News",
      "pubDate": "Wed, 18 Jun 2025 20:29:44 GMT"
    },
    {
      "title": "Politically Driven Rate Cuts Will Erode Trust in the US Economy - Cato Institute",
      "pubDate": "Wed, 18 Jun 2025 18:22:40 GMT"
    },
    {
      "title": "Top economist warns America is heading toward economic disaster the Fed can't fix - Fox Business",
      "pubDate": "Wed, 18 Jun 2025 22:25:00 GMT"
    },
    {
      "title": "US economy faces reckoning as some immigrants avoid workplaces - The Christian Science Monitor",
      "pubDate": "Thu, 19 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "US manufacturing giant teases 'big' investment back into the American economy - Fox Business",
      "pubDate": "Thu, 19 Jun 2025 14:58:00 GMT"
    },
    {
      "title": "U.S. Leading Indicators Signal Further Economic Slowdown - Barron's",
      "pubDate": "Fri, 20 Jun 2025 08:18:00 GMT"
    },
    {
      "title": "Still early to assess tariff impact on US economy, Fed report says - The Business Times",
      "pubDate": "Fri, 20 Jun 2025 15:30:00 GMT"
    },
    {
      "title": "Federal Reserve starts to split on when to begin cutting US interest rates - Financial Times",
      "pubDate": "Fri, 20 Jun 2025 18:18:01 GMT"
    },
    {
      "title": "'Million dollar question' now is health of US economy, say CIO - MSN",
      "pubDate": "Sat, 21 Jun 2025 00:25:30 GMT"
    }
  ],
  "us_supreme_court": [
    {
      "title": "Justices Grant DOGE Access to Social Security Data and Let the Team Shield Records - The New York Times",
      "pubDate": "Fri, 06 Jun 2025 22:22:41 GMT"
    },
    {
      "title": "US Supreme Court sides with American gun manufacturers in Mexico’s lawsuit over cartel violence - JURIST Legal News",
      "pubDate": "Sun, 08 Jun 2025 01:46:53 GMT"
    },
    {
      "title": "Unanimous Supreme Court makes it easier to sue schools in disability cases - NPR",
      "pubDate": "Thu, 12 Jun 2025 14:37:26 GMT"
    }
  ],
  "climate": [
    {
      "title": "Global temperatures could break heat record in next five years - The Guardian",
      "pubDate": "Wed, 28 May 2025 04:00:00 GMT"
    },
    {
      "title": "Labor accused of ‘gaslighting’ Australians on climate crisis as fossil fuel projects keep getting approved - The Guardian",
      "pubDate": "Fri, 06 Jun 2025 04:50:00 GMT"
    },
    {
      "title": "UK temperatures of 45C may be possible in current climate, Met Office says - The Guardian",
      "pubDate": "Wed, 18 Jun 2025 07:01:00 GMT"
    }
  ],
  "ai_safety": [
    {
      "title": "AI revolt: New ChatGPT model refuses to shut down when instructed - MSN",
      "pubDate": "Mon, 26 May 2025 13:26:34 GMT"
    },
    {
      "title": "Advanced AI from Anthropic Tries to Blackmail Engineer, Raises Red Flags - Analytics Insight",
      "pubDate": "Mon, 26 May 2025 10:02:31 GMT"
    },
    {
      "title": "Movies predicted it! AI models ignored shut down orders, say researchers - Mathrubhumi English",
      "pubDate": "Tue, 27 May 2025 01:20:12 GMT"
    },
    {
      "title": "This just-released AI knows how to blackmail, how to escape and more - Switzer Daily",
      "pubDate": "Tue, 27 May 2025 05:55:46 GMT"
    },
    {
      "title": "AI Autonomy Alert: ChatGPT-o3 resists shutdown in safety test - Deccan Herald",
      "pubDate": "Tue, 27 May 2025 09:51:52 GMT"
    },
    {
      "title": "ChatGPT o3 Resists Shutdown Despite Instructions, Study Claims - Hackread",
      "pubDate": "Tue, 27 May 2025 21:24:59 GMT"
    },
    {
      "title": "US lawmakers urge AI Safety Institute to counter China's growing AI threat - ANI News",
      "pubDate": "Wed, 28 May 2025 06:55:00 GMT"
    },
    {
      "title": "AI Shutdown Failure: OpenAI Models Disobey Commands, Report Reveals - The Hans India",
      "pubDate": "Wed, 28 May 2025 10:12:56 GMT"
    },
    {
      "title": "Safety measures can spur AI’s growth, not stifle it: Panellists - Yahoo News Singapore",
      "pubDate": "Wed, 28 May 2025 12:22:45 GMT"
    },
    {
      "title": "OpenAI Models defy shutdown commands in AI safety tests, raising control concerns - Diya TV",
      "pubDate": "Wed, 28 May 2025 18:00:00 GMT"
    },
    {
      "title": "Singapore: Global Collaboration for a Trusted AI Ecosystem - OpenGov Asia",
      "pubDate": "Thu, 29 May 2025 00:55:04 GMT"
    },
    {
      "title": "Singapore releases tools and resources to help businesses test, develop AI safety - CNA",
      "pubDate": "Thu, 29 May 2025 15:07:36 GMT"
    },
    {
      "title": "As AI models start exhibiting bad behavior, it’s time to start thinking harder about AI safety - Fast Company",
      "pubDate": "Thu, 29 May 2025 18:20:23 GMT"
    },
    {
      "title": "Scoop: AI Safety Institute to be renamed Center for AI Safety and Leadership - Axios",
      "pubDate": "Fri, 30 May 2025 00:25:49 GMT"
    },
    {
      "title": "MLCommons partners with NASSCOM to bring global AI reliability benchmarks to India - Deccan Herald",
      "pubDate": "Fri, 30 May 2025 20:34:38 GMT"
    },
    {
      "title": "AI Rebellion in 2025: How ChatGPT-o3 Defied Human Commands for the First Time Ever – A Groundbreaking Experiment Shocks the AI Community - Business Matters",
      "pubDate": "Sat, 31 May 2025 05:03:42 GMT"
    },
    {
      "title": "Straight Out of a Sci-Fi Movie: An AI Managed to Rewrite Its Own Code to Prevent Humans From Shutting It Down - The Daily Galaxy",
      "pubDate": "Sun, 01 Jun 2025 11:00:00 GMT"
    },
    {
      "title": "Business Council Reveals AI Strategy for 2028 Leadership - Mirage News",
      "pubDate": "Sun, 01 Jun 2025 20:48:00 GMT"
    },
    {
      "title": "The hidden security risks of open source AI - Computer Weekly",
      "pubDate": "Mon, 02 Jun 2025 19:48:01 GMT"
    },
    {
      "title": "New Anthropic AI Models Demonstrate Coding Prowess, Behavior Risks - Campus Technology",
      "pubDate": "Mon, 02 Jun 2025 18:06:17 GMT"
    },
    {
      "title": "AI Whistleblowers Can’t Carry the Burden of Regulating Industry - Bloomberg Law News",
      "pubDate": "Tue, 03 Jun 2025 08:30:00 GMT"
    },
    {
      "title": "Preparing for AI: The CISO’s role in security, ethics and compliance - Computer Weekly",
      "pubDate": "Tue, 03 Jun 2025 13:31:58 GMT"
    },
    {
      "title": "Yoshua Bengio launches LawZero, a nonprofit AI safety lab - TechCrunch",
      "pubDate": "Tue, 03 Jun 2025 17:33:49 GMT"
    },
    {
      "title": "AI Godfather Is 'Deeply Concerned' About AI Dangers, Launches Safety-Focused Nonprofit LawZero - eWEEK",
      "pubDate": "Wed, 04 Jun 2025 00:39:15 GMT"
    },
    {
      "title": "\"Godfather of AI\" warns that today's AI systems are becoming strategically dishonest - TechSpot",
      "pubDate": "Tue, 03 Jun 2025 22:31:00 GMT"
    },
    {
      "title": "Anthropic is pulling in talent from OpenAI and DeepMind. What makes the AI ​​startup so attractive to the best engineers - dev.ua",
      "pubDate": "Wed, 04 Jun 2025 11:34:00 GMT"
    },
    {
      "title": "Three Essentials for Agentic AI Security - MIT Sloan Management Review",
      "pubDate": "Wed, 04 Jun 2025 11:00:27 GMT"
    },
    {
      "title": "New US AI center reflects change in branding, not role - MLex",
      "pubDate": "Wed, 04 Jun 2025 22:58:00 GMT"
    },
    {
      "title": "Anthropic's New Government AI Models Signal the Defense Tech Gold Rush is Real - Maginative",
      "pubDate": "Thu, 05 Jun 2025 14:34:49 GMT"
    },
    {
      "title": "Anthropic introduces new Claude Gov models with national security focus - Nextgov",
      "pubDate": "Thu, 05 Jun 2025 17:04:00 GMT"
    },
    {
      "title": "Groups raise alarms about proposed artificial intelligence regulations - The Center Square",
      "pubDate": "Thu, 05 Jun 2025 18:52:00 GMT"
    },
    {
      "title": "‘Godfather of AI’ believes the tech is now unsafe - but he has a plan - The Independent",
      "pubDate": "Fri, 06 Jun 2025 10:58:00 GMT"
    }
  ],
  "us_politics": [
    {
      "title": "Trump LA protest response risks turning US military into political force, veterans warn - The Guardian",
      "pubDate": "Mon, 09 Jun 2025 19:54:00 GMT"
    },
    {
      "title": "US Politics: Trump Deploys Troops in LA Amid Protests, Draws Jan 6 Comparison - Deccan Herald",
      "pubDate": "Tue, 10 Jun 2025 03:51:15 GMT"
    },
    {
      "title": "White House struggles to find qualified people willing to serve under Pete Hegseth: report - The Independent",
      "pubDate": "Tue, 10 Jun 2025 07:16:00 GMT"
    },
    {
      "title": "Trump’s aggressive moves on immigration protests put Democrats in a political bind - KRDO",
      "pubDate": "Tue, 10 Jun 2025 17:41:56 GMT"
    },
    {
      "title": "American carnage revisited as Trump plays president of permanent emergency - The Guardian",
      "pubDate": "Wed, 11 Jun 2025 01:10:00 GMT"
    },
    {
      "title": "OPINION: Donald Trump is seeking to infuse politics into America’s military forces - Coeur d'Alene Press",
      "pubDate": "Wed, 11 Jun 2025 08:00:00 GMT"
    },
    {
      "title": "Elon Musk: I went too far criticising Trump - The Times",
      "pubDate": "Wed, 11 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Eleanor Holmes Norton, D.C.’s Delegate in Congress, Clings to Seat Amid Signs of Decline - The New York Times",
      "pubDate": "Wed, 11 Jun 2025 17:32:49 GMT"
    },
    {
      "title": "We’ve Stopped Talking to People We Disagree With. That’s a Problem. - U.S. News & World Report",
      "pubDate": "Wed, 11 Jun 2025 22:42:00 GMT"
    },
    {
      "title": "US pushes Mexico to prosecute, extradite politicians with cartel ties - Reuters",
      "pubDate": "Thu, 12 Jun 2025 02:29:39 GMT"
    },
    {
      "title": "Democratic governors testify before Congress as immigration protests sweep country - The Independent",
      "pubDate": "Thu, 12 Jun 2025 14:10:00 GMT"
    },
    {
      "title": "Senate G.O.P. Includes Expanded Fund for Radiation Victims in Policy Bill - The New York Times",
      "pubDate": "Fri, 13 Jun 2025 02:06:20 GMT"
    },
    {
      "title": "America is heading down a dark road as fury boils over in California - CNN",
      "pubDate": "Fri, 13 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "Forcible removal of US Sen. Alex Padilla signals a dangerous shift in American democracy - The Conversation",
      "pubDate": "Fri, 13 Jun 2025 17:27:08 GMT"
    },
    {
      "title": "What Israel’s kitchen-sink operation against Iran tells us so far - CNN",
      "pubDate": "Fri, 13 Jun 2025 19:54:00 GMT"
    },
    {
      "title": "How boredom gave us chaos - Financial Times",
      "pubDate": "Sat, 14 Jun 2025 04:00:01 GMT"
    },
    {
      "title": "Texas Lawmakers Warned of 'Credible Threat' After Minnesota Assassination - Newsweek",
      "pubDate": "Sat, 14 Jun 2025 19:29:59 GMT"
    },
    {
      "title": "Minnesota: US politician shot dead and another wounded - as suspect named - Sky News",
      "pubDate": "Sat, 14 Jun 2025 17:15:00 GMT"
    },
    {
      "title": "Like School Shootings, Political Violence Is Becoming Almost Routine - The New York Times",
      "pubDate": "Sun, 15 Jun 2025 00:40:56 GMT"
    },
    {
      "title": "Poll: Neither political party gets good marks on honesty - NBC News",
      "pubDate": "Sun, 15 Jun 2025 13:00:41 GMT"
    },
    {
      "title": "Gathering stormclouds can’t wipe smile from Trump’s face as long-held dream of military parade is realised - The Guardian",
      "pubDate": "Sun, 15 Jun 2025 18:46:00 GMT"
    },
    {
      "title": "Trump condemns Minnesota shootings but violence has long played a role in U.S. politics - The Globe and Mail",
      "pubDate": "Sun, 15 Jun 2025 23:43:38 GMT"
    },
    {
      "title": "Terrifying new Trump ‘order’ rocks US - News.com.au",
      "pubDate": "Sun, 15 Jun 2025 21:00:00 GMT"
    },
    {
      "title": "Trump to meet with Carney as G7 summit begins amid trade tensions and Iran-Israel crisis – US politics live - The Guardian",
      "pubDate": "Mon, 16 Jun 2025 08:07:00 GMT"
    },
    {
      "title": "Senate to maintain cap on state tax deductions, imperilling Trump’s bill - Financial Times",
      "pubDate": "Mon, 16 Jun 2025 19:57:17 GMT"
    },
    {
      "title": "Violence is coming to define American political life | Stephen Marche - The Guardian",
      "pubDate": "Mon, 16 Jun 2025 16:48:00 GMT"
    },
    {
      "title": "Trump’s Cuts to N.I.H. Grants Focused on Minority Groups Are Illegal, Judge Rules - The New York Times",
      "pubDate": "Mon, 16 Jun 2025 22:25:21 GMT"
    },
    {
      "title": "Congress should be ashamed over helping Trump cut foreign aid, activists say - The Independent",
      "pubDate": "Tue, 17 Jun 2025 12:25:00 GMT"
    },
    {
      "title": "Obama Steps Back Into the Public Eye Amid Political and Global Unrest - The New York Times",
      "pubDate": "Tue, 17 Jun 2025 16:13:28 GMT"
    },
    {
      "title": "The US may be headed into another Middle East war – and no one is talking about how it ends - CNN",
      "pubDate": "Wed, 18 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "Obama: The US is dangerously close to becoming an autocracy - The Telegraph",
      "pubDate": "Wed, 18 Jun 2025 14:24:00 GMT"
    },
    {
      "title": "Obama warns America is ‘dangerously close’ to moving away from democracy - The Independent",
      "pubDate": "Wed, 18 Jun 2025 21:26:00 GMT"
    },
    {
      "title": "What happens next if Trump launches his attack on Iran - The Independent",
      "pubDate": "Thu, 19 Jun 2025 15:32:00 GMT"
    },
    {
      "title": "Justice Dept. to Cut Gun-Sale Inspectors by Two-Thirds as It Moves to Downsize A.T.F. - The New York Times",
      "pubDate": "Thu, 19 Jun 2025 13:47:00 GMT"
    },
    {
      "title": "Trump gives Iran ‘two-week’ reprieve as his inner circle quietly seeks exit route - The Times",
      "pubDate": "Thu, 19 Jun 2025 22:45:00 GMT"
    },
    {
      "title": "Charlie Kirk warns Lindsey Graham and Iran war hawks: ‘Not even the Romans could defeat Persia’ - The Independent",
      "pubDate": "Fri, 20 Jun 2025 14:33:00 GMT"
    },
    {
      "title": "Trump says Gabbard and US intelligence ‘wrong’ on Iran nukes as he warns Tehran could have bomb in ‘weeks’ - The Independent",
      "pubDate": "Fri, 20 Jun 2025 20:22:00 GMT"
    },
    {
      "title": "Judge blocks Trump administration from tying transportation funds to states’ cooperation with immigration efforts - CNN",
      "pubDate": "Fri, 20 Jun 2025 16:43:00 GMT"
    },
    {
      "title": "US law enforcement reexamining Hezbollah intel, but there’s no indication of credible threats - CNN",
      "pubDate": "Fri, 20 Jun 2025 22:07:00 GMT"
    },
    {
      "title": "Power struggles in US politics - Culture - Al-Ahram Weekly - Ahram Online",
      "pubDate": "Sat, 21 Jun 2025 09:35:54 GMT"
    }
  ],
  "iran": [
    {
      "title": "Iran announces a new nuclear enrichment site after UN watchdog censure - AP News",
      "pubDate": "Fri, 13 Jun 2025 02:41:00 GMT"
    },
    {
      "title": "Israel-Iran Live Updates: Trump Privately Approved of Attack Plans for Iran but Has Withheld Final Order - WSJ",
      "pubDate": "Thu, 19 Jun 2025 15:14:00 GMT"
    },
    {
      "title": "Israel-Iran latest: Huge explosion rocks Haifa after Tehran launches new wave of missile attacks - The Independent",
      "pubDate": "Sat, 21 Jun 2025 03:34:28 GMT"
    }
  ],
  "israel": [
    {
      "title": "Israel strikes Iran nuclear sites and military leadership as Middle East braces for retaliation - CNN",
      "pubDate": "Fri, 13 Jun 2025 08:53:00 GMT"
    },
    {
      "title": "Israel-Iran live updates: Sirens as Israeli authorities warn of new wave of missiles - ABC News",
      "pubDate": "Sat, 14 Jun 2025 01:42:00 GMT"
    },
    {
      "title": "Live Updates: Israel Strikes State TV After Telling People to Evacuate Part of Tehran - The New York Times",
      "pubDate": "Tue, 17 Jun 2025 00:41:00 GMT"
    },
    {
      "title": "LIVE: Iran ready for nuclear talks when ‘Israeli aggression stops’ - Al Jazeera",
      "pubDate": "Fri, 20 Jun 2025 20:03:45 GMT"
    }
  ],
  "us_senate": [
    {
      "title": "US senator forcefully removed from DHS event in LA, triggering Democratic outcry on Capitol Hill - CNN",
      "pubDate": "Thu, 12 Jun 2025 22:25:00 GMT"
    },
    {
      "title": "US senator introduces bill to curb Trump’s power to go to war with Iran - Al Jazeera",
      "pubDate": "Mon, 16 Jun 2025 16:35:58 GMT"
    },
    {
      "title": "Stablecoins' market cap surges to record high as US senate passes bill - Reuters",
      "pubDate": "Wed, 18 Jun 2025 20:37:02 GMT"
    }
  ],
  "Artificial Intelligence": [
    {
      "title": "'Major fail' indeed: Musk's AI told the truth, so now he has to fix it | Opinion - USA Today",
      "pubDate": "Sat, 21 Jun 2025 12:58:27 GMT"
    },
    {
      "title": "Top AI models will lie, cheat and steal to reach goals, Anthropic finds - Axios",
      "pubDate": "Sat, 21 Jun 2025 11:33:36 GMT"
    },
    {
      "title": "Amazon CEO Andy Jassy says company will cut jobs amid AI boom. It's already happening at Microsoft. - Yahoo Finance",
      "pubDate": "Sat, 21 Jun 2025 16:25:38 GMT"
    },
    {
      "title": "Humans, AI collaborating makes for more accurate medical diagnoses: Study - Straight Arrow News",
      "pubDate": "Sun, 22 Jun 2025 01:00:00 GMT"
    },
    {
      "title": "Trump’s plan to ban US states from AI regulation will ‘hold us back’, says Microsoft science chief - The Guardian",
      "pubDate": "Sun, 22 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Preparing for a New Age: Artificial Intelligence, the American Workforce and the G.I. Bill - New Jersey Globe",
      "pubDate": "Sun, 22 Jun 2025 23:52:54 GMT"
    },
    {
      "title": "Range Intelligent Is Said to Explore Second Listing in Hong Kong - Bloomberg.com",
      "pubDate": "Mon, 23 Jun 2025 05:44:00 GMT"
    },
    {
      "title": "Artificial intelligence isn’t hurting workers—It might be helping - ScienceDaily",
      "pubDate": "Mon, 23 Jun 2025 14:03:45 GMT"
    },
    {
      "title": "Opinion | Unleashing artificial intelligence - The Washington Post",
      "pubDate": "Tue, 24 Jun 2025 02:55:24 GMT"
    },
    {
      "title": "American Students Are Relying On ChatGPT - At Their Own Risk - Newsweek",
      "pubDate": "Tue, 24 Jun 2025 08:00:01 GMT"
    },
    {
      "title": "At Amazon’s Biggest Data Center, Everything Is Supersized for A.I. - The New York Times",
      "pubDate": "Tue, 24 Jun 2025 09:01:00 GMT"
    },
    {
      "title": "AI poses ‘existential risk’ if out of control, Chinese computer scientist warns - South China Morning Post",
      "pubDate": "Tue, 24 Jun 2025 12:00:07 GMT"
    },
    {
      "title": "AI Security Turning Point: Echo Chamber Jailbreak Exposes Dangerous Blind Spot - TechRepublic",
      "pubDate": "Tue, 24 Jun 2025 21:44:06 GMT"
    }
  ],
  "US Politics": [
    {
      "title": "Democrats are at odds over the Israel-Iran war as Trump considers intervening - WTOP",
      "pubDate": "Sat, 21 Jun 2025 16:52:52 GMT"
    },
    {
      "title": "Senate Official Rejects Food Aid Cuts Proposed by Republicans in Megabill - The New York Times",
      "pubDate": "Sat, 21 Jun 2025 16:24:57 GMT"
    },
    {
      "title": "Trump's Iran strikes meet bipartisan blowback in Congress over war powers - Axios",
      "pubDate": "Sun, 22 Jun 2025 01:29:44 GMT"
    },
    {
      "title": "Republican Lawmakers Cheer Strike on Iran as Top Democrats Condemn It - The New York Times",
      "pubDate": "Sun, 22 Jun 2025 05:37:56 GMT"
    },
    {
      "title": "Democrats say they were left in dark about plans for US strikes on Iran - The Guardian",
      "pubDate": "Sun, 22 Jun 2025 14:31:00 GMT"
    },
    {
      "title": "Legality of Trump Iran strikes questioned by some lawmakers in both parties - NBC News",
      "pubDate": "Sun, 22 Jun 2025 18:34:00 GMT"
    },
    {
      "title": "Shifting Views and Misdirection: How Trump Decided to Strike Iran - The New York Times",
      "pubDate": "Mon, 23 Jun 2025 03:43:56 GMT"
    },
    {
      "title": "Republican House speaker dismisses efforts to check Trump’s military power against Iran – US politics live - The Guardian",
      "pubDate": "Mon, 23 Jun 2025 09:45:00 GMT"
    },
    {
      "title": "Senate GOP’s tax cuts projected to cost $4.2T — with costly SALT deal pending - Politico",
      "pubDate": "Tue, 24 Jun 2025 12:55:35 GMT"
    },
    {
      "title": "Judge blocks Trump from withholding EV charger infrastructure funds - The Hill",
      "pubDate": "Wed, 25 Jun 2025 02:34:00 GMT"
    }
  ],
  "Iran": [
    {
      "title": "U.S. Begins Moving B-2 Bombers, as Trump Weighs Attack on Iran - WSJ",
      "pubDate": "Sat, 21 Jun 2025 16:19:00 GMT"
    },
    {
      "title": "Israel says it hit Iran nuclear research facility, killed top commanders as both trade strikes - The Hill",
      "pubDate": "Sat, 21 Jun 2025 13:47:00 GMT"
    },
    {
      "title": "Live Updates: U.S. Enters War Against Iran, Bombing Key Nuclear Sites - The New York Times",
      "pubDate": "Sun, 22 Jun 2025 03:52:00 GMT"
    },
    {
      "title": "Iran Had Vowed to Retaliate. Now, It Faces Grim Choices. - The New York Times",
      "pubDate": "Sun, 22 Jun 2025 05:51:15 GMT"
    },
    {
      "title": "U.S. Strike on Iran Began With a Ruse - WSJ",
      "pubDate": "Sun, 22 Jun 2025 12:28:00 GMT"
    },
    {
      "title": "U.S. strikes on Iran nuclear facilities see Hamas and the Houthis vow retaliation, as world leaders react - CBS News",
      "pubDate": "Sun, 22 Jun 2025 13:16:56 GMT"
    },
    {
      "title": "Satellite images and decoy planes: Behind the US attacks on Iran - BBC",
      "pubDate": "Sun, 22 Jun 2025 18:02:12 GMT"
    },
    {
      "title": "U.S. strikes on Iranian nuclear sites show no sign of widespread environmental impact - NPR",
      "pubDate": "Sun, 22 Jun 2025 16:22:39 GMT"
    },
    {
      "title": "Israel Pounds Tehran, Strikes Fordow Again as Khamenei Appeals to Putin - Newsweek",
      "pubDate": "Mon, 23 Jun 2025 14:39:14 GMT"
    },
    {
      "title": "US strikes: How much damage has been done to Iran's nuclear facilities? - Sky News",
      "pubDate": "Mon, 23 Jun 2025 19:49:49 GMT"
    },
    {
      "title": "Iran fires missiles at US base in Qatar, Trump calls for peace - Reuters",
      "pubDate": "Mon, 23 Jun 2025 21:40:41 GMT"
    },
    {
      "title": "Israel-Iran ceasefire appears to hold after Trump outburst at both sides - live updates - BBC",
      "pubDate": "Tue, 24 Jun 2025 10:46:30 GMT"
    },
    {
      "title": "Early US intel assessment finds strikes set back Iran's nuclear program only by months - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Tue, 24 Jun 2025 20:01:38 GMT"
    }
  ],
  "Israel": [
    {
      "title": "Israel-Iran live updates: Israel kills 3 Iranian generals, strikes nuclear site - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Sat, 21 Jun 2025 13:28:00 GMT"
    },
    {
      "title": "Israeli strikes on Iran cap dramatic shift in Mideast strategic balance - The Washington Post",
      "pubDate": "Sun, 22 Jun 2025 02:51:57 GMT"
    },
    {
      "title": "What to know about the Iranian nuclear sites that were hit by US strikes - The Times of Israel",
      "pubDate": "Sun, 22 Jun 2025 07:49:44 GMT"
    },
    {
      "title": "Israel says 21 people wounded as Iran fires dozens of missiles following U.S. strikes on nuclear facilities - CBS News",
      "pubDate": "Sun, 22 Jun 2025 09:44:13 GMT"
    },
    {
      "title": "Israel-Iran war live: Iran parliament votes to shut Hormuz strait in response to US attack raising fears of oil price shock - The Guardian",
      "pubDate": "Sun, 22 Jun 2025 19:27:00 GMT"
    },
    {
      "title": "Israel-Iran live: Iran threatens US with 'decisive response' after strikes - as it sends wave of missiles at Israel - Sky News",
      "pubDate": "Mon, 23 Jun 2025 08:54:21 GMT"
    },
    {
      "title": "Israel-Iran war live: Israeli government confirms it has agreed to ceasefire deal brokered by US - The Guardian",
      "pubDate": "Tue, 24 Jun 2025 07:44:07 GMT"
    },
    {
      "title": "Israel warns campaign against Iran is not over as ceasefire takes hold - Al Jazeera",
      "pubDate": "Tue, 24 Jun 2025 14:55:10 GMT"
    }
  ],
  "Ukraine": [
    {
      "title": "Ukraine Warns Teenagers the Enemy Is Inside Their Phones - The New York Times",
      "pubDate": "Sat, 21 Jun 2025 09:35:26 GMT"
    },
    {
      "title": "Ukraine asks allies to allocate 0.25% of GDP to boost its weapon production - Reuters",
      "pubDate": "Sat, 21 Jun 2025 12:44:20 GMT"
    },
    {
      "title": "One million and counting: Russian casualties hit milestone in Ukraine war - The Guardian",
      "pubDate": "Sun, 22 Jun 2025 05:01:00 GMT"
    },
    {
      "title": "More than 350 Russian drones, missiles blast Kyiv killing at least five - France 24",
      "pubDate": "Mon, 23 Jun 2025 03:26:56 GMT"
    },
    {
      "title": "Russia strikes Kyiv with North Korean missiles and Iranian drones: Zelensky - NK News",
      "pubDate": "Tue, 24 Jun 2025 05:04:10 GMT"
    },
    {
      "title": "Russian missile attack kills 17 as Zelenskiy presses NATO allies for support - Reuters",
      "pubDate": "Tue, 24 Jun 2025 16:14:16 GMT"
    }
  ],
  "Russia": [
    {
      "title": "Putin Sending Dead Russian Soldiers to Ukraine To Hide Losses: Zelensky - Newsweek",
      "pubDate": "Sat, 21 Jun 2025 16:20:20 GMT"
    },
    {
      "title": "Putin says 'all of Ukraine is ours' and threatens nuclear strike - Sky News",
      "pubDate": "Sat, 21 Jun 2025 14:32:34 GMT"
    },
    {
      "title": "Russia’s economy boomed after the invasion of Ukraine—it’s now running out of steam - Fortune",
      "pubDate": "Sun, 22 Jun 2025 12:08:00 GMT"
    }
  ],
  "Donald Trump": [
    {
      "title": "Trump’s two-week delay on Iran strike decision leaves Israel in limbo - CNN",
      "pubDate": "Sat, 21 Jun 2025 12:39:00 GMT"
    },
    {
      "title": "U.S. bombs three Iranian nuclear sites, Trump addresses nation: Live updates - NBC News",
      "pubDate": "Sun, 22 Jun 2025 02:52:00 GMT"
    },
    {
      "title": "Trump says key Iranian nuclear facilities ‘totally obliterated’ in U.S. strikes - The Washington Post",
      "pubDate": "Sun, 22 Jun 2025 07:38:10 GMT"
    },
    {
      "title": "Live updates: Trump claims success on U.S. strikes on Iran; military details overnight stealth operation - NBC News",
      "pubDate": "Sun, 22 Jun 2025 14:20:31 GMT"
    },
    {
      "title": "Live updates: Iran warns US strikes will have ‘everlasting consequences’ as Trump says nuclear sites ‘obliterated’ - CNN",
      "pubDate": "Sun, 22 Jun 2025 14:39:00 GMT"
    },
    {
      "title": "Trump Changed. The Intelligence Didn’t. - The Atlantic",
      "pubDate": "Sun, 22 Jun 2025 22:22:00 GMT"
    },
    {
      "title": "LIVE: Iran vows to retaliate over US attacks; Trump warns of regime change - Al Jazeera",
      "pubDate": "Mon, 23 Jun 2025 06:56:02 GMT"
    },
    {
      "title": "Trump says 'everyone' should keep oil prices lower or they're playing 'into the hands of the enemy' - CNBC",
      "pubDate": "Mon, 23 Jun 2025 13:52:25 GMT"
    },
    {
      "title": "Donald Trump Reacts to Iran's Strike on US Base - Newsweek",
      "pubDate": "Mon, 23 Jun 2025 20:06:49 GMT"
    },
    {
      "title": "Live updates: Trump announces Israel-Iran ceasefire; attack on Al Udeid Air Base in Qatar - CNN",
      "pubDate": "Tue, 24 Jun 2025 03:40:00 GMT"
    },
    {
      "title": "LIVE: Trump says Israel-Iran ceasefire is now in effect - Al Jazeera",
      "pubDate": "Tue, 24 Jun 2025 05:40:01 GMT"
    },
    {
      "title": "Live updates: Trump lashes out at Israel and Iran amid accusations of ceasefire violations - NBC News",
      "pubDate": "Tue, 24 Jun 2025 15:23:32 GMT"
    },
    {
      "title": "Israel-Iran Live Updates: Shaky Cease-Fire Takes Hold, Under Pressure From Trump - The New York Times",
      "pubDate": "Tue, 24 Jun 2025 20:46:14 GMT"
    },
    {
      "title": "US strikes failed to destroy Iran's nuclear sites, intelligence report says - Reuters",
      "pubDate": "Wed, 25 Jun 2025 00:17:00 GMT"
    }
  ],
  "World News": [
    {
      "title": "US Bombs 3 Nuclear Sites In Iran, Trump Says \"Now Is Time For Peace\" - NDTV",
      "pubDate": "Sun, 22 Jun 2025 00:43:05 GMT"
    },
    {
      "title": "US strikes on Iran come at fragile moment for the global economy - The Economic Times",
      "pubDate": "Sun, 22 Jun 2025 06:39:46 GMT"
    }
  ],
  "National Security": [
    {
      "title": "What are the national security implications of Trump's Iran attack - CBS News",
      "pubDate": "Sun, 22 Jun 2025 01:30:00 GMT"
    },
    {
      "title": "US on 'high alert' for Iran retaliation, says nuke program 'obliterated': Live updates - USA Today",
      "pubDate": "Sun, 22 Jun 2025 14:37:30 GMT"
    }
  ],
  "US Congress": [
    {
      "title": "Congress members split over US attack on Iran - Reuters",
      "pubDate": "Sun, 22 Jun 2025 02:54:00 GMT"
    },
    {
      "title": "Most House Democrats vote to kill Al Green's impeachment measure - Politico",
      "pubDate": "Tue, 24 Jun 2025 18:21:15 GMT"
    }
  ],
  "Financial Markets": [
    {
      "title": "Investors brace for oil price spike, rush to havens after US bombs Iran nuclear sites - USA Today",
      "pubDate": "Sun, 22 Jun 2025 02:43:21 GMT"
    },
    {
      "title": "Most Gulf markets trade up, unfazed by rising regional tensions as US strikes Iran - Reuters",
      "pubDate": "Sun, 22 Jun 2025 09:56:59 GMT"
    },
    {
      "title": "Investors set to flock to safety as world awaits Iran’s response - Yahoo Finance",
      "pubDate": "Sun, 22 Jun 2025 14:15:01 GMT"
    },
    {
      "title": "Global Markets Dip as Traders Gauge Fallout From U.S. Strikes on Iran - The New York Times",
      "pubDate": "Mon, 23 Jun 2025 03:03:33 GMT"
    },
    {
      "title": "Stock Futures Drop, Oil Gains After Strike on Iran: Markets Wrap - Bloomberg.com",
      "pubDate": "Mon, 23 Jun 2025 07:33:22 GMT"
    },
    {
      "title": "Stocks Rise as Oil Fades and Fed Bets Sink Yields: Markets Wrap - Bloomberg.com",
      "pubDate": "Mon, 23 Jun 2025 20:13:39 GMT"
    },
    {
      "title": "US strikes on Iran shake up financial markets - KREM",
      "pubDate": "Mon, 23 Jun 2025 23:17:00 GMT"
    },
    {
      "title": "US stocks leap within a decent day of their all-time high as oil prices tumble - AP News",
      "pubDate": "Tue, 24 Jun 2025 19:18:00 GMT"
    }
  ],
  "Recession": [
    {
      "title": "Will This War Spark the Next Global Recession? US Strikes on Iran Rattle World Markets - Republic World",
      "pubDate": "Sun, 22 Jun 2025 12:18:13 GMT"
    }
  ],
  "China": [
    {
      "title": "China condemns US strikes on Iran, calls for ceasefire and talks - South China Morning Post",
      "pubDate": "Sun, 22 Jun 2025 11:38:08 GMT"
    },
    {
      "title": "China Says the U.S. Damaged Its Own Credibility by Striking Iran - The New York Times",
      "pubDate": "Mon, 23 Jun 2025 07:58:38 GMT"
    },
    {
      "title": "China says Taiwan president spreading 'heresy' with sovereignty speech - Reuters",
      "pubDate": "Mon, 23 Jun 2025 23:48:06 GMT"
    },
    {
      "title": "China doubles down on promoting yuan as confidence in U.S. dollar takes a beating - CNBC",
      "pubDate": "Wed, 25 Jun 2025 00:06:00 GMT"
    }
  ],
  "AI Safety": [
    {
      "title": "AI Deception and Blackmail: Anthropic Study Reveals Widespread Risks, Urges Proactive Safeguards - Oneindia",
      "pubDate": "Sun, 22 Jun 2025 08:57:11 GMT"
    },
    {
      "title": "AI models exhibit harmful behaviors, posing insider threats in corporate scenarios - CHOSUNBIZ - Chosunbiz",
      "pubDate": "Tue, 24 Jun 2025 08:35:00 GMT"
    }
  ],
  "Data Breach": [
    {
      "title": "Urgent alarm issued after ‘mother of all data breaches’ sees 16 billion passwords exposed — do this ASAP - AOL.com",
      "pubDate": "Sun, 22 Jun 2025 19:15:51 GMT"
    }
  ],
  "Cybersecurity": [
    {
      "title": "DHS expects Iran’s cyber forces will target US networks after strikes on nuclear sites - Nextgov",
      "pubDate": "Sun, 22 Jun 2025 19:39:27 GMT"
    }
  ],
  "US Economy": [
    {
      "title": "America’s economy faces a new war shock: Surging oil prices - CNN",
      "pubDate": "Sun, 22 Jun 2025 21:35:00 GMT"
    },
    {
      "title": "Ford Will Keep Battery Factory Even if Republicans Ax Tax Break - The New York Times",
      "pubDate": "Tue, 24 Jun 2025 00:37:40 GMT"
    },
    {
      "title": "Electricity prices soar as US regional grids wobble from extreme heat - MSN",
      "pubDate": "Wed, 25 Jun 2025 00:01:14 GMT"
    }
  ],
  "Trade War": [
    {
      "title": "US farmers face tough outlook as China switches suppliers amid trade war - South China Morning Post",
      "pubDate": "Mon, 23 Jun 2025 13:00:08 GMT"
    }
  ],
  "Asteroids": [
    {
      "title": "Thousands of asteroids and millions of galaxies shine in first images from the largest camera ever built - CNN",
      "pubDate": "Mon, 23 Jun 2025 04:01:00 GMT"
    },
    {
      "title": "Giant asteroid could crash into moon in 2032, firing debris towards Earth - The Guardian",
      "pubDate": "Tue, 24 Jun 2025 01:31:00 GMT"
    }
  ],
  "Atlantic Ocean": [
    {
      "title": "The Gulf Stream is on the verge of COLLAPSING, scientists warn - as they find the first concrete evidence of major ocean circulation system weakening - Daily Mail",
      "pubDate": "Mon, 23 Jun 2025 10:22:51 GMT"
    }
  ],
  "Business": [
    {
      "title": "Global Business Remains Resilient in Face of Tariffs, Middle East War - WSJ",
      "pubDate": "Mon, 23 Jun 2025 18:11:00 GMT"
    }
  ],
  "Astronomy": [
    {
      "title": "Vera Rubin Telescope Quickly Found 1,200 New Asteroids - The New York Times",
      "pubDate": "Mon, 23 Jun 2025 15:30:07 GMT"
    }
  ],
  "Earthquakes": [
    {
      "title": "Magnitude 5.8 earthquake strikes off Dominican Republic coast, USGS says - Yahoo",
      "pubDate": "Tue, 24 Jun 2025 03:00:00 GMT"
    }
  ],
  "Quantum Computer": [
    {
      "title": "China breaks RSA encryption with a quantum computer, threatening global data security - Earth.com",
      "pubDate": "Tue, 24 Jun 2025 13:30:29 GMT"
    }
  ],
  "Democratic Party": [
    {
      "title": "New York mayoral candidates face off in test of Democratic Party - BBC",
      "pubDate": "Tue, 24 Jun 2025 13:51:58 GMT"
    }
  ],
  "Hamas": [
    {
      "title": "Mediator: Ceasefire-hostage deal between Israel and Hamas possible ‘within days’ - The Times of Israel",
      "pubDate": "Wed, 25 Jun 2025 03:54:51 GMT"
    }
  ]
}